CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __TRIG8bits_t TRIG8bits __asm__ ("TRIG8") __attribute__((section("sfrs"), address(0xBF82A840)));
extern volatile uint32_t        TRIG8CLR __attribute__((section("sfrs"),address(0xBF82A844)));
extern volatile uint32_t        TRIG8SET __attribute__((section("sfrs"),address(0xBF82A848)));
extern volatile uint32_t        TRIG8INV __attribute__((section("sfrs"),address(0xBF82A84C)));
#define TRGCON8 TRGCON8
extern volatile uint32_t   TRGCON8 __attribute__((section("sfrs"), address(0xBF82A850)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON8bits_t;
extern volatile __TRGCON8bits_t TRGCON8bits __asm__ ("TRGCON8") __attribute__((section("sfrs"), address(0xBF82A850)));
extern volatile uint32_t        TRGCON8CLR __attribute__((section("sfrs"),address(0xBF82A854)));
extern volatile uint32_t        TRGCON8SET __attribute__((section("sfrs"),address(0xBF82A858)));
extern volatile uint32_t        TRGCON8INV __attribute__((section("sfrs"),address(0xBF82A85C)));
#define STRIG8 STRIG8
extern volatile uint32_t   STRIG8 __attribute__((section("sfrs"), address(0xBF82A860)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG8bits_t;
extern volatile __STRIG8bits_t STRIG8bits __asm__ ("STRIG8") __attribute__((section("sfrs"), address(0xBF82A860)));
extern volatile uint32_t        STRIG8CLR __attribute__((section("sfrs"),address(0xBF82A864)));
extern volatile uint32_t        STRIG8SET __attribute__((section("sfrs"),address(0xBF82A868)));
extern volatile uint32_t        STRIG8INV __attribute__((section("sfrs"),address(0xBF82A86C)));
#define CAP8 CAP8
extern volatile uint32_t   CAP8 __attribute__((section("sfrs"), address(0xBF82A870)));
typedef struct {
  uint32_t CAP:16;
} __CAP8bits_t;
extern volatile __CAP8bits_t CAP8bits __asm__ ("CAP8") __attribute__((section("sfrs"), address(0xBF82A870)));
extern volatile uint32_t        CAP8CLR __attribute__((section("sfrs"),address(0xBF82A874)));
extern volatile uint32_t        CAP8SET __attribute__((section("sfrs"),address(0xBF82A878)));
extern volatile uint32_t        CAP8INV __attribute__((section("sfrs"),address(0xBF82A87C)));
#define LEBCON8 LEBCON8
extern volatile uint32_t   LEBCON8 __attribute__((section("sfrs"), address(0xBF82A880)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON8bits_t;
extern volatile __LEBCON8bits_t LEBCON8bits __asm__ ("LEBCON8") __attribute__((section("sfrs"), address(0xBF82A880)));
extern volatile uint32_t        LEBCON8CLR __attribute__((section("sfrs"),address(0xBF82A884)));
extern volatile uint32_t        LEBCON8SET __attribute__((section("sfrs"),address(0xBF82A888)));
extern volatile uint32_t        LEBCON8INV __attribute__((section("sfrs"),address(0xBF82A88C)));
#define LEBDLY8 LEBDLY8
extern volatile uint32_t   LEBDLY8 __attribute__((section("sfrs"), address(0xBF82A890)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY8bits_t;
extern volatile __LEBDLY8bits_t LEBDLY8bits __asm__ ("LEBDLY8") __attribute__((section("sfrs"), address(0xBF82A890)));
extern volatile uint32_t        LEBDLY8CLR __attribute__((section("sfrs"),address(0xBF82A894)));
extern volatile uint32_t        LEBDLY8SET __attribute__((section("sfrs"),address(0xBF82A898)));
extern volatile uint32_t        LEBDLY8INV __attribute__((section("sfrs"),address(0xBF82A89C)));
#define AUXCON8 AUXCON8
extern volatile uint32_t   AUXCON8 __attribute__((section("sfrs"), address(0xBF82A8A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON8bits_t;
extern volatile __AUXCON8bits_t AUXCON8bits __asm__ ("AUXCON8") __attribute__((section("sfrs"), address(0xBF82A8A0)));
extern volatile uint32_t        AUXCON8CLR __attribute__((section("sfrs"),address(0xBF82A8A4)));
extern volatile uint32_t        AUXCON8SET __attribute__((section("sfrs"),address(0xBF82A8A8)));
extern volatile uint32_t        AUXCON8INV __attribute__((section("sfrs"),address(0xBF82A8AC)));
#define PTMR8 PTMR8
extern volatile uint32_t   PTMR8 __attribute__((section("sfrs"), address(0xBF82A8B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR8bits_t;
extern volatile __PTMR8bits_t PTMR8bits __asm__ ("PTMR8") __attribute__((section("sfrs"), address(0xBF82A8B0)));
extern volatile uint32_t        PTMR8CLR __attribute__((section("sfrs"),address(0xBF82A8B4)));
extern volatile uint32_t        PTMR8SET __attribute__((section("sfrs"),address(0xBF82A8B8)));
extern volatile uint32_t        PTMR8INV __attribute__((section("sfrs"),address(0xBF82A8BC)));
#define QEI1CON QEI1CON
extern volatile uint32_t   QEI1CON __attribute__((section("sfrs"), address(0xBF82B200)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI1CONbits_t;
extern volatile __QEI1CONbits_t QEI1CONbits __asm__ ("QEI1CON") __attribute__((section("sfrs"), address(0xBF82B200)));
extern volatile uint32_t        QEI1CONCLR __attribute__((section("sfrs"),address(0xBF82B204)));
extern volatile uint32_t        QEI1CONSET __attribute__((section("sfrs"),address(0xBF82B208)));
extern volatile uint32_t        QEI1CONINV __attribute__((section("sfrs"),address(0xBF82B20C)));
#define QEI1IOC QEI1IOC
extern volatile uint32_t   QEI1IOC __attribute__((section("sfrs"), address(0xBF82B210)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI1IOCbits_t;
extern volatile __QEI1IOCbits_t QEI1IOCbits __asm__ ("QEI1IOC") __attribute__((section("sfrs"), address(0xBF82B210)));
extern volatile uint32_t        QEI1IOCCLR __attribute__((section("sfrs"),address(0xBF82B214)));
extern volatile uint32_t        QEI1IOCSET __attribute__((section("sfrs"),address(0xBF82B218)));
extern volatile uint32_t        QEI1IOCINV __attribute__((section("sfrs"),address(0xBF82B21C)));
#define QEI1STAT QEI1STAT
extern volatile uint32_t   QEI1STAT __attribute__((section("sfrs"), address(0xBF82B220)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI1STATbits_t;
