CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __QEI1STATbits_t QEI1STATbits __asm__ ("QEI1STAT") __attribute__((section("sfrs"), address(0xBF82B220)));
extern volatile uint32_t        QEI1STATCLR __attribute__((section("sfrs"),address(0xBF82B224)));
extern volatile uint32_t        QEI1STATSET __attribute__((section("sfrs"),address(0xBF82B228)));
extern volatile uint32_t        QEI1STATINV __attribute__((section("sfrs"),address(0xBF82B22C)));
#define POS1CNT POS1CNT
extern volatile uint32_t   POS1CNT __attribute__((section("sfrs"), address(0xBF82B230)));
typedef struct {
  uint32_t POSCNT:32;
} __POS1CNTbits_t;
extern volatile __POS1CNTbits_t POS1CNTbits __asm__ ("POS1CNT") __attribute__((section("sfrs"), address(0xBF82B230)));
extern volatile uint32_t        POS1CNTCLR __attribute__((section("sfrs"),address(0xBF82B234)));
extern volatile uint32_t        POS1CNTSET __attribute__((section("sfrs"),address(0xBF82B238)));
extern volatile uint32_t        POS1CNTINV __attribute__((section("sfrs"),address(0xBF82B23C)));
#define POS1HLD POS1HLD
extern volatile uint32_t   POS1HLD __attribute__((section("sfrs"), address(0xBF82B240)));
typedef struct {
  uint32_t POSHLD:32;
} __POS1HLDbits_t;
extern volatile __POS1HLDbits_t POS1HLDbits __asm__ ("POS1HLD") __attribute__((section("sfrs"), address(0xBF82B240)));
extern volatile uint32_t        POS1HLDCLR __attribute__((section("sfrs"),address(0xBF82B244)));
extern volatile uint32_t        POS1HLDSET __attribute__((section("sfrs"),address(0xBF82B248)));
extern volatile uint32_t        POS1HLDINV __attribute__((section("sfrs"),address(0xBF82B24C)));
#define VEL1CNT VEL1CNT
extern volatile uint32_t   VEL1CNT __attribute__((section("sfrs"), address(0xBF82B250)));
typedef struct {
  uint32_t VELCNT:32;
} __VEL1CNTbits_t;
extern volatile __VEL1CNTbits_t VEL1CNTbits __asm__ ("VEL1CNT") __attribute__((section("sfrs"), address(0xBF82B250)));
extern volatile uint32_t        VEL1CNTCLR __attribute__((section("sfrs"),address(0xBF82B254)));
extern volatile uint32_t        VEL1CNTSET __attribute__((section("sfrs"),address(0xBF82B258)));
extern volatile uint32_t        VEL1CNTINV __attribute__((section("sfrs"),address(0xBF82B25C)));
#define VEL1HLD VEL1HLD
extern volatile uint32_t   VEL1HLD __attribute__((section("sfrs"), address(0xBF82B260)));
typedef struct {
  uint32_t VELHLD:32;
} __VEL1HLDbits_t;
extern volatile __VEL1HLDbits_t VEL1HLDbits __asm__ ("VEL1HLD") __attribute__((section("sfrs"), address(0xBF82B260)));
extern volatile uint32_t        VEL1HLDCLR __attribute__((section("sfrs"),address(0xBF82B264)));
extern volatile uint32_t        VEL1HLDSET __attribute__((section("sfrs"),address(0xBF82B268)));
extern volatile uint32_t        VEL1HLDINV __attribute__((section("sfrs"),address(0xBF82B26C)));
#define INT1TMR INT1TMR
extern volatile uint32_t   INT1TMR __attribute__((section("sfrs"), address(0xBF82B270)));
typedef struct {
  uint32_t INTTMR:32;
} __INT1TMRbits_t;
extern volatile __INT1TMRbits_t INT1TMRbits __asm__ ("INT1TMR") __attribute__((section("sfrs"), address(0xBF82B270)));
extern volatile uint32_t        INT1TMRCLR __attribute__((section("sfrs"),address(0xBF82B274)));
extern volatile uint32_t        INT1TMRSET __attribute__((section("sfrs"),address(0xBF82B278)));
extern volatile uint32_t        INT1TMRINV __attribute__((section("sfrs"),address(0xBF82B27C)));
#define INT1HLD INT1HLD
extern volatile uint32_t   INT1HLD __attribute__((section("sfrs"), address(0xBF82B280)));
typedef struct {
  uint32_t INTHLD:32;
} __INT1HLDbits_t;
extern volatile __INT1HLDbits_t INT1HLDbits __asm__ ("INT1HLD") __attribute__((section("sfrs"), address(0xBF82B280)));
extern volatile uint32_t        INT1HLDCLR __attribute__((section("sfrs"),address(0xBF82B284)));
extern volatile uint32_t        INT1HLDSET __attribute__((section("sfrs"),address(0xBF82B288)));
extern volatile uint32_t        INT1HLDINV __attribute__((section("sfrs"),address(0xBF82B28C)));
#define INDX1CNT INDX1CNT
extern volatile uint32_t   INDX1CNT __attribute__((section("sfrs"), address(0xBF82B290)));
typedef struct {
  uint32_t INDXCNT:32;
} __INDX1CNTbits_t;
extern volatile __INDX1CNTbits_t INDX1CNTbits __asm__ ("INDX1CNT") __attribute__((section("sfrs"), address(0xBF82B290)));
extern volatile uint32_t        INDX1CNTCLR __attribute__((section("sfrs"),address(0xBF82B294)));
extern volatile uint32_t        INDX1CNTSET __attribute__((section("sfrs"),address(0xBF82B298)));
extern volatile uint32_t        INDX1CNTINV __attribute__((section("sfrs"),address(0xBF82B29C)));
#define INDX1HLD INDX1HLD
extern volatile uint32_t   INDX1HLD __attribute__((section("sfrs"), address(0xBF82B2A0)));
typedef struct {
  uint32_t INDXHLD:32;
} __INDX1HLDbits_t;
extern volatile __INDX1HLDbits_t INDX1HLDbits __asm__ ("INDX1HLD") __attribute__((section("sfrs"), address(0xBF82B2A0)));
extern volatile uint32_t        INDX1HLDCLR __attribute__((section("sfrs"),address(0xBF82B2A4)));
extern volatile uint32_t        INDX1HLDSET __attribute__((section("sfrs"),address(0xBF82B2A8)));
extern volatile uint32_t        INDX1HLDINV __attribute__((section("sfrs"),address(0xBF82B2AC)));
#define QEI1ICC QEI1ICC
extern volatile uint32_t   QEI1ICC __attribute__((section("sfrs"), address(0xBF82B2B0)));
typedef struct {
  uint32_t QEIICC:32;
} __QEI1ICCbits_t;
extern volatile __QEI1ICCbits_t QEI1ICCbits __asm__ ("QEI1ICC") __attribute__((section("sfrs"), address(0xBF82B2B0)));
extern volatile uint32_t        QEI1ICCCLR __attribute__((section("sfrs"),address(0xBF82B2B4)));
extern volatile uint32_t        QEI1ICCSET __attribute__((section("sfrs"),address(0xBF82B2B8)));
extern volatile uint32_t        QEI1ICCINV __attribute__((section("sfrs"),address(0xBF82B2BC)));
#define QEI1CMPL QEI1CMPL
extern volatile uint32_t   QEI1CMPL __attribute__((section("sfrs"), address(0xBF82B2C0)));
typedef struct {
  uint32_t QEICMPL:32;
} __QEI1CMPLbits_t;
extern volatile __QEI1CMPLbits_t QEI1CMPLbits __asm__ ("QEI1CMPL") __attribute__((section("sfrs"), address(0xBF82B2C0)));
extern volatile uint32_t        QEI1CMPLCLR __attribute__((section("sfrs"),address(0xBF82B2C4)));
extern volatile uint32_t        QEI1CMPLSET __attribute__((section("sfrs"),address(0xBF82B2C8)));
extern volatile uint32_t        QEI1CMPLINV __attribute__((section("sfrs"),address(0xBF82B2CC)));
#define QEI2CON QEI2CON
extern volatile uint32_t   QEI2CON __attribute__((section("sfrs"), address(0xBF82B400)));
typedef struct {
  uint32_t CCM:2;
  uint32_t GATEN:1;
  uint32_t CNTPOL:1;
  uint32_t INTDIV:3;
  uint32_t :1;
  uint32_t IMV:2;
  uint32_t PIMOD:3;
  uint32_t QEISIDL:1;
  uint32_t :1;
  uint32_t QEIEN:1;
} __QEI2CONbits_t;
extern volatile __QEI2CONbits_t QEI2CONbits __asm__ ("QEI2CON") __attribute__((section("sfrs"), address(0xBF82B400)));
extern volatile uint32_t        QEI2CONCLR __attribute__((section("sfrs"),address(0xBF82B404)));
extern volatile uint32_t        QEI2CONSET __attribute__((section("sfrs"),address(0xBF82B408)));
extern volatile uint32_t        QEI2CONINV __attribute__((section("sfrs"),address(0xBF82B40C)));
#define QEI2IOC QEI2IOC
extern volatile uint32_t   QEI2IOC __attribute__((section("sfrs"), address(0xBF82B410)));
typedef struct {
  uint32_t QEA:1;
  uint32_t QEB:1;
  uint32_t INDEX:1;
  uint32_t HOME:1;
  uint32_t QEAPOL:1;
  uint32_t QEBPOL:1;
  uint32_t IDXPOL:1;
  uint32_t HOMPOL:1;
  uint32_t SWPAB:1;
  uint32_t OUTFNC:2;
  uint32_t QFDIV:3;
  uint32_t FLTREN:1;
  uint32_t QCAPEN:1;
  uint32_t HCAPEN:1;
} __QEI2IOCbits_t;
extern volatile __QEI2IOCbits_t QEI2IOCbits __asm__ ("QEI2IOC") __attribute__((section("sfrs"), address(0xBF82B410)));
extern volatile uint32_t        QEI2IOCCLR __attribute__((section("sfrs"),address(0xBF82B414)));
extern volatile uint32_t        QEI2IOCSET __attribute__((section("sfrs"),address(0xBF82B418)));
extern volatile uint32_t        QEI2IOCINV __attribute__((section("sfrs"),address(0xBF82B41C)));
#define QEI2STAT QEI2STAT
extern volatile uint32_t   QEI2STAT __attribute__((section("sfrs"), address(0xBF82B420)));
typedef struct {
  uint32_t IDXIEN:1;
  uint32_t IDXIRQ:1;
  uint32_t HOMIEN:1;
  uint32_t HOMIRQ:1;
  uint32_t VELOVIEN:1;
  uint32_t VELOVIRQ:1;
  uint32_t PCIIEN:1;
  uint32_t PCIIRQ:1;
  uint32_t POSOVIEN:1;
  uint32_t POSOVIRQ:1;
  uint32_t PCLEQIEN:1;
  uint32_t PCLEQIRQ:1;
  uint32_t PCHEQIEN:1;
  uint32_t PCHEQIRQ:1;
} __QEI2STATbits_t;
extern volatile __QEI2STATbits_t QEI2STATbits __asm__ ("QEI2STAT") __attribute__((section("sfrs"), address(0xBF82B420)));
extern volatile uint32_t        QEI2STATCLR __attribute__((section("sfrs"),address(0xBF82B424)));
extern volatile uint32_t        QEI2STATSET __attribute__((section("sfrs"),address(0xBF82B428)));
extern volatile uint32_t        QEI2STATINV __attribute__((section("sfrs"),address(0xBF82B42C)));
#define POS2CNT POS2CNT
extern volatile uint32_t   POS2CNT __attribute__((section("sfrs"), address(0xBF82B430)));
typedef struct {
  uint32_t POSCNT:32;
} __POS2CNTbits_t;
extern volatile __POS2CNTbits_t POS2CNTbits __asm__ ("POS2CNT") __attribute__((section("sfrs"), address(0xBF82B430)));
extern volatile uint32_t        POS2CNTCLR __attribute__((section("sfrs"),address(0xBF82B434)));
extern volatile uint32_t        POS2CNTSET __attribute__((section("sfrs"),address(0xBF82B438)));
extern volatile uint32_t        POS2CNTINV __attribute__((section("sfrs"),address(0xBF82B43C)));
#define POS2HLD POS2HLD
extern volatile uint32_t   POS2HLD __attribute__((section("sfrs"), address(0xBF82B440)));
typedef struct {
  uint32_t POSHLD:32;
} __POS2HLDbits_t;
