CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs"), address(0xBF82C010)));
extern volatile uint32_t        CM1CONCLR __attribute__((section("sfrs"),address(0xBF82C014)));
extern volatile uint32_t        CM1CONSET __attribute__((section("sfrs"),address(0xBF82C018)));
extern volatile uint32_t        CM1CONINV __attribute__((section("sfrs"),address(0xBF82C01C)));
#define CM2CON CM2CON
extern volatile uint32_t   CM2CON __attribute__((section("sfrs"), address(0xBF82C030)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :3;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
  uint32_t :7;
  uint32_t ENPGA:1;
  uint32_t OPAON:1;
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs"), address(0xBF82C030)));
extern volatile uint32_t        CM2CONCLR __attribute__((section("sfrs"),address(0xBF82C034)));
extern volatile uint32_t        CM2CONSET __attribute__((section("sfrs"),address(0xBF82C038)));
extern volatile uint32_t        CM2CONINV __attribute__((section("sfrs"),address(0xBF82C03C)));
#define CM3CON CM3CON
extern volatile uint32_t   CM3CON __attribute__((section("sfrs"), address(0xBF82C050)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :3;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
  uint32_t :7;
  uint32_t ENPGA:1;
  uint32_t OPAON:1;
} __CM3CONbits_t;
extern volatile __CM3CONbits_t CM3CONbits __asm__ ("CM3CON") __attribute__((section("sfrs"), address(0xBF82C050)));
extern volatile uint32_t        CM3CONCLR __attribute__((section("sfrs"),address(0xBF82C054)));
extern volatile uint32_t        CM3CONSET __attribute__((section("sfrs"),address(0xBF82C058)));
extern volatile uint32_t        CM3CONINV __attribute__((section("sfrs"),address(0xBF82C05C)));
#define CM4CON CM4CON
extern volatile uint32_t   CM4CON __attribute__((section("sfrs"), address(0xBF82C070)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :3;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
  uint32_t :7;
  uint32_t ENPGA:1;
  uint32_t OPAON:1;
} __CM4CONbits_t;
extern volatile __CM4CONbits_t CM4CONbits __asm__ ("CM4CON") __attribute__((section("sfrs"), address(0xBF82C070)));
extern volatile uint32_t        CM4CONCLR __attribute__((section("sfrs"),address(0xBF82C074)));
extern volatile uint32_t        CM4CONSET __attribute__((section("sfrs"),address(0xBF82C078)));
extern volatile uint32_t        CM4CONINV __attribute__((section("sfrs"),address(0xBF82C07C)));
#define CM5CON CM5CON
extern volatile uint32_t   CM5CON __attribute__((section("sfrs"), address(0xBF82C090)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :3;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
  uint32_t :7;
  uint32_t ENPGA:1;
  uint32_t OPAON:1;
} __CM5CONbits_t;
extern volatile __CM5CONbits_t CM5CONbits __asm__ ("CM5CON") __attribute__((section("sfrs"), address(0xBF82C090)));
extern volatile uint32_t        CM5CONCLR __attribute__((section("sfrs"),address(0xBF82C094)));
extern volatile uint32_t        CM5CONSET __attribute__((section("sfrs"),address(0xBF82C098)));
extern volatile uint32_t        CM5CONINV __attribute__((section("sfrs"),address(0xBF82C09C)));
#define DAC2CON DAC2CON
extern volatile uint32_t   DAC2CON __attribute__((section("sfrs"), address(0xBF82C400)));
typedef struct {
  uint32_t REFSEL:2;
  uint32_t :6;
  uint32_t DACOE:1;
  uint32_t :6;
  uint32_t ON:1;
  uint32_t DACDAT:16;
} __DAC2CONbits_t;
extern volatile __DAC2CONbits_t DAC2CONbits __asm__ ("DAC2CON") __attribute__((section("sfrs"), address(0xBF82C400)));
extern volatile uint32_t        DAC2CONCLR __attribute__((section("sfrs"),address(0xBF82C404)));
extern volatile uint32_t        DAC2CONSET __attribute__((section("sfrs"),address(0xBF82C408)));
extern volatile uint32_t        DAC2CONINV __attribute__((section("sfrs"),address(0xBF82C40C)));
#define DAC3CON DAC3CON
extern volatile uint32_t   DAC3CON __attribute__((section("sfrs"), address(0xBF82C600)));
typedef struct {
  uint32_t REFSEL:2;
  uint32_t :6;
  uint32_t DACOE:1;
  uint32_t :6;
  uint32_t ON:1;
  uint32_t DACDAT:16;
} __DAC3CONbits_t;
extern volatile __DAC3CONbits_t DAC3CONbits __asm__ ("DAC3CON") __attribute__((section("sfrs"), address(0xBF82C600)));
extern volatile uint32_t        DAC3CONCLR __attribute__((section("sfrs"),address(0xBF82C604)));
extern volatile uint32_t        DAC3CONSET __attribute__((section("sfrs"),address(0xBF82C608)));
extern volatile uint32_t        DAC3CONINV __attribute__((section("sfrs"),address(0xBF82C60C)));
#define CTMUCON CTMUCON
extern volatile uint32_t   CTMUCON __attribute__((section("sfrs"), address(0xBF82D000)));
typedef union {
  struct {
    uint32_t IRNG:2;
    uint32_t ITRIM:6;
    uint32_t CTTRIG:1;
    uint32_t IDISSEN:1;
    uint32_t EDGSEQEN:1;
    uint32_t EDGEN:1;
    uint32_t TGEN:1;
    uint32_t CTMUSIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :2;
    uint32_t EDG2SEL:4;
    uint32_t EDG2POL:1;
    uint32_t EDG2MOD:1;
    uint32_t EDG1STAT:1;
    uint32_t EDG2STAT:1;
    uint32_t EDG1SEL:4;
    uint32_t EDG1POL:1;
    uint32_t EDG1MOD:1;
  };
  struct {
    uint32_t w:32;
  };
} __CTMUCONbits_t;
extern volatile __CTMUCONbits_t CTMUCONbits __asm__ ("CTMUCON") __attribute__((section("sfrs"), address(0xBF82D000)));
extern volatile uint32_t        CTMUCONCLR __attribute__((section("sfrs"),address(0xBF82D004)));
extern volatile uint32_t        CTMUCONSET __attribute__((section("sfrs"),address(0xBF82D008)));
extern volatile uint32_t        CTMUCONINV __attribute__((section("sfrs"),address(0xBF82D00C)));
#define CLC1CON CLC1CON
extern volatile uint32_t   CLC1CON __attribute__((section("sfrs"), address(0xBF82D200)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC1CONbits_t;
extern volatile __CLC1CONbits_t CLC1CONbits __asm__ ("CLC1CON") __attribute__((section("sfrs"), address(0xBF82D200)));
extern volatile uint32_t        CLC1CONCLR __attribute__((section("sfrs"),address(0xBF82D204)));
extern volatile uint32_t        CLC1CONSET __attribute__((section("sfrs"),address(0xBF82D208)));
extern volatile uint32_t        CLC1CONINV __attribute__((section("sfrs"),address(0xBF82D20C)));
#define CLC1SEL CLC1SEL
extern volatile uint32_t   CLC1SEL __attribute__((section("sfrs"), address(0xBF82D210)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC1SELbits_t;
extern volatile __CLC1SELbits_t CLC1SELbits __asm__ ("CLC1SEL") __attribute__((section("sfrs"), address(0xBF82D210)));
extern volatile uint32_t        CLC1SELCLR __attribute__((section("sfrs"),address(0xBF82D214)));
extern volatile uint32_t        CLC1SELSET __attribute__((section("sfrs"),address(0xBF82D218)));
extern volatile uint32_t        CLC1SELINV __attribute__((section("sfrs"),address(0xBF82D21C)));
#define CLC1GLS CLC1GLS
extern volatile uint32_t   CLC1GLS __attribute__((section("sfrs"), address(0xBF82D220)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC1GLSbits_t;
extern volatile __CLC1GLSbits_t CLC1GLSbits __asm__ ("CLC1GLS") __attribute__((section("sfrs"), address(0xBF82D220)));
extern volatile uint32_t        CLC1GLSCLR __attribute__((section("sfrs"),address(0xBF82D224)));
extern volatile uint32_t        CLC1GLSSET __attribute__((section("sfrs"),address(0xBF82D228)));
extern volatile uint32_t        CLC1GLSINV __attribute__((section("sfrs"),address(0xBF82D22C)));
#define CLC2CON CLC2CON
extern volatile uint32_t   CLC2CON __attribute__((section("sfrs"), address(0xBF82D400)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC2CONbits_t;
