CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __CLC2CONbits_t CLC2CONbits __asm__ ("CLC2CON") __attribute__((section("sfrs"), address(0xBF82D400)));
extern volatile uint32_t        CLC2CONCLR __attribute__((section("sfrs"),address(0xBF82D404)));
extern volatile uint32_t        CLC2CONSET __attribute__((section("sfrs"),address(0xBF82D408)));
extern volatile uint32_t        CLC2CONINV __attribute__((section("sfrs"),address(0xBF82D40C)));
#define CLC2SEL CLC2SEL
extern volatile uint32_t   CLC2SEL __attribute__((section("sfrs"), address(0xBF82D410)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC2SELbits_t;
extern volatile __CLC2SELbits_t CLC2SELbits __asm__ ("CLC2SEL") __attribute__((section("sfrs"), address(0xBF82D410)));
extern volatile uint32_t        CLC2SELCLR __attribute__((section("sfrs"),address(0xBF82D414)));
extern volatile uint32_t        CLC2SELSET __attribute__((section("sfrs"),address(0xBF82D418)));
extern volatile uint32_t        CLC2SELINV __attribute__((section("sfrs"),address(0xBF82D41C)));
#define CLC2GLS CLC2GLS
extern volatile uint32_t   CLC2GLS __attribute__((section("sfrs"), address(0xBF82D420)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC2GLSbits_t;
extern volatile __CLC2GLSbits_t CLC2GLSbits __asm__ ("CLC2GLS") __attribute__((section("sfrs"), address(0xBF82D420)));
extern volatile uint32_t        CLC2GLSCLR __attribute__((section("sfrs"),address(0xBF82D424)));
extern volatile uint32_t        CLC2GLSSET __attribute__((section("sfrs"),address(0xBF82D428)));
extern volatile uint32_t        CLC2GLSINV __attribute__((section("sfrs"),address(0xBF82D42C)));
#define CLC3CON CLC3CON
extern volatile uint32_t   CLC3CON __attribute__((section("sfrs"), address(0xBF82D600)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC3CONbits_t;
extern volatile __CLC3CONbits_t CLC3CONbits __asm__ ("CLC3CON") __attribute__((section("sfrs"), address(0xBF82D600)));
extern volatile uint32_t        CLC3CONCLR __attribute__((section("sfrs"),address(0xBF82D604)));
extern volatile uint32_t        CLC3CONSET __attribute__((section("sfrs"),address(0xBF82D608)));
extern volatile uint32_t        CLC3CONINV __attribute__((section("sfrs"),address(0xBF82D60C)));
#define CLC3SEL CLC3SEL
extern volatile uint32_t   CLC3SEL __attribute__((section("sfrs"), address(0xBF82D610)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC3SELbits_t;
extern volatile __CLC3SELbits_t CLC3SELbits __asm__ ("CLC3SEL") __attribute__((section("sfrs"), address(0xBF82D610)));
extern volatile uint32_t        CLC3SELCLR __attribute__((section("sfrs"),address(0xBF82D614)));
extern volatile uint32_t        CLC3SELSET __attribute__((section("sfrs"),address(0xBF82D618)));
extern volatile uint32_t        CLC3SELINV __attribute__((section("sfrs"),address(0xBF82D61C)));
#define CLC3GLS CLC3GLS
extern volatile uint32_t   CLC3GLS __attribute__((section("sfrs"), address(0xBF82D620)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC3GLSbits_t;
extern volatile __CLC3GLSbits_t CLC3GLSbits __asm__ ("CLC3GLS") __attribute__((section("sfrs"), address(0xBF82D620)));
extern volatile uint32_t        CLC3GLSCLR __attribute__((section("sfrs"),address(0xBF82D624)));
extern volatile uint32_t        CLC3GLSSET __attribute__((section("sfrs"),address(0xBF82D628)));
extern volatile uint32_t        CLC3GLSINV __attribute__((section("sfrs"),address(0xBF82D62C)));
#define CLC4CON CLC4CON
extern volatile uint32_t   CLC4CON __attribute__((section("sfrs"), address(0xBF82D800)));
typedef struct {
  uint32_t MODE:3;
  uint32_t :2;
  uint32_t LCPOL:1;
  uint32_t LCOUT:1;
  uint32_t LCOE:1;
  uint32_t :2;
  uint32_t INTN:1;
  uint32_t INTP:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t G1POL:1;
  uint32_t G2POL:1;
  uint32_t G3POL:1;
  uint32_t G4POL:1;
} __CLC4CONbits_t;
extern volatile __CLC4CONbits_t CLC4CONbits __asm__ ("CLC4CON") __attribute__((section("sfrs"), address(0xBF82D800)));
extern volatile uint32_t        CLC4CONCLR __attribute__((section("sfrs"),address(0xBF82D804)));
extern volatile uint32_t        CLC4CONSET __attribute__((section("sfrs"),address(0xBF82D808)));
extern volatile uint32_t        CLC4CONINV __attribute__((section("sfrs"),address(0xBF82D80C)));
#define CLC4SEL CLC4SEL
extern volatile uint32_t   CLC4SEL __attribute__((section("sfrs"), address(0xBF82D810)));
typedef struct {
  uint32_t DS1:3;
  uint32_t :1;
  uint32_t DS2:3;
  uint32_t :1;
  uint32_t DS3:3;
  uint32_t :1;
  uint32_t DS4:3;
} __CLC4SELbits_t;
extern volatile __CLC4SELbits_t CLC4SELbits __asm__ ("CLC4SEL") __attribute__((section("sfrs"), address(0xBF82D810)));
extern volatile uint32_t        CLC4SELCLR __attribute__((section("sfrs"),address(0xBF82D814)));
extern volatile uint32_t        CLC4SELSET __attribute__((section("sfrs"),address(0xBF82D818)));
extern volatile uint32_t        CLC4SELINV __attribute__((section("sfrs"),address(0xBF82D81C)));
#define CLC4GLS CLC4GLS
extern volatile uint32_t   CLC4GLS __attribute__((section("sfrs"), address(0xBF82D820)));
typedef struct {
  uint32_t G1D1N:1;
  uint32_t G1D1T:1;
  uint32_t G1D2N:1;
  uint32_t G1D2T:1;
  uint32_t G1D3N:1;
  uint32_t G1D3T:1;
  uint32_t G1D4N:1;
  uint32_t G1D4T:1;
  uint32_t G2D1N:1;
  uint32_t G2D1T:1;
  uint32_t G2D2N:1;
  uint32_t G2D2T:1;
  uint32_t G2D3N:1;
  uint32_t G2D3T:1;
  uint32_t G2D4N:1;
  uint32_t G2D4T:1;
  uint32_t G3D1N:1;
  uint32_t G3D1T:1;
  uint32_t G3D2N:1;
  uint32_t G3D2T:1;
  uint32_t G3D3N:1;
  uint32_t G3D3T:1;
  uint32_t G3D4N:1;
  uint32_t G3D4T:1;
  uint32_t G4D1N:1;
  uint32_t G4D1T:1;
  uint32_t G4D2N:1;
  uint32_t G4D2T:1;
  uint32_t G4D3N:1;
  uint32_t G4D3T:1;
  uint32_t G4D4N:1;
  uint32_t G4D4T:1;
} __CLC4GLSbits_t;
