CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs"), address(0xBF860680)));
extern volatile uint32_t        CNENGCLR __attribute__((section("sfrs"),address(0xBF860684)));
extern volatile uint32_t        CNENGSET __attribute__((section("sfrs"),address(0xBF860688)));
extern volatile uint32_t        CNENGINV __attribute__((section("sfrs"),address(0xBF86068C)));
#define CNSTATG CNSTATG
extern volatile uint32_t   CNSTATG __attribute__((section("sfrs"), address(0xBF860690)));
typedef union {
  struct {
    uint32_t :6;
    uint32_t CNSTATG6:1;
    uint32_t CNSTATG7:1;
    uint32_t CNSTATG8:1;
    uint32_t CNSTATG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs"), address(0xBF860690)));
extern volatile uint32_t        CNSTATGCLR __attribute__((section("sfrs"),address(0xBF860694)));
extern volatile uint32_t        CNSTATGSET __attribute__((section("sfrs"),address(0xBF860698)));
extern volatile uint32_t        CNSTATGINV __attribute__((section("sfrs"),address(0xBF86069C)));
#define CNNEG CNNEG
extern volatile uint32_t   CNNEG __attribute__((section("sfrs"), address(0xBF8606A0)));
typedef struct {
  uint32_t :6;
  uint32_t CNNEG6:1;
  uint32_t CNNEG7:1;
  uint32_t CNNEG8:1;
  uint32_t CNNEG9:1;
} __CNNEGbits_t;
extern volatile __CNNEGbits_t CNNEGbits __asm__ ("CNNEG") __attribute__((section("sfrs"), address(0xBF8606A0)));
extern volatile uint32_t        CNNEGCLR __attribute__((section("sfrs"),address(0xBF8606A4)));
extern volatile uint32_t        CNNEGSET __attribute__((section("sfrs"),address(0xBF8606A8)));
extern volatile uint32_t        CNNEGINV __attribute__((section("sfrs"),address(0xBF8606AC)));
#define CNFG CNFG
extern volatile uint32_t   CNFG __attribute__((section("sfrs"), address(0xBF8606B0)));
typedef struct {
  uint32_t :6;
  uint32_t CNFG6:1;
  uint32_t CNFG7:1;
  uint32_t CNFG8:1;
  uint32_t CNFG9:1;
} __CNFGbits_t;
extern volatile __CNFGbits_t CNFGbits __asm__ ("CNFG") __attribute__((section("sfrs"), address(0xBF8606B0)));
extern volatile uint32_t        CNFGCLR __attribute__((section("sfrs"),address(0xBF8606B4)));
extern volatile uint32_t        CNFGSET __attribute__((section("sfrs"),address(0xBF8606B8)));
extern volatile uint32_t        CNFGINV __attribute__((section("sfrs"),address(0xBF8606BC)));
#define SRCON0G SRCON0G
extern volatile uint32_t   SRCON0G __attribute__((section("sfrs"), address(0xBF8606C0)));
typedef struct {
  uint32_t SR0G0:1;
  uint32_t SR0G1:1;
  uint32_t SR0G2:1;
  uint32_t SR0G3:1;
  uint32_t SR0G4:1;
  uint32_t SR0G5:1;
  uint32_t SR0G6:1;
  uint32_t SR0G7:1;
  uint32_t SR0G8:1;
  uint32_t SR0G9:1;
  uint32_t SR0G10:1;
  uint32_t SR0G11:1;
  uint32_t SR0G12:1;
  uint32_t SR0G13:1;
  uint32_t SR0G14:1;
  uint32_t SR0G15:1;
} __SRCON0Gbits_t;
extern volatile __SRCON0Gbits_t SRCON0Gbits __asm__ ("SRCON0G") __attribute__((section("sfrs"), address(0xBF8606C0)));
extern volatile uint32_t        SRCON0GCLR __attribute__((section("sfrs"),address(0xBF8606C4)));
extern volatile uint32_t        SRCON0GSET __attribute__((section("sfrs"),address(0xBF8606C8)));
extern volatile uint32_t        SRCON0GINV __attribute__((section("sfrs"),address(0xBF8606CC)));
#define SRCON1G SRCON1G
extern volatile uint32_t   SRCON1G __attribute__((section("sfrs"), address(0xBF8606D0)));
typedef struct {
  uint32_t SR1G0:1;
  uint32_t SR1G1:1;
  uint32_t SR1G2:1;
  uint32_t SR1G3:1;
  uint32_t SR1G4:1;
  uint32_t SR1G5:1;
  uint32_t SR1G6:1;
  uint32_t SR1G7:1;
  uint32_t SR1G8:1;
  uint32_t SR1G9:1;
  uint32_t SR1G10:1;
  uint32_t SR1G11:1;
  uint32_t SR1G12:1;
  uint32_t SR1G13:1;
  uint32_t SR1G14:1;
  uint32_t SR1G15:1;
} __SRCON1Gbits_t;
extern volatile __SRCON1Gbits_t SRCON1Gbits __asm__ ("SRCON1G") __attribute__((section("sfrs"), address(0xBF8606D0)));
extern volatile uint32_t        SRCON1GCLR __attribute__((section("sfrs"),address(0xBF8606D4)));
extern volatile uint32_t        SRCON1GSET __attribute__((section("sfrs"),address(0xBF8606D8)));
extern volatile uint32_t        SRCON1GINV __attribute__((section("sfrs"),address(0xBF8606DC)));
#define C1CON C1CON
extern volatile uint32_t   C1CON __attribute__((section("sfrs"), address(0xBF880000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t ISOCRCEN:1;
    uint32_t PXEDIS:1;
    uint32_t CLKSEL0:1;
    uint32_t WAKFIL:1;
    uint32_t WFT:2;
    uint32_t CANBUSY:1;
    uint32_t BRSDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t RTXAT:1;
    uint32_t ESIGM:1;
    uint32_t SERR2LOM:1;
    uint32_t STEF:1;
    uint32_t TXQEN:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
    uint32_t TXBWS:4;
  };
  struct {
    uint32_t w:32;
  };
} __C1CONbits_t;
extern volatile __C1CONbits_t C1CONbits __asm__ ("C1CON") __attribute__((section("sfrs"), address(0xBF880000)));
#define C1NBTCFG C1NBTCFG
extern volatile uint32_t   C1NBTCFG __attribute__((section("sfrs"), address(0xBF880004)));
typedef struct {
  uint32_t SJW:7;
  uint32_t :1;
  uint32_t TSEG2:7;
  uint32_t :1;
  uint32_t TSEG1:8;
  uint32_t BRP:8;
} __C1NBTCFGbits_t;
extern volatile __C1NBTCFGbits_t C1NBTCFGbits __asm__ ("C1NBTCFG") __attribute__((section("sfrs"), address(0xBF880004)));
#define C1DBTCFG C1DBTCFG
extern volatile uint32_t   C1DBTCFG __attribute__((section("sfrs"), address(0xBF880008)));
typedef struct {
  uint32_t SJW:4;
  uint32_t :4;
  uint32_t TSEG2:4;
  uint32_t :4;
  uint32_t TSEG1:5;
  uint32_t :3;
  uint32_t BRP:8;
} __C1DBTCFGbits_t;
extern volatile __C1DBTCFGbits_t C1DBTCFGbits __asm__ ("C1DBTCFG") __attribute__((section("sfrs"), address(0xBF880008)));
#define C1TDC C1TDC
extern volatile uint32_t   C1TDC __attribute__((section("sfrs"), address(0xBF88000C)));
typedef struct {
  uint32_t TDCV:6;
  uint32_t :2;
  uint32_t TDCO:7;
  uint32_t :1;
  uint32_t TDCMOD:2;
  uint32_t :6;
  uint32_t SID11EN:1;
  uint32_t EDGFLTEN:1;
} __C1TDCbits_t;
extern volatile __C1TDCbits_t C1TDCbits __asm__ ("C1TDC") __attribute__((section("sfrs"), address(0xBF88000C)));
#define C1TBC C1TBC
extern volatile uint32_t   C1TBC __attribute__((section("sfrs"), address(0xBF880010)));
typedef struct {
  uint32_t TBC:32;
} __C1TBCbits_t;
extern volatile __C1TBCbits_t C1TBCbits __asm__ ("C1TBC") __attribute__((section("sfrs"), address(0xBF880010)));
#define C1TSCON C1TSCON
extern volatile uint32_t   C1TSCON __attribute__((section("sfrs"), address(0xBF880014)));
typedef struct {
  uint32_t TBCPRE:10;
  uint32_t :6;
  uint32_t TBCEN:1;
  uint32_t TSEOF:1;
  uint32_t TSRES:1;
} __C1TSCONbits_t;
