CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1TSCONbits_t C1TSCONbits __asm__ ("C1TSCON") __attribute__((section("sfrs"), address(0xBF880014)));
#define C1VEC C1VEC
extern volatile uint32_t   C1VEC __attribute__((section("sfrs"), address(0xBF880018)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
    uint32_t :3;
    uint32_t TXCODE:7;
    uint32_t :1;
    uint32_t RXCODE:7;
  };
  struct {
    uint32_t w:32;
  };
} __C1VECbits_t;
extern volatile __C1VECbits_t C1VECbits __asm__ ("C1VEC") __attribute__((section("sfrs"), address(0xBF880018)));
#define C1INT C1INT
extern volatile uint32_t   C1INT __attribute__((section("sfrs"), address(0xBF88001C)));
typedef union {
  struct {
    uint32_t TXIF:1;
    uint32_t RXIF:1;
    uint32_t TBCIF:1;
    uint32_t MODIF:1;
    uint32_t TEFIF:1;
    uint32_t :3;
    uint32_t ECCIF:1;
    uint32_t SPICRCIF:1;
    uint32_t TXATIF:1;
    uint32_t RXOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVMIF:1;
    uint32_t TXIE:1;
    uint32_t RXIE:1;
    uint32_t TBCIE:1;
    uint32_t MODIE:1;
    uint32_t TEFIE:1;
    uint32_t :3;
    uint32_t ECCIE:1;
    uint32_t SPICRCIE:1;
    uint32_t TXATIE:1;
    uint32_t RXOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVMIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1INTbits_t;
extern volatile __C1INTbits_t C1INTbits __asm__ ("C1INT") __attribute__((section("sfrs"), address(0xBF88001C)));
#define C1RXIF C1RXIF
extern volatile uint32_t   C1RXIF __attribute__((section("sfrs"), address(0xBF880020)));
typedef struct {
  uint32_t :1;
  uint32_t RFIF:31;
} __C1RXIFbits_t;
extern volatile __C1RXIFbits_t C1RXIFbits __asm__ ("C1RXIF") __attribute__((section("sfrs"), address(0xBF880020)));
#define C1TXIF C1TXIF
extern volatile uint32_t   C1TXIF __attribute__((section("sfrs"), address(0xBF880024)));
typedef struct {
  uint32_t TFIF:32;
} __C1TXIFbits_t;
extern volatile __C1TXIFbits_t C1TXIFbits __asm__ ("C1TXIF") __attribute__((section("sfrs"), address(0xBF880024)));
#define C1RXOVIF C1RXOVIF
extern volatile uint32_t   C1RXOVIF __attribute__((section("sfrs"), address(0xBF880028)));
typedef struct {
  uint32_t :1;
  uint32_t RFOVIF:31;
} __C1RXOVIFbits_t;
extern volatile __C1RXOVIFbits_t C1RXOVIFbits __asm__ ("C1RXOVIF") __attribute__((section("sfrs"), address(0xBF880028)));
#define C1TXATIF C1TXATIF
extern volatile uint32_t   C1TXATIF __attribute__((section("sfrs"), address(0xBF88002C)));
typedef struct {
  uint32_t TFATIF:32;
} __C1TXATIFbits_t;
extern volatile __C1TXATIFbits_t C1TXATIFbits __asm__ ("C1TXATIF") __attribute__((section("sfrs"), address(0xBF88002C)));
#define C1TXREQ C1TXREQ
extern volatile uint32_t   C1TXREQ __attribute__((section("sfrs"), address(0xBF880030)));
typedef struct {
  uint32_t TXREQ:32;
} __C1TXREQbits_t;
extern volatile __C1TXREQbits_t C1TXREQbits __asm__ ("C1TXREQ") __attribute__((section("sfrs"), address(0xBF880030)));
#define C1TREC C1TREC
extern volatile uint32_t   C1TREC __attribute__((section("sfrs"), address(0xBF880034)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1TRECbits_t;
extern volatile __C1TRECbits_t C1TRECbits __asm__ ("C1TREC") __attribute__((section("sfrs"), address(0xBF880034)));
#define C1BDIAG0 C1BDIAG0
extern volatile uint32_t   C1BDIAG0 __attribute__((section("sfrs"), address(0xBF880038)));
typedef struct {
  uint32_t NRERRCNT:8;
  uint32_t NTERRCNT:8;
  uint32_t DRERRCNT:8;
  uint32_t DTERRCNT:8;
} __C1BDIAG0bits_t;
extern volatile __C1BDIAG0bits_t C1BDIAG0bits __asm__ ("C1BDIAG0") __attribute__((section("sfrs"), address(0xBF880038)));
#define C1BDIAG1 C1BDIAG1
extern volatile uint32_t   C1BDIAG1 __attribute__((section("sfrs"), address(0xBF88003C)));
typedef struct {
  uint32_t EFMSGCNT:16;
  uint32_t NBIT0ERR:1;
  uint32_t NBIT1ERR:1;
  uint32_t NACKERR:1;
  uint32_t NFORMERR:1;
  uint32_t NSTUFERR:1;
  uint32_t NCRCERR:1;
  uint32_t :2;
  uint32_t DBIT0ERR:1;
  uint32_t DBIT1ERR:1;
  uint32_t :1;
  uint32_t DFORMERR:1;
  uint32_t DSTUFERR:1;
  uint32_t DCRCERR:1;
  uint32_t ESI:1;
  uint32_t DLCMM:1;
} __C1BDIAG1bits_t;
extern volatile __C1BDIAG1bits_t C1BDIAG1bits __asm__ ("C1BDIAG1") __attribute__((section("sfrs"), address(0xBF88003C)));
#define C1TEFCON C1TEFCON
extern volatile uint32_t   C1TEFCON __attribute__((section("sfrs"), address(0xBF880040)));
typedef struct {
  uint32_t TEFNEIE:1;
  uint32_t TEFHIE:1;
  uint32_t TEFFIE:1;
  uint32_t TEFOVIE:1;
  uint32_t :1;
  uint32_t TEFTSEN:1;
  uint32_t :2;
  uint32_t UINC:1;
  uint32_t :1;
  uint32_t FRESET:1;
  uint32_t :13;
  uint32_t FSIZE:5;
} __C1TEFCONbits_t;
extern volatile __C1TEFCONbits_t C1TEFCONbits __asm__ ("C1TEFCON") __attribute__((section("sfrs"), address(0xBF880040)));
#define C1TEFSTA C1TEFSTA
extern volatile uint32_t   C1TEFSTA __attribute__((section("sfrs"), address(0xBF880044)));
typedef struct {
  uint32_t TEFNEIF:1;
  uint32_t TEFHIF:1;
  uint32_t TEFFIF:1;
  uint32_t TEFOVIF:1;
} __C1TEFSTAbits_t;
extern volatile __C1TEFSTAbits_t C1TEFSTAbits __asm__ ("C1TEFSTA") __attribute__((section("sfrs"), address(0xBF880044)));
#define C1TEFUA C1TEFUA
extern volatile uint32_t   C1TEFUA __attribute__((section("sfrs"), address(0xBF880048)));
typedef struct {
  uint32_t TEFUA:32;
} __C1TEFUAbits_t;
extern volatile __C1TEFUAbits_t C1TEFUAbits __asm__ ("C1TEFUA") __attribute__((section("sfrs"), address(0xBF880048)));
#define C1FIFOBA C1FIFOBA
extern volatile uint32_t   C1FIFOBA __attribute__((section("sfrs"), address(0xBF88004C)));
typedef struct {
  uint32_t FIFOBA:32;
} __C1FIFOBAbits_t;
extern volatile __C1FIFOBAbits_t C1FIFOBAbits __asm__ ("C1FIFOBA") __attribute__((section("sfrs"), address(0xBF88004C)));
#define C1TXQCON C1TXQCON
extern volatile uint32_t   C1TXQCON __attribute__((section("sfrs"), address(0xBF880050)));
typedef struct {
  uint32_t TXQNIE:1;
  uint32_t :1;
  uint32_t TXQEIE:1;
  uint32_t :1;
  uint32_t TXATIE:1;
  uint32_t :2;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1TXQCONbits_t;
