CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1TXQCONbits_t C1TXQCONbits __asm__ ("C1TXQCON") __attribute__((section("sfrs"), address(0xBF880050)));
#define C1TXQSTA C1TXQSTA
extern volatile uint32_t   C1TXQSTA __attribute__((section("sfrs"), address(0xBF880054)));
typedef struct {
  uint32_t TXQNIF:1;
  uint32_t :1;
  uint32_t TXQEIF:1;
  uint32_t :1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t TXQCI:5;
} __C1TXQSTAbits_t;
extern volatile __C1TXQSTAbits_t C1TXQSTAbits __asm__ ("C1TXQSTA") __attribute__((section("sfrs"), address(0xBF880054)));
#define C1TXQUA C1TXQUA
extern volatile uint32_t   C1TXQUA __attribute__((section("sfrs"), address(0xBF880058)));
typedef struct {
  uint32_t TXQUA:32;
} __C1TXQUAbits_t;
extern volatile __C1TXQUAbits_t C1TXQUAbits __asm__ ("C1TXQUA") __attribute__((section("sfrs"), address(0xBF880058)));
#define C1FIFOCON1 C1FIFOCON1
extern volatile uint32_t   C1FIFOCON1 __attribute__((section("sfrs"), address(0xBF88005C)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON1bits_t;
extern volatile __C1FIFOCON1bits_t C1FIFOCON1bits __asm__ ("C1FIFOCON1") __attribute__((section("sfrs"), address(0xBF88005C)));
#define C1FIFOSTA1 C1FIFOSTA1
extern volatile uint32_t   C1FIFOSTA1 __attribute__((section("sfrs"), address(0xBF880060)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA1bits_t;
extern volatile __C1FIFOSTA1bits_t C1FIFOSTA1bits __asm__ ("C1FIFOSTA1") __attribute__((section("sfrs"), address(0xBF880060)));
#define C1FIFOUA1 C1FIFOUA1
extern volatile uint32_t   C1FIFOUA1 __attribute__((section("sfrs"), address(0xBF880064)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA1bits_t;
extern volatile __C1FIFOUA1bits_t C1FIFOUA1bits __asm__ ("C1FIFOUA1") __attribute__((section("sfrs"), address(0xBF880064)));
#define C1FIFOCON2 C1FIFOCON2
extern volatile uint32_t   C1FIFOCON2 __attribute__((section("sfrs"), address(0xBF880068)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON2bits_t;
extern volatile __C1FIFOCON2bits_t C1FIFOCON2bits __asm__ ("C1FIFOCON2") __attribute__((section("sfrs"), address(0xBF880068)));
#define C1FIFOSTA2 C1FIFOSTA2
extern volatile uint32_t   C1FIFOSTA2 __attribute__((section("sfrs"), address(0xBF88006C)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA2bits_t;
extern volatile __C1FIFOSTA2bits_t C1FIFOSTA2bits __asm__ ("C1FIFOSTA2") __attribute__((section("sfrs"), address(0xBF88006C)));
#define C1FIFOUA2 C1FIFOUA2
extern volatile uint32_t   C1FIFOUA2 __attribute__((section("sfrs"), address(0xBF880070)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA2bits_t;
extern volatile __C1FIFOUA2bits_t C1FIFOUA2bits __asm__ ("C1FIFOUA2") __attribute__((section("sfrs"), address(0xBF880070)));
#define C1FIFOCON3 C1FIFOCON3
extern volatile uint32_t   C1FIFOCON3 __attribute__((section("sfrs"), address(0xBF880074)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON3bits_t;
extern volatile __C1FIFOCON3bits_t C1FIFOCON3bits __asm__ ("C1FIFOCON3") __attribute__((section("sfrs"), address(0xBF880074)));
#define C1FIFOSTA3 C1FIFOSTA3
extern volatile uint32_t   C1FIFOSTA3 __attribute__((section("sfrs"), address(0xBF880078)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA3bits_t;
extern volatile __C1FIFOSTA3bits_t C1FIFOSTA3bits __asm__ ("C1FIFOSTA3") __attribute__((section("sfrs"), address(0xBF880078)));
#define C1FIFOUA3 C1FIFOUA3
extern volatile uint32_t   C1FIFOUA3 __attribute__((section("sfrs"), address(0xBF88007C)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA3bits_t;
extern volatile __C1FIFOUA3bits_t C1FIFOUA3bits __asm__ ("C1FIFOUA3") __attribute__((section("sfrs"), address(0xBF88007C)));
#define C1FIFOCON4 C1FIFOCON4
extern volatile uint32_t   C1FIFOCON4 __attribute__((section("sfrs"), address(0xBF880080)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON4bits_t;
extern volatile __C1FIFOCON4bits_t C1FIFOCON4bits __asm__ ("C1FIFOCON4") __attribute__((section("sfrs"), address(0xBF880080)));
#define C1FIFOSTA4 C1FIFOSTA4
extern volatile uint32_t   C1FIFOSTA4 __attribute__((section("sfrs"), address(0xBF880084)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA4bits_t;
extern volatile __C1FIFOSTA4bits_t C1FIFOSTA4bits __asm__ ("C1FIFOSTA4") __attribute__((section("sfrs"), address(0xBF880084)));
#define C1FIFOUA4 C1FIFOUA4
extern volatile uint32_t   C1FIFOUA4 __attribute__((section("sfrs"), address(0xBF880088)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA4bits_t;
extern volatile __C1FIFOUA4bits_t C1FIFOUA4bits __asm__ ("C1FIFOUA4") __attribute__((section("sfrs"), address(0xBF880088)));
#define C1FIFOCON5 C1FIFOCON5
extern volatile uint32_t   C1FIFOCON5 __attribute__((section("sfrs"), address(0xBF88008C)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON5bits_t;
extern volatile __C1FIFOCON5bits_t C1FIFOCON5bits __asm__ ("C1FIFOCON5") __attribute__((section("sfrs"), address(0xBF88008C)));
#define C1FIFOSTA5 C1FIFOSTA5
extern volatile uint32_t   C1FIFOSTA5 __attribute__((section("sfrs"), address(0xBF880090)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA5bits_t;
