CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1FIFOSTA5bits_t C1FIFOSTA5bits __asm__ ("C1FIFOSTA5") __attribute__((section("sfrs"), address(0xBF880090)));
#define C1FIFOUA5 C1FIFOUA5
extern volatile uint32_t   C1FIFOUA5 __attribute__((section("sfrs"), address(0xBF880094)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA5bits_t;
extern volatile __C1FIFOUA5bits_t C1FIFOUA5bits __asm__ ("C1FIFOUA5") __attribute__((section("sfrs"), address(0xBF880094)));
#define C1FIFOCON6 C1FIFOCON6
extern volatile uint32_t   C1FIFOCON6 __attribute__((section("sfrs"), address(0xBF880098)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON6bits_t;
extern volatile __C1FIFOCON6bits_t C1FIFOCON6bits __asm__ ("C1FIFOCON6") __attribute__((section("sfrs"), address(0xBF880098)));
#define C1FIFOSTA6 C1FIFOSTA6
extern volatile uint32_t   C1FIFOSTA6 __attribute__((section("sfrs"), address(0xBF88009C)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA6bits_t;
extern volatile __C1FIFOSTA6bits_t C1FIFOSTA6bits __asm__ ("C1FIFOSTA6") __attribute__((section("sfrs"), address(0xBF88009C)));
#define C1FIFOUA6 C1FIFOUA6
extern volatile uint32_t   C1FIFOUA6 __attribute__((section("sfrs"), address(0xBF8800A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA6bits_t;
extern volatile __C1FIFOUA6bits_t C1FIFOUA6bits __asm__ ("C1FIFOUA6") __attribute__((section("sfrs"), address(0xBF8800A0)));
#define C1FIFOCON7 C1FIFOCON7
extern volatile uint32_t   C1FIFOCON7 __attribute__((section("sfrs"), address(0xBF8800A4)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON7bits_t;
extern volatile __C1FIFOCON7bits_t C1FIFOCON7bits __asm__ ("C1FIFOCON7") __attribute__((section("sfrs"), address(0xBF8800A4)));
#define C1FIFOSTA7 C1FIFOSTA7
extern volatile uint32_t   C1FIFOSTA7 __attribute__((section("sfrs"), address(0xBF8800A8)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA7bits_t;
extern volatile __C1FIFOSTA7bits_t C1FIFOSTA7bits __asm__ ("C1FIFOSTA7") __attribute__((section("sfrs"), address(0xBF8800A8)));
#define C1FIFOUA7 C1FIFOUA7
extern volatile uint32_t   C1FIFOUA7 __attribute__((section("sfrs"), address(0xBF8800AC)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA7bits_t;
extern volatile __C1FIFOUA7bits_t C1FIFOUA7bits __asm__ ("C1FIFOUA7") __attribute__((section("sfrs"), address(0xBF8800AC)));
#define C1FIFOCON8 C1FIFOCON8
extern volatile uint32_t   C1FIFOCON8 __attribute__((section("sfrs"), address(0xBF8800B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON8bits_t;
extern volatile __C1FIFOCON8bits_t C1FIFOCON8bits __asm__ ("C1FIFOCON8") __attribute__((section("sfrs"), address(0xBF8800B0)));
#define C1FIFOSTA8 C1FIFOSTA8
extern volatile uint32_t   C1FIFOSTA8 __attribute__((section("sfrs"), address(0xBF8800B4)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA8bits_t;
extern volatile __C1FIFOSTA8bits_t C1FIFOSTA8bits __asm__ ("C1FIFOSTA8") __attribute__((section("sfrs"), address(0xBF8800B4)));
#define C1FIFOUA8 C1FIFOUA8
extern volatile uint32_t   C1FIFOUA8 __attribute__((section("sfrs"), address(0xBF8800B8)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA8bits_t;
extern volatile __C1FIFOUA8bits_t C1FIFOUA8bits __asm__ ("C1FIFOUA8") __attribute__((section("sfrs"), address(0xBF8800B8)));
#define C1FIFOCON9 C1FIFOCON9
extern volatile uint32_t   C1FIFOCON9 __attribute__((section("sfrs"), address(0xBF8800BC)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON9bits_t;
extern volatile __C1FIFOCON9bits_t C1FIFOCON9bits __asm__ ("C1FIFOCON9") __attribute__((section("sfrs"), address(0xBF8800BC)));
#define C1FIFOSTA9 C1FIFOSTA9
extern volatile uint32_t   C1FIFOSTA9 __attribute__((section("sfrs"), address(0xBF8800C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA9bits_t;
extern volatile __C1FIFOSTA9bits_t C1FIFOSTA9bits __asm__ ("C1FIFOSTA9") __attribute__((section("sfrs"), address(0xBF8800C0)));
#define C1FIFOUA9 C1FIFOUA9
extern volatile uint32_t   C1FIFOUA9 __attribute__((section("sfrs"), address(0xBF8800C4)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA9bits_t;
extern volatile __C1FIFOUA9bits_t C1FIFOUA9bits __asm__ ("C1FIFOUA9") __attribute__((section("sfrs"), address(0xBF8800C4)));
#define C1FIFOCON10 C1FIFOCON10
extern volatile uint32_t   C1FIFOCON10 __attribute__((section("sfrs"), address(0xBF8800C8)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON10bits_t;
extern volatile __C1FIFOCON10bits_t C1FIFOCON10bits __asm__ ("C1FIFOCON10") __attribute__((section("sfrs"), address(0xBF8800C8)));
#define C1FIFOSTA10 C1FIFOSTA10
extern volatile uint32_t   C1FIFOSTA10 __attribute__((section("sfrs"), address(0xBF8800CC)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA10bits_t;
extern volatile __C1FIFOSTA10bits_t C1FIFOSTA10bits __asm__ ("C1FIFOSTA10") __attribute__((section("sfrs"), address(0xBF8800CC)));
#define C1FIFOUA10 C1FIFOUA10
extern volatile uint32_t   C1FIFOUA10 __attribute__((section("sfrs"), address(0xBF8800D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA10bits_t;
extern volatile __C1FIFOUA10bits_t C1FIFOUA10bits __asm__ ("C1FIFOUA10") __attribute__((section("sfrs"), address(0xBF8800D0)));
#define C1FIFOCON11 C1FIFOCON11
extern volatile uint32_t   C1FIFOCON11 __attribute__((section("sfrs"), address(0xBF8800D4)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON11bits_t;
extern volatile __C1FIFOCON11bits_t C1FIFOCON11bits __asm__ ("C1FIFOCON11") __attribute__((section("sfrs"), address(0xBF8800D4)));
#define C1FIFOSTA11 C1FIFOSTA11
extern volatile uint32_t   C1FIFOSTA11 __attribute__((section("sfrs"), address(0xBF8800D8)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA11bits_t;
extern volatile __C1FIFOSTA11bits_t C1FIFOSTA11bits __asm__ ("C1FIFOSTA11") __attribute__((section("sfrs"), address(0xBF8800D8)));
#define C1FIFOUA11 C1FIFOUA11
extern volatile uint32_t   C1FIFOUA11 __attribute__((section("sfrs"), address(0xBF8800DC)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA11bits_t;
