CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1FIFOUA11bits_t C1FIFOUA11bits __asm__ ("C1FIFOUA11") __attribute__((section("sfrs"), address(0xBF8800DC)));
#define C1FIFOCON12 C1FIFOCON12
extern volatile uint32_t   C1FIFOCON12 __attribute__((section("sfrs"), address(0xBF8800E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON12bits_t;
extern volatile __C1FIFOCON12bits_t C1FIFOCON12bits __asm__ ("C1FIFOCON12") __attribute__((section("sfrs"), address(0xBF8800E0)));
#define C1FIFOSTA12 C1FIFOSTA12
extern volatile uint32_t   C1FIFOSTA12 __attribute__((section("sfrs"), address(0xBF8800E4)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA12bits_t;
extern volatile __C1FIFOSTA12bits_t C1FIFOSTA12bits __asm__ ("C1FIFOSTA12") __attribute__((section("sfrs"), address(0xBF8800E4)));
#define C1FIFOUA12 C1FIFOUA12
extern volatile uint32_t   C1FIFOUA12 __attribute__((section("sfrs"), address(0xBF8800E8)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA12bits_t;
extern volatile __C1FIFOUA12bits_t C1FIFOUA12bits __asm__ ("C1FIFOUA12") __attribute__((section("sfrs"), address(0xBF8800E8)));
#define C1FIFOCON13 C1FIFOCON13
extern volatile uint32_t   C1FIFOCON13 __attribute__((section("sfrs"), address(0xBF8800EC)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON13bits_t;
extern volatile __C1FIFOCON13bits_t C1FIFOCON13bits __asm__ ("C1FIFOCON13") __attribute__((section("sfrs"), address(0xBF8800EC)));
#define C1FIFOSTA13 C1FIFOSTA13
extern volatile uint32_t   C1FIFOSTA13 __attribute__((section("sfrs"), address(0xBF8800F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA13bits_t;
extern volatile __C1FIFOSTA13bits_t C1FIFOSTA13bits __asm__ ("C1FIFOSTA13") __attribute__((section("sfrs"), address(0xBF8800F0)));
#define C1FIFOUA13 C1FIFOUA13
extern volatile uint32_t   C1FIFOUA13 __attribute__((section("sfrs"), address(0xBF8800F4)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA13bits_t;
extern volatile __C1FIFOUA13bits_t C1FIFOUA13bits __asm__ ("C1FIFOUA13") __attribute__((section("sfrs"), address(0xBF8800F4)));
#define C1FIFOCON14 C1FIFOCON14
extern volatile uint32_t   C1FIFOCON14 __attribute__((section("sfrs"), address(0xBF8800F8)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON14bits_t;
extern volatile __C1FIFOCON14bits_t C1FIFOCON14bits __asm__ ("C1FIFOCON14") __attribute__((section("sfrs"), address(0xBF8800F8)));
#define C1FIFOSTA14 C1FIFOSTA14
extern volatile uint32_t   C1FIFOSTA14 __attribute__((section("sfrs"), address(0xBF8800FC)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA14bits_t;
extern volatile __C1FIFOSTA14bits_t C1FIFOSTA14bits __asm__ ("C1FIFOSTA14") __attribute__((section("sfrs"), address(0xBF8800FC)));
#define C1FIFOUA14 C1FIFOUA14
extern volatile uint32_t   C1FIFOUA14 __attribute__((section("sfrs"), address(0xBF880100)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA14bits_t;
extern volatile __C1FIFOUA14bits_t C1FIFOUA14bits __asm__ ("C1FIFOUA14") __attribute__((section("sfrs"), address(0xBF880100)));
#define C1FIFOCON15 C1FIFOCON15
extern volatile uint32_t   C1FIFOCON15 __attribute__((section("sfrs"), address(0xBF880104)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON15bits_t;
extern volatile __C1FIFOCON15bits_t C1FIFOCON15bits __asm__ ("C1FIFOCON15") __attribute__((section("sfrs"), address(0xBF880104)));
#define C1FIFOSTA15 C1FIFOSTA15
extern volatile uint32_t   C1FIFOSTA15 __attribute__((section("sfrs"), address(0xBF880108)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA15bits_t;
extern volatile __C1FIFOSTA15bits_t C1FIFOSTA15bits __asm__ ("C1FIFOSTA15") __attribute__((section("sfrs"), address(0xBF880108)));
#define C1FIFOUA15 C1FIFOUA15
extern volatile uint32_t   C1FIFOUA15 __attribute__((section("sfrs"), address(0xBF88010C)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA15bits_t;
extern volatile __C1FIFOUA15bits_t C1FIFOUA15bits __asm__ ("C1FIFOUA15") __attribute__((section("sfrs"), address(0xBF88010C)));
#define C1FIFOCON16 C1FIFOCON16
extern volatile uint32_t   C1FIFOCON16 __attribute__((section("sfrs"), address(0xBF880110)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON16bits_t;
