CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1FIFOCON16bits_t C1FIFOCON16bits __asm__ ("C1FIFOCON16") __attribute__((section("sfrs"), address(0xBF880110)));
#define C1FIFOSTA16 C1FIFOSTA16
extern volatile uint32_t   C1FIFOSTA16 __attribute__((section("sfrs"), address(0xBF880114)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA16bits_t;
extern volatile __C1FIFOSTA16bits_t C1FIFOSTA16bits __asm__ ("C1FIFOSTA16") __attribute__((section("sfrs"), address(0xBF880114)));
#define C1FIFOUA16 C1FIFOUA16
extern volatile uint32_t   C1FIFOUA16 __attribute__((section("sfrs"), address(0xBF880118)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA16bits_t;
extern volatile __C1FIFOUA16bits_t C1FIFOUA16bits __asm__ ("C1FIFOUA16") __attribute__((section("sfrs"), address(0xBF880118)));
#define C1FIFOCON17 C1FIFOCON17
extern volatile uint32_t   C1FIFOCON17 __attribute__((section("sfrs"), address(0xBF88011C)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON17bits_t;
extern volatile __C1FIFOCON17bits_t C1FIFOCON17bits __asm__ ("C1FIFOCON17") __attribute__((section("sfrs"), address(0xBF88011C)));
#define C1FIFOSTA17 C1FIFOSTA17
extern volatile uint32_t   C1FIFOSTA17 __attribute__((section("sfrs"), address(0xBF880120)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA17bits_t;
extern volatile __C1FIFOSTA17bits_t C1FIFOSTA17bits __asm__ ("C1FIFOSTA17") __attribute__((section("sfrs"), address(0xBF880120)));
#define C1FIFOUA17 C1FIFOUA17
extern volatile uint32_t   C1FIFOUA17 __attribute__((section("sfrs"), address(0xBF880124)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA17bits_t;
extern volatile __C1FIFOUA17bits_t C1FIFOUA17bits __asm__ ("C1FIFOUA17") __attribute__((section("sfrs"), address(0xBF880124)));
#define C1FIFOCON18 C1FIFOCON18
extern volatile uint32_t   C1FIFOCON18 __attribute__((section("sfrs"), address(0xBF880128)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON18bits_t;
extern volatile __C1FIFOCON18bits_t C1FIFOCON18bits __asm__ ("C1FIFOCON18") __attribute__((section("sfrs"), address(0xBF880128)));
#define C1FIFOSTA18 C1FIFOSTA18
extern volatile uint32_t   C1FIFOSTA18 __attribute__((section("sfrs"), address(0xBF88012C)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA18bits_t;
extern volatile __C1FIFOSTA18bits_t C1FIFOSTA18bits __asm__ ("C1FIFOSTA18") __attribute__((section("sfrs"), address(0xBF88012C)));
#define C1FIFOUA18 C1FIFOUA18
extern volatile uint32_t   C1FIFOUA18 __attribute__((section("sfrs"), address(0xBF880130)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA18bits_t;
extern volatile __C1FIFOUA18bits_t C1FIFOUA18bits __asm__ ("C1FIFOUA18") __attribute__((section("sfrs"), address(0xBF880130)));
#define C1FIFOCON19 C1FIFOCON19
extern volatile uint32_t   C1FIFOCON19 __attribute__((section("sfrs"), address(0xBF880134)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON19bits_t;
extern volatile __C1FIFOCON19bits_t C1FIFOCON19bits __asm__ ("C1FIFOCON19") __attribute__((section("sfrs"), address(0xBF880134)));
#define C1FIFOSTA19 C1FIFOSTA19
extern volatile uint32_t   C1FIFOSTA19 __attribute__((section("sfrs"), address(0xBF880138)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA19bits_t;
extern volatile __C1FIFOSTA19bits_t C1FIFOSTA19bits __asm__ ("C1FIFOSTA19") __attribute__((section("sfrs"), address(0xBF880138)));
#define C1FIFOUA19 C1FIFOUA19
extern volatile uint32_t   C1FIFOUA19 __attribute__((section("sfrs"), address(0xBF88013C)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA19bits_t;
extern volatile __C1FIFOUA19bits_t C1FIFOUA19bits __asm__ ("C1FIFOUA19") __attribute__((section("sfrs"), address(0xBF88013C)));
#define C1FIFOCON20 C1FIFOCON20
extern volatile uint32_t   C1FIFOCON20 __attribute__((section("sfrs"), address(0xBF880140)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON20bits_t;
extern volatile __C1FIFOCON20bits_t C1FIFOCON20bits __asm__ ("C1FIFOCON20") __attribute__((section("sfrs"), address(0xBF880140)));
#define C1FIFOSTA20 C1FIFOSTA20
extern volatile uint32_t   C1FIFOSTA20 __attribute__((section("sfrs"), address(0xBF880144)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA20bits_t;
extern volatile __C1FIFOSTA20bits_t C1FIFOSTA20bits __asm__ ("C1FIFOSTA20") __attribute__((section("sfrs"), address(0xBF880144)));
#define C1FIFOUA20 C1FIFOUA20
extern volatile uint32_t   C1FIFOUA20 __attribute__((section("sfrs"), address(0xBF880148)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA20bits_t;
extern volatile __C1FIFOUA20bits_t C1FIFOUA20bits __asm__ ("C1FIFOUA20") __attribute__((section("sfrs"), address(0xBF880148)));
#define C1FIFOCON21 C1FIFOCON21
extern volatile uint32_t   C1FIFOCON21 __attribute__((section("sfrs"), address(0xBF88014C)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON21bits_t;
