CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1FIFOCON21bits_t C1FIFOCON21bits __asm__ ("C1FIFOCON21") __attribute__((section("sfrs"), address(0xBF88014C)));
#define C1FIFOSTA21 C1FIFOSTA21
extern volatile uint32_t   C1FIFOSTA21 __attribute__((section("sfrs"), address(0xBF880150)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA21bits_t;
extern volatile __C1FIFOSTA21bits_t C1FIFOSTA21bits __asm__ ("C1FIFOSTA21") __attribute__((section("sfrs"), address(0xBF880150)));
#define C1FIFOUA21 C1FIFOUA21
extern volatile uint32_t   C1FIFOUA21 __attribute__((section("sfrs"), address(0xBF880154)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA21bits_t;
extern volatile __C1FIFOUA21bits_t C1FIFOUA21bits __asm__ ("C1FIFOUA21") __attribute__((section("sfrs"), address(0xBF880154)));
#define C1FIFOCON22 C1FIFOCON22
extern volatile uint32_t   C1FIFOCON22 __attribute__((section("sfrs"), address(0xBF880158)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON22bits_t;
extern volatile __C1FIFOCON22bits_t C1FIFOCON22bits __asm__ ("C1FIFOCON22") __attribute__((section("sfrs"), address(0xBF880158)));
#define C1FIFOSTA22 C1FIFOSTA22
extern volatile uint32_t   C1FIFOSTA22 __attribute__((section("sfrs"), address(0xBF88015C)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA22bits_t;
extern volatile __C1FIFOSTA22bits_t C1FIFOSTA22bits __asm__ ("C1FIFOSTA22") __attribute__((section("sfrs"), address(0xBF88015C)));
#define C1FIFOUA22 C1FIFOUA22
extern volatile uint32_t   C1FIFOUA22 __attribute__((section("sfrs"), address(0xBF880160)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA22bits_t;
extern volatile __C1FIFOUA22bits_t C1FIFOUA22bits __asm__ ("C1FIFOUA22") __attribute__((section("sfrs"), address(0xBF880160)));
#define C1FIFOCON23 C1FIFOCON23
extern volatile uint32_t   C1FIFOCON23 __attribute__((section("sfrs"), address(0xBF880164)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON23bits_t;
extern volatile __C1FIFOCON23bits_t C1FIFOCON23bits __asm__ ("C1FIFOCON23") __attribute__((section("sfrs"), address(0xBF880164)));
#define C1FIFOSTA23 C1FIFOSTA23
extern volatile uint32_t   C1FIFOSTA23 __attribute__((section("sfrs"), address(0xBF880168)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA23bits_t;
extern volatile __C1FIFOSTA23bits_t C1FIFOSTA23bits __asm__ ("C1FIFOSTA23") __attribute__((section("sfrs"), address(0xBF880168)));
#define C1FIFOUA23 C1FIFOUA23
extern volatile uint32_t   C1FIFOUA23 __attribute__((section("sfrs"), address(0xBF88016C)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA23bits_t;
extern volatile __C1FIFOUA23bits_t C1FIFOUA23bits __asm__ ("C1FIFOUA23") __attribute__((section("sfrs"), address(0xBF88016C)));
#define C1FIFOCON24 C1FIFOCON24
extern volatile uint32_t   C1FIFOCON24 __attribute__((section("sfrs"), address(0xBF880170)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON24bits_t;
extern volatile __C1FIFOCON24bits_t C1FIFOCON24bits __asm__ ("C1FIFOCON24") __attribute__((section("sfrs"), address(0xBF880170)));
#define C1FIFOSTA24 C1FIFOSTA24
extern volatile uint32_t   C1FIFOSTA24 __attribute__((section("sfrs"), address(0xBF880174)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA24bits_t;
extern volatile __C1FIFOSTA24bits_t C1FIFOSTA24bits __asm__ ("C1FIFOSTA24") __attribute__((section("sfrs"), address(0xBF880174)));
#define C1FIFOUA24 C1FIFOUA24
extern volatile uint32_t   C1FIFOUA24 __attribute__((section("sfrs"), address(0xBF880178)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA24bits_t;
extern volatile __C1FIFOUA24bits_t C1FIFOUA24bits __asm__ ("C1FIFOUA24") __attribute__((section("sfrs"), address(0xBF880178)));
#define C1FIFOCON25 C1FIFOCON25
extern volatile uint32_t   C1FIFOCON25 __attribute__((section("sfrs"), address(0xBF88017C)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON25bits_t;
extern volatile __C1FIFOCON25bits_t C1FIFOCON25bits __asm__ ("C1FIFOCON25") __attribute__((section("sfrs"), address(0xBF88017C)));
#define C1FIFOSTA25 C1FIFOSTA25
extern volatile uint32_t   C1FIFOSTA25 __attribute__((section("sfrs"), address(0xBF880180)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA25bits_t;
extern volatile __C1FIFOSTA25bits_t C1FIFOSTA25bits __asm__ ("C1FIFOSTA25") __attribute__((section("sfrs"), address(0xBF880180)));
#define C1FIFOUA25 C1FIFOUA25
extern volatile uint32_t   C1FIFOUA25 __attribute__((section("sfrs"), address(0xBF880184)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA25bits_t;
extern volatile __C1FIFOUA25bits_t C1FIFOUA25bits __asm__ ("C1FIFOUA25") __attribute__((section("sfrs"), address(0xBF880184)));
#define C1FIFOCON26 C1FIFOCON26
extern volatile uint32_t   C1FIFOCON26 __attribute__((section("sfrs"), address(0xBF880188)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON26bits_t;
