CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1FIFOCON26bits_t C1FIFOCON26bits __asm__ ("C1FIFOCON26") __attribute__((section("sfrs"), address(0xBF880188)));
#define C1FIFOSTA26 C1FIFOSTA26
extern volatile uint32_t   C1FIFOSTA26 __attribute__((section("sfrs"), address(0xBF88018C)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA26bits_t;
extern volatile __C1FIFOSTA26bits_t C1FIFOSTA26bits __asm__ ("C1FIFOSTA26") __attribute__((section("sfrs"), address(0xBF88018C)));
#define C1FIFOUA26 C1FIFOUA26
extern volatile uint32_t   C1FIFOUA26 __attribute__((section("sfrs"), address(0xBF880190)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA26bits_t;
extern volatile __C1FIFOUA26bits_t C1FIFOUA26bits __asm__ ("C1FIFOUA26") __attribute__((section("sfrs"), address(0xBF880190)));
#define C1FIFOCON27 C1FIFOCON27
extern volatile uint32_t   C1FIFOCON27 __attribute__((section("sfrs"), address(0xBF880194)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON27bits_t;
extern volatile __C1FIFOCON27bits_t C1FIFOCON27bits __asm__ ("C1FIFOCON27") __attribute__((section("sfrs"), address(0xBF880194)));
#define C1FIFOSTA27 C1FIFOSTA27
extern volatile uint32_t   C1FIFOSTA27 __attribute__((section("sfrs"), address(0xBF880198)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA27bits_t;
extern volatile __C1FIFOSTA27bits_t C1FIFOSTA27bits __asm__ ("C1FIFOSTA27") __attribute__((section("sfrs"), address(0xBF880198)));
#define C1FIFOUA27 C1FIFOUA27
extern volatile uint32_t   C1FIFOUA27 __attribute__((section("sfrs"), address(0xBF88019C)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA27bits_t;
extern volatile __C1FIFOUA27bits_t C1FIFOUA27bits __asm__ ("C1FIFOUA27") __attribute__((section("sfrs"), address(0xBF88019C)));
#define C1FIFOCON28 C1FIFOCON28
extern volatile uint32_t   C1FIFOCON28 __attribute__((section("sfrs"), address(0xBF8801A0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON28bits_t;
extern volatile __C1FIFOCON28bits_t C1FIFOCON28bits __asm__ ("C1FIFOCON28") __attribute__((section("sfrs"), address(0xBF8801A0)));
#define C1FIFOSTA28 C1FIFOSTA28
extern volatile uint32_t   C1FIFOSTA28 __attribute__((section("sfrs"), address(0xBF8801A4)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA28bits_t;
extern volatile __C1FIFOSTA28bits_t C1FIFOSTA28bits __asm__ ("C1FIFOSTA28") __attribute__((section("sfrs"), address(0xBF8801A4)));
#define C1FIFOUA28 C1FIFOUA28
extern volatile uint32_t   C1FIFOUA28 __attribute__((section("sfrs"), address(0xBF8801A8)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA28bits_t;
extern volatile __C1FIFOUA28bits_t C1FIFOUA28bits __asm__ ("C1FIFOUA28") __attribute__((section("sfrs"), address(0xBF8801A8)));
#define C1FIFOCON29 C1FIFOCON29
extern volatile uint32_t   C1FIFOCON29 __attribute__((section("sfrs"), address(0xBF8801AC)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON29bits_t;
extern volatile __C1FIFOCON29bits_t C1FIFOCON29bits __asm__ ("C1FIFOCON29") __attribute__((section("sfrs"), address(0xBF8801AC)));
#define C1FIFOSTA29 C1FIFOSTA29
extern volatile uint32_t   C1FIFOSTA29 __attribute__((section("sfrs"), address(0xBF8801B0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA29bits_t;
extern volatile __C1FIFOSTA29bits_t C1FIFOSTA29bits __asm__ ("C1FIFOSTA29") __attribute__((section("sfrs"), address(0xBF8801B0)));
#define C1FIFOUA29 C1FIFOUA29
extern volatile uint32_t   C1FIFOUA29 __attribute__((section("sfrs"), address(0xBF8801B4)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA29bits_t;
extern volatile __C1FIFOUA29bits_t C1FIFOUA29bits __asm__ ("C1FIFOUA29") __attribute__((section("sfrs"), address(0xBF8801B4)));
#define C1FIFOCON30 C1FIFOCON30
extern volatile uint32_t   C1FIFOCON30 __attribute__((section("sfrs"), address(0xBF8801B8)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON30bits_t;
extern volatile __C1FIFOCON30bits_t C1FIFOCON30bits __asm__ ("C1FIFOCON30") __attribute__((section("sfrs"), address(0xBF8801B8)));
#define C1FIFOSTA30 C1FIFOSTA30
extern volatile uint32_t   C1FIFOSTA30 __attribute__((section("sfrs"), address(0xBF8801BC)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA30bits_t;
extern volatile __C1FIFOSTA30bits_t C1FIFOSTA30bits __asm__ ("C1FIFOSTA30") __attribute__((section("sfrs"), address(0xBF8801BC)));
#define C1FIFOUA30 C1FIFOUA30
extern volatile uint32_t   C1FIFOUA30 __attribute__((section("sfrs"), address(0xBF8801C0)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA30bits_t;
