CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1FIFOUA30bits_t C1FIFOUA30bits __asm__ ("C1FIFOUA30") __attribute__((section("sfrs"), address(0xBF8801C0)));
#define C1FIFOCON31 C1FIFOCON31
extern volatile uint32_t   C1FIFOCON31 __attribute__((section("sfrs"), address(0xBF8801C4)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __C1FIFOCON31bits_t;
extern volatile __C1FIFOCON31bits_t C1FIFOCON31bits __asm__ ("C1FIFOCON31") __attribute__((section("sfrs"), address(0xBF8801C4)));
#define C1FIFOSTA31 C1FIFOSTA31
extern volatile uint32_t   C1FIFOSTA31 __attribute__((section("sfrs"), address(0xBF8801C8)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __C1FIFOSTA31bits_t;
extern volatile __C1FIFOSTA31bits_t C1FIFOSTA31bits __asm__ ("C1FIFOSTA31") __attribute__((section("sfrs"), address(0xBF8801C8)));
#define C1FIFOUA31 C1FIFOUA31
extern volatile uint32_t   C1FIFOUA31 __attribute__((section("sfrs"), address(0xBF8801CC)));
typedef struct {
  uint32_t FIFOUA:32;
} __C1FIFOUA31bits_t;
extern volatile __C1FIFOUA31bits_t C1FIFOUA31bits __asm__ ("C1FIFOUA31") __attribute__((section("sfrs"), address(0xBF8801CC)));
#define C1FLTCON0 C1FLTCON0
extern volatile uint32_t   C1FLTCON0 __attribute__((section("sfrs"), address(0xBF8801D0)));
typedef struct {
  uint32_t F0BP:5;
  uint32_t :2;
  uint32_t FLTEN0:1;
  uint32_t F1BP:5;
  uint32_t :2;
  uint32_t FLTEN1:1;
  uint32_t F2BP:5;
  uint32_t :2;
  uint32_t FLTEN2:1;
  uint32_t F3BP:5;
  uint32_t :2;
  uint32_t FLTEN3:1;
} __C1FLTCON0bits_t;
extern volatile __C1FLTCON0bits_t C1FLTCON0bits __asm__ ("C1FLTCON0") __attribute__((section("sfrs"), address(0xBF8801D0)));
#define C1FLTCON1 C1FLTCON1
extern volatile uint32_t   C1FLTCON1 __attribute__((section("sfrs"), address(0xBF8801D4)));
typedef struct {
  uint32_t F4BP:5;
  uint32_t :2;
  uint32_t FLTEN4:1;
  uint32_t F5BP:5;
  uint32_t :2;
  uint32_t FLTEN5:1;
  uint32_t F6BP:5;
  uint32_t :2;
  uint32_t FLTEN6:1;
  uint32_t F7BP:5;
  uint32_t :2;
  uint32_t FLTEN7:1;
} __C1FLTCON1bits_t;
extern volatile __C1FLTCON1bits_t C1FLTCON1bits __asm__ ("C1FLTCON1") __attribute__((section("sfrs"), address(0xBF8801D4)));
#define C1FLTCON2 C1FLTCON2
extern volatile uint32_t   C1FLTCON2 __attribute__((section("sfrs"), address(0xBF8801D8)));
typedef struct {
  uint32_t F8BP:5;
  uint32_t :2;
  uint32_t FLTEN8:1;
  uint32_t F9BP:5;
  uint32_t :2;
  uint32_t FLTEN9:1;
  uint32_t F10BP:5;
  uint32_t :2;
  uint32_t FLTEN10:1;
  uint32_t F11BP:5;
  uint32_t :2;
  uint32_t FLTEN11:1;
} __C1FLTCON2bits_t;
extern volatile __C1FLTCON2bits_t C1FLTCON2bits __asm__ ("C1FLTCON2") __attribute__((section("sfrs"), address(0xBF8801D8)));
#define C1FLTCON3 C1FLTCON3
extern volatile uint32_t   C1FLTCON3 __attribute__((section("sfrs"), address(0xBF8801DC)));
typedef struct {
  uint32_t F12BP:5;
  uint32_t :2;
  uint32_t FLTEN12:1;
  uint32_t F13BP:5;
  uint32_t :2;
  uint32_t FLTEN13:1;
  uint32_t F14BP:5;
  uint32_t :2;
  uint32_t FLTEN14:1;
  uint32_t F15BP:5;
  uint32_t :2;
  uint32_t FLTEN15:1;
} __C1FLTCON3bits_t;
extern volatile __C1FLTCON3bits_t C1FLTCON3bits __asm__ ("C1FLTCON3") __attribute__((section("sfrs"), address(0xBF8801DC)));
#define C1FLTCON4 C1FLTCON4
extern volatile uint32_t   C1FLTCON4 __attribute__((section("sfrs"), address(0xBF8801E0)));
typedef struct {
  uint32_t F16BP:5;
  uint32_t :2;
  uint32_t FLTEN16:1;
  uint32_t F17BP:5;
  uint32_t :2;
  uint32_t FLTEN17:1;
  uint32_t F18BP:5;
  uint32_t :2;
  uint32_t FLTEN18:1;
  uint32_t F19BP:5;
  uint32_t :2;
  uint32_t FLTEN19:1;
} __C1FLTCON4bits_t;
extern volatile __C1FLTCON4bits_t C1FLTCON4bits __asm__ ("C1FLTCON4") __attribute__((section("sfrs"), address(0xBF8801E0)));
#define C1FLTCON5 C1FLTCON5
extern volatile uint32_t   C1FLTCON5 __attribute__((section("sfrs"), address(0xBF8801E4)));
typedef struct {
  uint32_t F20BP:5;
  uint32_t :2;
  uint32_t FLTEN20:1;
  uint32_t F21BP:5;
  uint32_t :2;
  uint32_t FLTEN21:1;
  uint32_t F22BP:5;
  uint32_t :2;
  uint32_t FLTEN22:1;
  uint32_t F23BP:5;
  uint32_t :2;
  uint32_t FLTEN23:1;
} __C1FLTCON5bits_t;
extern volatile __C1FLTCON5bits_t C1FLTCON5bits __asm__ ("C1FLTCON5") __attribute__((section("sfrs"), address(0xBF8801E4)));
#define C1FLTCON6 C1FLTCON6
extern volatile uint32_t   C1FLTCON6 __attribute__((section("sfrs"), address(0xBF8801E8)));
typedef struct {
  uint32_t F24BP:5;
  uint32_t :2;
  uint32_t FLTEN24:1;
  uint32_t F25BP:5;
  uint32_t :2;
  uint32_t FLTEN25:1;
  uint32_t F26BP:5;
  uint32_t :2;
  uint32_t FLTEN26:1;
  uint32_t F27BP:5;
  uint32_t :2;
  uint32_t FLTEN27:1;
} __C1FLTCON6bits_t;
extern volatile __C1FLTCON6bits_t C1FLTCON6bits __asm__ ("C1FLTCON6") __attribute__((section("sfrs"), address(0xBF8801E8)));
#define C1FLTCON7 C1FLTCON7
extern volatile uint32_t   C1FLTCON7 __attribute__((section("sfrs"), address(0xBF8801EC)));
typedef struct {
  uint32_t F28BP:5;
  uint32_t :2;
  uint32_t FLTEN28:1;
  uint32_t F29BP:5;
  uint32_t :2;
  uint32_t FLTEN29:1;
  uint32_t F30BP:5;
  uint32_t :2;
  uint32_t FLTEN30:1;
  uint32_t F31BP:5;
  uint32_t :2;
  uint32_t FLTEN31:1;
} __C1FLTCON7bits_t;
extern volatile __C1FLTCON7bits_t C1FLTCON7bits __asm__ ("C1FLTCON7") __attribute__((section("sfrs"), address(0xBF8801EC)));
#define C1FLTOBJ0 C1FLTOBJ0
extern volatile uint32_t   C1FLTOBJ0 __attribute__((section("sfrs"), address(0xBF8801F0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ0bits_t;
extern volatile __C1FLTOBJ0bits_t C1FLTOBJ0bits __asm__ ("C1FLTOBJ0") __attribute__((section("sfrs"), address(0xBF8801F0)));
#define C1MASK0 C1MASK0
extern volatile uint32_t   C1MASK0 __attribute__((section("sfrs"), address(0xBF8801F4)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK0bits_t;
