CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1MASK0bits_t C1MASK0bits __asm__ ("C1MASK0") __attribute__((section("sfrs"), address(0xBF8801F4)));
#define C1FLTOBJ1 C1FLTOBJ1
extern volatile uint32_t   C1FLTOBJ1 __attribute__((section("sfrs"), address(0xBF8801F8)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ1bits_t;
extern volatile __C1FLTOBJ1bits_t C1FLTOBJ1bits __asm__ ("C1FLTOBJ1") __attribute__((section("sfrs"), address(0xBF8801F8)));
#define C1MASK1 C1MASK1
extern volatile uint32_t   C1MASK1 __attribute__((section("sfrs"), address(0xBF8801FC)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK1bits_t;
extern volatile __C1MASK1bits_t C1MASK1bits __asm__ ("C1MASK1") __attribute__((section("sfrs"), address(0xBF8801FC)));
#define C1FLTOBJ2 C1FLTOBJ2
extern volatile uint32_t   C1FLTOBJ2 __attribute__((section("sfrs"), address(0xBF880200)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ2bits_t;
extern volatile __C1FLTOBJ2bits_t C1FLTOBJ2bits __asm__ ("C1FLTOBJ2") __attribute__((section("sfrs"), address(0xBF880200)));
#define C1MASK2 C1MASK2
extern volatile uint32_t   C1MASK2 __attribute__((section("sfrs"), address(0xBF880204)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK2bits_t;
extern volatile __C1MASK2bits_t C1MASK2bits __asm__ ("C1MASK2") __attribute__((section("sfrs"), address(0xBF880204)));
#define C1FLTOBJ3 C1FLTOBJ3
extern volatile uint32_t   C1FLTOBJ3 __attribute__((section("sfrs"), address(0xBF880208)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ3bits_t;
extern volatile __C1FLTOBJ3bits_t C1FLTOBJ3bits __asm__ ("C1FLTOBJ3") __attribute__((section("sfrs"), address(0xBF880208)));
#define C1MASK3 C1MASK3
extern volatile uint32_t   C1MASK3 __attribute__((section("sfrs"), address(0xBF88020C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK3bits_t;
extern volatile __C1MASK3bits_t C1MASK3bits __asm__ ("C1MASK3") __attribute__((section("sfrs"), address(0xBF88020C)));
#define C1FLTOBJ4 C1FLTOBJ4
extern volatile uint32_t   C1FLTOBJ4 __attribute__((section("sfrs"), address(0xBF880210)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ4bits_t;
extern volatile __C1FLTOBJ4bits_t C1FLTOBJ4bits __asm__ ("C1FLTOBJ4") __attribute__((section("sfrs"), address(0xBF880210)));
#define C1MASK4 C1MASK4
extern volatile uint32_t   C1MASK4 __attribute__((section("sfrs"), address(0xBF880214)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK4bits_t;
extern volatile __C1MASK4bits_t C1MASK4bits __asm__ ("C1MASK4") __attribute__((section("sfrs"), address(0xBF880214)));
#define C1FLTOBJ5 C1FLTOBJ5
extern volatile uint32_t   C1FLTOBJ5 __attribute__((section("sfrs"), address(0xBF880218)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ5bits_t;
extern volatile __C1FLTOBJ5bits_t C1FLTOBJ5bits __asm__ ("C1FLTOBJ5") __attribute__((section("sfrs"), address(0xBF880218)));
#define C1MASK5 C1MASK5
extern volatile uint32_t   C1MASK5 __attribute__((section("sfrs"), address(0xBF88021C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK5bits_t;
extern volatile __C1MASK5bits_t C1MASK5bits __asm__ ("C1MASK5") __attribute__((section("sfrs"), address(0xBF88021C)));
#define C1FLTOBJ6 C1FLTOBJ6
extern volatile uint32_t   C1FLTOBJ6 __attribute__((section("sfrs"), address(0xBF880220)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ6bits_t;
extern volatile __C1FLTOBJ6bits_t C1FLTOBJ6bits __asm__ ("C1FLTOBJ6") __attribute__((section("sfrs"), address(0xBF880220)));
#define C1MASK6 C1MASK6
extern volatile uint32_t   C1MASK6 __attribute__((section("sfrs"), address(0xBF880224)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK6bits_t;
extern volatile __C1MASK6bits_t C1MASK6bits __asm__ ("C1MASK6") __attribute__((section("sfrs"), address(0xBF880224)));
#define C1FLTOBJ7 C1FLTOBJ7
extern volatile uint32_t   C1FLTOBJ7 __attribute__((section("sfrs"), address(0xBF880228)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ7bits_t;
extern volatile __C1FLTOBJ7bits_t C1FLTOBJ7bits __asm__ ("C1FLTOBJ7") __attribute__((section("sfrs"), address(0xBF880228)));
#define C1MASK7 C1MASK7
extern volatile uint32_t   C1MASK7 __attribute__((section("sfrs"), address(0xBF88022C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK7bits_t;
extern volatile __C1MASK7bits_t C1MASK7bits __asm__ ("C1MASK7") __attribute__((section("sfrs"), address(0xBF88022C)));
#define C1FLTOBJ8 C1FLTOBJ8
extern volatile uint32_t   C1FLTOBJ8 __attribute__((section("sfrs"), address(0xBF880230)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ8bits_t;
extern volatile __C1FLTOBJ8bits_t C1FLTOBJ8bits __asm__ ("C1FLTOBJ8") __attribute__((section("sfrs"), address(0xBF880230)));
#define C1MASK8 C1MASK8
extern volatile uint32_t   C1MASK8 __attribute__((section("sfrs"), address(0xBF880234)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK8bits_t;
extern volatile __C1MASK8bits_t C1MASK8bits __asm__ ("C1MASK8") __attribute__((section("sfrs"), address(0xBF880234)));
#define C1FLTOBJ9 C1FLTOBJ9
extern volatile uint32_t   C1FLTOBJ9 __attribute__((section("sfrs"), address(0xBF880238)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ9bits_t;
extern volatile __C1FLTOBJ9bits_t C1FLTOBJ9bits __asm__ ("C1FLTOBJ9") __attribute__((section("sfrs"), address(0xBF880238)));
#define C1MASK9 C1MASK9
extern volatile uint32_t   C1MASK9 __attribute__((section("sfrs"), address(0xBF88023C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK9bits_t;
extern volatile __C1MASK9bits_t C1MASK9bits __asm__ ("C1MASK9") __attribute__((section("sfrs"), address(0xBF88023C)));
#define C1FLTOBJ10 C1FLTOBJ10
extern volatile uint32_t   C1FLTOBJ10 __attribute__((section("sfrs"), address(0xBF880240)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ10bits_t;
extern volatile __C1FLTOBJ10bits_t C1FLTOBJ10bits __asm__ ("C1FLTOBJ10") __attribute__((section("sfrs"), address(0xBF880240)));
#define C1MASK10 C1MASK10
extern volatile uint32_t   C1MASK10 __attribute__((section("sfrs"), address(0xBF880244)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK10bits_t;
