CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1MASK10bits_t C1MASK10bits __asm__ ("C1MASK10") __attribute__((section("sfrs"), address(0xBF880244)));
#define C1FLTOBJ11 C1FLTOBJ11
extern volatile uint32_t   C1FLTOBJ11 __attribute__((section("sfrs"), address(0xBF880248)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ11bits_t;
extern volatile __C1FLTOBJ11bits_t C1FLTOBJ11bits __asm__ ("C1FLTOBJ11") __attribute__((section("sfrs"), address(0xBF880248)));
#define C1MASK11 C1MASK11
extern volatile uint32_t   C1MASK11 __attribute__((section("sfrs"), address(0xBF88024C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK11bits_t;
extern volatile __C1MASK11bits_t C1MASK11bits __asm__ ("C1MASK11") __attribute__((section("sfrs"), address(0xBF88024C)));
#define C1FLTOBJ12 C1FLTOBJ12
extern volatile uint32_t   C1FLTOBJ12 __attribute__((section("sfrs"), address(0xBF880250)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ12bits_t;
extern volatile __C1FLTOBJ12bits_t C1FLTOBJ12bits __asm__ ("C1FLTOBJ12") __attribute__((section("sfrs"), address(0xBF880250)));
#define C1MASK12 C1MASK12
extern volatile uint32_t   C1MASK12 __attribute__((section("sfrs"), address(0xBF880254)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK12bits_t;
extern volatile __C1MASK12bits_t C1MASK12bits __asm__ ("C1MASK12") __attribute__((section("sfrs"), address(0xBF880254)));
#define C1FLTOBJ13 C1FLTOBJ13
extern volatile uint32_t   C1FLTOBJ13 __attribute__((section("sfrs"), address(0xBF880258)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ13bits_t;
extern volatile __C1FLTOBJ13bits_t C1FLTOBJ13bits __asm__ ("C1FLTOBJ13") __attribute__((section("sfrs"), address(0xBF880258)));
#define C1MASK13 C1MASK13
extern volatile uint32_t   C1MASK13 __attribute__((section("sfrs"), address(0xBF88025C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK13bits_t;
extern volatile __C1MASK13bits_t C1MASK13bits __asm__ ("C1MASK13") __attribute__((section("sfrs"), address(0xBF88025C)));
#define C1FLTOBJ14 C1FLTOBJ14
extern volatile uint32_t   C1FLTOBJ14 __attribute__((section("sfrs"), address(0xBF880260)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ14bits_t;
extern volatile __C1FLTOBJ14bits_t C1FLTOBJ14bits __asm__ ("C1FLTOBJ14") __attribute__((section("sfrs"), address(0xBF880260)));
#define C1MASK14 C1MASK14
extern volatile uint32_t   C1MASK14 __attribute__((section("sfrs"), address(0xBF880264)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK14bits_t;
extern volatile __C1MASK14bits_t C1MASK14bits __asm__ ("C1MASK14") __attribute__((section("sfrs"), address(0xBF880264)));
#define C1FLTOBJ15 C1FLTOBJ15
extern volatile uint32_t   C1FLTOBJ15 __attribute__((section("sfrs"), address(0xBF880268)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ15bits_t;
extern volatile __C1FLTOBJ15bits_t C1FLTOBJ15bits __asm__ ("C1FLTOBJ15") __attribute__((section("sfrs"), address(0xBF880268)));
#define C1MASK15 C1MASK15
extern volatile uint32_t   C1MASK15 __attribute__((section("sfrs"), address(0xBF88026C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK15bits_t;
extern volatile __C1MASK15bits_t C1MASK15bits __asm__ ("C1MASK15") __attribute__((section("sfrs"), address(0xBF88026C)));
#define C1FLTOBJ16 C1FLTOBJ16
extern volatile uint32_t   C1FLTOBJ16 __attribute__((section("sfrs"), address(0xBF880270)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ16bits_t;
extern volatile __C1FLTOBJ16bits_t C1FLTOBJ16bits __asm__ ("C1FLTOBJ16") __attribute__((section("sfrs"), address(0xBF880270)));
#define C1MASK16 C1MASK16
extern volatile uint32_t   C1MASK16 __attribute__((section("sfrs"), address(0xBF880274)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK16bits_t;
extern volatile __C1MASK16bits_t C1MASK16bits __asm__ ("C1MASK16") __attribute__((section("sfrs"), address(0xBF880274)));
#define C1FLTOBJ17 C1FLTOBJ17
extern volatile uint32_t   C1FLTOBJ17 __attribute__((section("sfrs"), address(0xBF880278)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ17bits_t;
extern volatile __C1FLTOBJ17bits_t C1FLTOBJ17bits __asm__ ("C1FLTOBJ17") __attribute__((section("sfrs"), address(0xBF880278)));
#define C1MASK17 C1MASK17
extern volatile uint32_t   C1MASK17 __attribute__((section("sfrs"), address(0xBF88027C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK17bits_t;
extern volatile __C1MASK17bits_t C1MASK17bits __asm__ ("C1MASK17") __attribute__((section("sfrs"), address(0xBF88027C)));
#define C1FLTOBJ18 C1FLTOBJ18
extern volatile uint32_t   C1FLTOBJ18 __attribute__((section("sfrs"), address(0xBF880280)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ18bits_t;
extern volatile __C1FLTOBJ18bits_t C1FLTOBJ18bits __asm__ ("C1FLTOBJ18") __attribute__((section("sfrs"), address(0xBF880280)));
#define C1MASK18 C1MASK18
extern volatile uint32_t   C1MASK18 __attribute__((section("sfrs"), address(0xBF880284)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK18bits_t;
extern volatile __C1MASK18bits_t C1MASK18bits __asm__ ("C1MASK18") __attribute__((section("sfrs"), address(0xBF880284)));
#define C1FLTOBJ19 C1FLTOBJ19
extern volatile uint32_t   C1FLTOBJ19 __attribute__((section("sfrs"), address(0xBF880288)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ19bits_t;
