CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1FLTOBJ19bits_t C1FLTOBJ19bits __asm__ ("C1FLTOBJ19") __attribute__((section("sfrs"), address(0xBF880288)));
#define C1MASK19 C1MASK19
extern volatile uint32_t   C1MASK19 __attribute__((section("sfrs"), address(0xBF88028C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK19bits_t;
extern volatile __C1MASK19bits_t C1MASK19bits __asm__ ("C1MASK19") __attribute__((section("sfrs"), address(0xBF88028C)));
#define C1FLTOBJ20 C1FLTOBJ20
extern volatile uint32_t   C1FLTOBJ20 __attribute__((section("sfrs"), address(0xBF880290)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ20bits_t;
extern volatile __C1FLTOBJ20bits_t C1FLTOBJ20bits __asm__ ("C1FLTOBJ20") __attribute__((section("sfrs"), address(0xBF880290)));
#define C1MASK20 C1MASK20
extern volatile uint32_t   C1MASK20 __attribute__((section("sfrs"), address(0xBF880294)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK20bits_t;
extern volatile __C1MASK20bits_t C1MASK20bits __asm__ ("C1MASK20") __attribute__((section("sfrs"), address(0xBF880294)));
#define C1FLTOBJ21 C1FLTOBJ21
extern volatile uint32_t   C1FLTOBJ21 __attribute__((section("sfrs"), address(0xBF880298)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ21bits_t;
extern volatile __C1FLTOBJ21bits_t C1FLTOBJ21bits __asm__ ("C1FLTOBJ21") __attribute__((section("sfrs"), address(0xBF880298)));
#define C1MASK21 C1MASK21
extern volatile uint32_t   C1MASK21 __attribute__((section("sfrs"), address(0xBF88029C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK21bits_t;
extern volatile __C1MASK21bits_t C1MASK21bits __asm__ ("C1MASK21") __attribute__((section("sfrs"), address(0xBF88029C)));
#define C1FLTOBJ22 C1FLTOBJ22
extern volatile uint32_t   C1FLTOBJ22 __attribute__((section("sfrs"), address(0xBF8802A0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ22bits_t;
extern volatile __C1FLTOBJ22bits_t C1FLTOBJ22bits __asm__ ("C1FLTOBJ22") __attribute__((section("sfrs"), address(0xBF8802A0)));
#define C1MASK22 C1MASK22
extern volatile uint32_t   C1MASK22 __attribute__((section("sfrs"), address(0xBF8802A4)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK22bits_t;
extern volatile __C1MASK22bits_t C1MASK22bits __asm__ ("C1MASK22") __attribute__((section("sfrs"), address(0xBF8802A4)));
#define C1FLTOBJ23 C1FLTOBJ23
extern volatile uint32_t   C1FLTOBJ23 __attribute__((section("sfrs"), address(0xBF8802A8)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ23bits_t;
extern volatile __C1FLTOBJ23bits_t C1FLTOBJ23bits __asm__ ("C1FLTOBJ23") __attribute__((section("sfrs"), address(0xBF8802A8)));
#define C1MASK23 C1MASK23
extern volatile uint32_t   C1MASK23 __attribute__((section("sfrs"), address(0xBF8802AC)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK23bits_t;
extern volatile __C1MASK23bits_t C1MASK23bits __asm__ ("C1MASK23") __attribute__((section("sfrs"), address(0xBF8802AC)));
#define C1FLTOBJ24 C1FLTOBJ24
extern volatile uint32_t   C1FLTOBJ24 __attribute__((section("sfrs"), address(0xBF8802B0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ24bits_t;
extern volatile __C1FLTOBJ24bits_t C1FLTOBJ24bits __asm__ ("C1FLTOBJ24") __attribute__((section("sfrs"), address(0xBF8802B0)));
#define C1MASK24 C1MASK24
extern volatile uint32_t   C1MASK24 __attribute__((section("sfrs"), address(0xBF8802B4)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK24bits_t;
extern volatile __C1MASK24bits_t C1MASK24bits __asm__ ("C1MASK24") __attribute__((section("sfrs"), address(0xBF8802B4)));
#define C1FLTOBJ25 C1FLTOBJ25
extern volatile uint32_t   C1FLTOBJ25 __attribute__((section("sfrs"), address(0xBF8802B8)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ25bits_t;
extern volatile __C1FLTOBJ25bits_t C1FLTOBJ25bits __asm__ ("C1FLTOBJ25") __attribute__((section("sfrs"), address(0xBF8802B8)));
#define C1MASK25 C1MASK25
extern volatile uint32_t   C1MASK25 __attribute__((section("sfrs"), address(0xBF8802BC)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK25bits_t;
extern volatile __C1MASK25bits_t C1MASK25bits __asm__ ("C1MASK25") __attribute__((section("sfrs"), address(0xBF8802BC)));
#define C1FLTOBJ26 C1FLTOBJ26
extern volatile uint32_t   C1FLTOBJ26 __attribute__((section("sfrs"), address(0xBF8802C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ26bits_t;
extern volatile __C1FLTOBJ26bits_t C1FLTOBJ26bits __asm__ ("C1FLTOBJ26") __attribute__((section("sfrs"), address(0xBF8802C0)));
#define C1MASK26 C1MASK26
extern volatile uint32_t   C1MASK26 __attribute__((section("sfrs"), address(0xBF8802C4)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK26bits_t;
extern volatile __C1MASK26bits_t C1MASK26bits __asm__ ("C1MASK26") __attribute__((section("sfrs"), address(0xBF8802C4)));
#define C1FLTOBJ27 C1FLTOBJ27
extern volatile uint32_t   C1FLTOBJ27 __attribute__((section("sfrs"), address(0xBF8802C8)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ27bits_t;
extern volatile __C1FLTOBJ27bits_t C1FLTOBJ27bits __asm__ ("C1FLTOBJ27") __attribute__((section("sfrs"), address(0xBF8802C8)));
#define C1MASK27 C1MASK27
extern volatile uint32_t   C1MASK27 __attribute__((section("sfrs"), address(0xBF8802CC)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK27bits_t;
extern volatile __C1MASK27bits_t C1MASK27bits __asm__ ("C1MASK27") __attribute__((section("sfrs"), address(0xBF8802CC)));
#define C1FLTOBJ28 C1FLTOBJ28
extern volatile uint32_t   C1FLTOBJ28 __attribute__((section("sfrs"), address(0xBF8802D0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ28bits_t;
extern volatile __C1FLTOBJ28bits_t C1FLTOBJ28bits __asm__ ("C1FLTOBJ28") __attribute__((section("sfrs"), address(0xBF8802D0)));
#define C1MASK28 C1MASK28
extern volatile uint32_t   C1MASK28 __attribute__((section("sfrs"), address(0xBF8802D4)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK28bits_t;
extern volatile __C1MASK28bits_t C1MASK28bits __asm__ ("C1MASK28") __attribute__((section("sfrs"), address(0xBF8802D4)));
#define C1FLTOBJ29 C1FLTOBJ29
extern volatile uint32_t   C1FLTOBJ29 __attribute__((section("sfrs"), address(0xBF8802D8)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ29bits_t;
