CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __C1FLTOBJ29bits_t C1FLTOBJ29bits __asm__ ("C1FLTOBJ29") __attribute__((section("sfrs"), address(0xBF8802D8)));
#define C1MASK29 C1MASK29
extern volatile uint32_t   C1MASK29 __attribute__((section("sfrs"), address(0xBF8802DC)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK29bits_t;
extern volatile __C1MASK29bits_t C1MASK29bits __asm__ ("C1MASK29") __attribute__((section("sfrs"), address(0xBF8802DC)));
#define C1FLTOBJ30 C1FLTOBJ30
extern volatile uint32_t   C1FLTOBJ30 __attribute__((section("sfrs"), address(0xBF8802E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ30bits_t;
extern volatile __C1FLTOBJ30bits_t C1FLTOBJ30bits __asm__ ("C1FLTOBJ30") __attribute__((section("sfrs"), address(0xBF8802E0)));
#define C1MASK30 C1MASK30
extern volatile uint32_t   C1MASK30 __attribute__((section("sfrs"), address(0xBF8802E4)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK30bits_t;
extern volatile __C1MASK30bits_t C1MASK30bits __asm__ ("C1MASK30") __attribute__((section("sfrs"), address(0xBF8802E4)));
#define C1FLTOBJ31 C1FLTOBJ31
extern volatile uint32_t   C1FLTOBJ31 __attribute__((section("sfrs"), address(0xBF8802E8)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __C1FLTOBJ31bits_t;
extern volatile __C1FLTOBJ31bits_t C1FLTOBJ31bits __asm__ ("C1FLTOBJ31") __attribute__((section("sfrs"), address(0xBF8802E8)));
#define C1MASK31 C1MASK31
extern volatile uint32_t   C1MASK31 __attribute__((section("sfrs"), address(0xBF8802EC)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __C1MASK31bits_t;
extern volatile __C1MASK31bits_t C1MASK31bits __asm__ ("C1MASK31") __attribute__((section("sfrs"), address(0xBF8802EC)));
#define ADCCON1 ADCCON1
extern volatile uint32_t   ADCCON1 __attribute__((section("sfrs"), address(0xBF887000)));
typedef struct {
  uint32_t DMABL:3;
  uint32_t STRGLVL:1;
  uint32_t IRQVS:3;
  uint32_t :2;
  uint32_t FSPBCLKEN:1;
  uint32_t FSSCLKEN:1;
  uint32_t CVDEN:1;
  uint32_t AICPMPEN:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t STRGSRC:5;
  uint32_t SELRES:2;
  uint32_t FRACT:1;
  uint32_t TRBSLV:3;
  uint32_t TRBMST:3;
  uint32_t TRBERR:1;
  uint32_t TRBEN:1;
} __ADCCON1bits_t;
extern volatile __ADCCON1bits_t ADCCON1bits __asm__ ("ADCCON1") __attribute__((section("sfrs"), address(0xBF887000)));
extern volatile uint32_t        ADCCON1CLR __attribute__((section("sfrs"),address(0xBF887004)));
extern volatile uint32_t        ADCCON1SET __attribute__((section("sfrs"),address(0xBF887008)));
extern volatile uint32_t        ADCCON1INV __attribute__((section("sfrs"),address(0xBF88700C)));
#define ADCCON2 ADCCON2
extern volatile uint32_t   ADCCON2 __attribute__((section("sfrs"), address(0xBF887010)));
typedef struct {
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t ADCEIS:3;
  uint32_t :1;
  uint32_t ADCEIOVR:1;
  uint32_t EOSIEN:1;
  uint32_t REFFLTIEN:1;
  uint32_t BGVRIEN:1;
  uint32_t SAMC:10;
  uint32_t CVDCPL:3;
  uint32_t EOSRDY:1;
  uint32_t REFFLT:1;
  uint32_t BGVRRDY:1;
} __ADCCON2bits_t;
extern volatile __ADCCON2bits_t ADCCON2bits __asm__ ("ADCCON2") __attribute__((section("sfrs"), address(0xBF887010)));
extern volatile uint32_t        ADCCON2CLR __attribute__((section("sfrs"),address(0xBF887014)));
extern volatile uint32_t        ADCCON2SET __attribute__((section("sfrs"),address(0xBF887018)));
extern volatile uint32_t        ADCCON2INV __attribute__((section("sfrs"),address(0xBF88701C)));
#define ADCCON3 ADCCON3
extern volatile uint32_t   ADCCON3 __attribute__((section("sfrs"), address(0xBF887020)));
typedef struct {
  uint32_t ADINSEL:6;
  uint32_t GSWTRG:1;
  uint32_t GLSWTRG:1;
  uint32_t RQCNVRT:1;
  uint32_t SAMP:1;
  uint32_t UPDRDY:1;
  uint32_t UPDIEN:1;
  uint32_t TRGSUSP:1;
  uint32_t VREFSEL:3;
  uint32_t DIGEN0:1;
  uint32_t DIGEN1:1;
  uint32_t DIGEN2:1;
  uint32_t DIGEN3:1;
  uint32_t DIGEN4:1;
  uint32_t DIGEN5:1;
  uint32_t :1;
  uint32_t DIGEN7:1;
  uint32_t CONCLKDIV:6;
  uint32_t ADCSEL:2;
} __ADCCON3bits_t;
extern volatile __ADCCON3bits_t ADCCON3bits __asm__ ("ADCCON3") __attribute__((section("sfrs"), address(0xBF887020)));
extern volatile uint32_t        ADCCON3CLR __attribute__((section("sfrs"),address(0xBF887024)));
extern volatile uint32_t        ADCCON3SET __attribute__((section("sfrs"),address(0xBF887028)));
extern volatile uint32_t        ADCCON3INV __attribute__((section("sfrs"),address(0xBF88702C)));
#define ADCTRGMODE ADCTRGMODE
extern volatile uint32_t   ADCTRGMODE __attribute__((section("sfrs"), address(0xBF887030)));
typedef struct {
  uint32_t SSAMPEN0:1;
  uint32_t SSAMPEN1:1;
  uint32_t SSAMPEN2:1;
  uint32_t SSAMPEN3:1;
  uint32_t SSAMPEN4:1;
  uint32_t SSAMPEN5:1;
  uint32_t :2;
  uint32_t STRGEN0:1;
  uint32_t STRGEN1:1;
  uint32_t STRGEN2:1;
  uint32_t STRGEN3:1;
  uint32_t STRGEN4:1;
  uint32_t STRGEN5:1;
  uint32_t :2;
  uint32_t SH0ALT:2;
  uint32_t SH1ALT:2;
  uint32_t SH2ALT:2;
  uint32_t SH3ALT:2;
  uint32_t SH4ALT:2;
  uint32_t SH5ALT:2;
} __ADCTRGMODEbits_t;
extern volatile __ADCTRGMODEbits_t ADCTRGMODEbits __asm__ ("ADCTRGMODE") __attribute__((section("sfrs"), address(0xBF887030)));
extern volatile uint32_t        ADCTRGMODECLR __attribute__((section("sfrs"),address(0xBF887034)));
extern volatile uint32_t        ADCTRGMODESET __attribute__((section("sfrs"),address(0xBF887038)));
extern volatile uint32_t        ADCTRGMODEINV __attribute__((section("sfrs"),address(0xBF88703C)));
#define ADCIMCON1 ADCIMCON1
extern volatile uint32_t   ADCIMCON1 __attribute__((section("sfrs"), address(0xBF887040)));
typedef struct {
  uint32_t SIGN0:1;
  uint32_t DIFF0:1;
  uint32_t SIGN1:1;
  uint32_t DIFF1:1;
  uint32_t SIGN2:1;
  uint32_t DIFF2:1;
  uint32_t SIGN3:1;
  uint32_t DIFF3:1;
  uint32_t SIGN4:1;
  uint32_t DIFF4:1;
  uint32_t SIGN5:1;
  uint32_t DIFF5:1;
  uint32_t SIGN6:1;
  uint32_t DIFF6:1;
  uint32_t SIGN7:1;
  uint32_t DIFF7:1;
  uint32_t SIGN8:1;
  uint32_t DIFF8:1;
  uint32_t SIGN9:1;
  uint32_t DIFF9:1;
  uint32_t SIGN10:1;
  uint32_t DIFF10:1;
  uint32_t SIGN11:1;
  uint32_t DIFF11:1;
  uint32_t SIGN12:1;
  uint32_t DIFF12:1;
  uint32_t SIGN13:1;
  uint32_t DIFF13:1;
  uint32_t SIGN14:1;
  uint32_t DIFF14:1;
  uint32_t SIGN15:1;
  uint32_t DIFF15:1;
} __ADCIMCON1bits_t;
