CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __ADCDATA40bits_t ADCDATA40bits __asm__ ("ADCDATA40") __attribute__((section("sfrs"), address(0xBF887880)));
extern volatile uint32_t        ADCDATA40CLR __attribute__((section("sfrs"),address(0xBF887884)));
extern volatile uint32_t        ADCDATA40SET __attribute__((section("sfrs"),address(0xBF887888)));
extern volatile uint32_t        ADCDATA40INV __attribute__((section("sfrs"),address(0xBF88788C)));
#define ADCDATA41 ADCDATA41
extern volatile uint32_t   ADCDATA41 __attribute__((section("sfrs"), address(0xBF887890)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA41bits_t;
extern volatile __ADCDATA41bits_t ADCDATA41bits __asm__ ("ADCDATA41") __attribute__((section("sfrs"), address(0xBF887890)));
extern volatile uint32_t        ADCDATA41CLR __attribute__((section("sfrs"),address(0xBF887894)));
extern volatile uint32_t        ADCDATA41SET __attribute__((section("sfrs"),address(0xBF887898)));
extern volatile uint32_t        ADCDATA41INV __attribute__((section("sfrs"),address(0xBF88789C)));
#define ADCDATA46 ADCDATA46
extern volatile uint32_t   ADCDATA46 __attribute__((section("sfrs"), address(0xBF8878E0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA46bits_t;
extern volatile __ADCDATA46bits_t ADCDATA46bits __asm__ ("ADCDATA46") __attribute__((section("sfrs"), address(0xBF8878E0)));
extern volatile uint32_t        ADCDATA46CLR __attribute__((section("sfrs"),address(0xBF8878E4)));
extern volatile uint32_t        ADCDATA46SET __attribute__((section("sfrs"),address(0xBF8878E8)));
extern volatile uint32_t        ADCDATA46INV __attribute__((section("sfrs"),address(0xBF8878EC)));
#define ADCDATA47 ADCDATA47
extern volatile uint32_t   ADCDATA47 __attribute__((section("sfrs"), address(0xBF8878F0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA47bits_t;
extern volatile __ADCDATA47bits_t ADCDATA47bits __asm__ ("ADCDATA47") __attribute__((section("sfrs"), address(0xBF8878F0)));
extern volatile uint32_t        ADCDATA47CLR __attribute__((section("sfrs"),address(0xBF8878F4)));
extern volatile uint32_t        ADCDATA47SET __attribute__((section("sfrs"),address(0xBF8878F8)));
extern volatile uint32_t        ADCDATA47INV __attribute__((section("sfrs"),address(0xBF8878FC)));
#define ADCDATA48 ADCDATA48
extern volatile uint32_t   ADCDATA48 __attribute__((section("sfrs"), address(0xBF887900)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA48bits_t;
extern volatile __ADCDATA48bits_t ADCDATA48bits __asm__ ("ADCDATA48") __attribute__((section("sfrs"), address(0xBF887900)));
extern volatile uint32_t        ADCDATA48CLR __attribute__((section("sfrs"),address(0xBF887904)));
extern volatile uint32_t        ADCDATA48SET __attribute__((section("sfrs"),address(0xBF887908)));
extern volatile uint32_t        ADCDATA48INV __attribute__((section("sfrs"),address(0xBF88790C)));
#define ADCDATA49 ADCDATA49
extern volatile uint32_t   ADCDATA49 __attribute__((section("sfrs"), address(0xBF887910)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA49bits_t;
extern volatile __ADCDATA49bits_t ADCDATA49bits __asm__ ("ADCDATA49") __attribute__((section("sfrs"), address(0xBF887910)));
extern volatile uint32_t        ADCDATA49CLR __attribute__((section("sfrs"),address(0xBF887914)));
extern volatile uint32_t        ADCDATA49SET __attribute__((section("sfrs"),address(0xBF887918)));
extern volatile uint32_t        ADCDATA49INV __attribute__((section("sfrs"),address(0xBF88791C)));
#define ADCDATA50 ADCDATA50
extern volatile uint32_t   ADCDATA50 __attribute__((section("sfrs"), address(0xBF887920)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA50bits_t;
extern volatile __ADCDATA50bits_t ADCDATA50bits __asm__ ("ADCDATA50") __attribute__((section("sfrs"), address(0xBF887920)));
extern volatile uint32_t        ADCDATA50CLR __attribute__((section("sfrs"),address(0xBF887924)));
extern volatile uint32_t        ADCDATA50SET __attribute__((section("sfrs"),address(0xBF887928)));
extern volatile uint32_t        ADCDATA50INV __attribute__((section("sfrs"),address(0xBF88792C)));
#define ADCDATA51 ADCDATA51
extern volatile uint32_t   ADCDATA51 __attribute__((section("sfrs"), address(0xBF887930)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA51bits_t;
extern volatile __ADCDATA51bits_t ADCDATA51bits __asm__ ("ADCDATA51") __attribute__((section("sfrs"), address(0xBF887930)));
extern volatile uint32_t        ADCDATA51CLR __attribute__((section("sfrs"),address(0xBF887934)));
extern volatile uint32_t        ADCDATA51SET __attribute__((section("sfrs"),address(0xBF887938)));
extern volatile uint32_t        ADCDATA51INV __attribute__((section("sfrs"),address(0xBF88793C)));
#define ADCDATA52 ADCDATA52
extern volatile uint32_t   ADCDATA52 __attribute__((section("sfrs"), address(0xBF887940)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA52bits_t;
extern volatile __ADCDATA52bits_t ADCDATA52bits __asm__ ("ADCDATA52") __attribute__((section("sfrs"), address(0xBF887940)));
extern volatile uint32_t        ADCDATA52CLR __attribute__((section("sfrs"),address(0xBF887944)));
extern volatile uint32_t        ADCDATA52SET __attribute__((section("sfrs"),address(0xBF887948)));
extern volatile uint32_t        ADCDATA52INV __attribute__((section("sfrs"),address(0xBF88794C)));
#define ADCDATA53 ADCDATA53
extern volatile uint32_t   ADCDATA53 __attribute__((section("sfrs"), address(0xBF887950)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA53bits_t;
extern volatile __ADCDATA53bits_t ADCDATA53bits __asm__ ("ADCDATA53") __attribute__((section("sfrs"), address(0xBF887950)));
extern volatile uint32_t        ADCDATA53CLR __attribute__((section("sfrs"),address(0xBF887954)));
extern volatile uint32_t        ADCDATA53SET __attribute__((section("sfrs"),address(0xBF887958)));
extern volatile uint32_t        ADCDATA53INV __attribute__((section("sfrs"),address(0xBF88795C)));
#define ADC0CFG ADC0CFG
extern volatile uint32_t   ADC0CFG __attribute__((section("sfrs"), address(0xBF887D00)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC0CFGbits_t;
extern volatile __ADC0CFGbits_t ADC0CFGbits __asm__ ("ADC0CFG") __attribute__((section("sfrs"), address(0xBF887D00)));
extern volatile uint32_t        ADC0CFGCLR __attribute__((section("sfrs"),address(0xBF887D04)));
extern volatile uint32_t        ADC0CFGSET __attribute__((section("sfrs"),address(0xBF887D08)));
extern volatile uint32_t        ADC0CFGINV __attribute__((section("sfrs"),address(0xBF887D0C)));
#define ADC1CFG ADC1CFG
extern volatile uint32_t   ADC1CFG __attribute__((section("sfrs"), address(0xBF887D10)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC1CFGbits_t;
extern volatile __ADC1CFGbits_t ADC1CFGbits __asm__ ("ADC1CFG") __attribute__((section("sfrs"), address(0xBF887D10)));
extern volatile uint32_t        ADC1CFGCLR __attribute__((section("sfrs"),address(0xBF887D14)));
extern volatile uint32_t        ADC1CFGSET __attribute__((section("sfrs"),address(0xBF887D18)));
extern volatile uint32_t        ADC1CFGINV __attribute__((section("sfrs"),address(0xBF887D1C)));
#define ADC2CFG ADC2CFG
extern volatile uint32_t   ADC2CFG __attribute__((section("sfrs"), address(0xBF887D20)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC2CFGbits_t;
extern volatile __ADC2CFGbits_t ADC2CFGbits __asm__ ("ADC2CFG") __attribute__((section("sfrs"), address(0xBF887D20)));
extern volatile uint32_t        ADC2CFGCLR __attribute__((section("sfrs"),address(0xBF887D24)));
extern volatile uint32_t        ADC2CFGSET __attribute__((section("sfrs"),address(0xBF887D28)));
extern volatile uint32_t        ADC2CFGINV __attribute__((section("sfrs"),address(0xBF887D2C)));
#define ADC3CFG ADC3CFG
extern volatile uint32_t   ADC3CFG __attribute__((section("sfrs"), address(0xBF887D30)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC3CFGbits_t;
extern volatile __ADC3CFGbits_t ADC3CFGbits __asm__ ("ADC3CFG") __attribute__((section("sfrs"), address(0xBF887D30)));
extern volatile uint32_t        ADC3CFGCLR __attribute__((section("sfrs"),address(0xBF887D34)));
extern volatile uint32_t        ADC3CFGSET __attribute__((section("sfrs"),address(0xBF887D38)));
extern volatile uint32_t        ADC3CFGINV __attribute__((section("sfrs"),address(0xBF887D3C)));
#define ADC4CFG ADC4CFG
extern volatile uint32_t   ADC4CFG __attribute__((section("sfrs"), address(0xBF887D40)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC4CFGbits_t;
extern volatile __ADC4CFGbits_t ADC4CFGbits __asm__ ("ADC4CFG") __attribute__((section("sfrs"), address(0xBF887D40)));
extern volatile uint32_t        ADC4CFGCLR __attribute__((section("sfrs"),address(0xBF887D44)));
extern volatile uint32_t        ADC4CFGSET __attribute__((section("sfrs"),address(0xBF887D48)));
extern volatile uint32_t        ADC4CFGINV __attribute__((section("sfrs"),address(0xBF887D4C)));
#define ADC7CFG ADC7CFG
extern volatile uint32_t   ADC7CFG __attribute__((section("sfrs"), address(0xBF887D70)));
typedef struct {
  uint32_t ADCCFG:32;
} __ADC7CFGbits_t;
