CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __DSGPR18bits_t DSGPR18bits __asm__ ("DSGPR18") __attribute__((section("sfrs"), address(0xBF8C0254)));
#define DSGPR19 DSGPR19
extern volatile uint32_t   DSGPR19 __attribute__((section("sfrs"), address(0xBF8C0258)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR19bits_t;
extern volatile __DSGPR19bits_t DSGPR19bits __asm__ ("DSGPR19") __attribute__((section("sfrs"), address(0xBF8C0258)));
#define DSGPR20 DSGPR20
extern volatile uint32_t   DSGPR20 __attribute__((section("sfrs"), address(0xBF8C025C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR20bits_t;
extern volatile __DSGPR20bits_t DSGPR20bits __asm__ ("DSGPR20") __attribute__((section("sfrs"), address(0xBF8C025C)));
#define DSGPR21 DSGPR21
extern volatile uint32_t   DSGPR21 __attribute__((section("sfrs"), address(0xBF8C0260)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR21bits_t;
extern volatile __DSGPR21bits_t DSGPR21bits __asm__ ("DSGPR21") __attribute__((section("sfrs"), address(0xBF8C0260)));
#define DSGPR22 DSGPR22
extern volatile uint32_t   DSGPR22 __attribute__((section("sfrs"), address(0xBF8C0264)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR22bits_t;
extern volatile __DSGPR22bits_t DSGPR22bits __asm__ ("DSGPR22") __attribute__((section("sfrs"), address(0xBF8C0264)));
#define DSGPR23 DSGPR23
extern volatile uint32_t   DSGPR23 __attribute__((section("sfrs"), address(0xBF8C0268)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR23bits_t;
extern volatile __DSGPR23bits_t DSGPR23bits __asm__ ("DSGPR23") __attribute__((section("sfrs"), address(0xBF8C0268)));
#define DSGPR24 DSGPR24
extern volatile uint32_t   DSGPR24 __attribute__((section("sfrs"), address(0xBF8C026C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR24bits_t;
extern volatile __DSGPR24bits_t DSGPR24bits __asm__ ("DSGPR24") __attribute__((section("sfrs"), address(0xBF8C026C)));
#define DSGPR25 DSGPR25
extern volatile uint32_t   DSGPR25 __attribute__((section("sfrs"), address(0xBF8C0270)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR25bits_t;
extern volatile __DSGPR25bits_t DSGPR25bits __asm__ ("DSGPR25") __attribute__((section("sfrs"), address(0xBF8C0270)));
#define DSGPR26 DSGPR26
extern volatile uint32_t   DSGPR26 __attribute__((section("sfrs"), address(0xBF8C0274)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR26bits_t;
extern volatile __DSGPR26bits_t DSGPR26bits __asm__ ("DSGPR26") __attribute__((section("sfrs"), address(0xBF8C0274)));
#define DSGPR27 DSGPR27
extern volatile uint32_t   DSGPR27 __attribute__((section("sfrs"), address(0xBF8C0278)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR27bits_t;
extern volatile __DSGPR27bits_t DSGPR27bits __asm__ ("DSGPR27") __attribute__((section("sfrs"), address(0xBF8C0278)));
#define DSGPR28 DSGPR28
extern volatile uint32_t   DSGPR28 __attribute__((section("sfrs"), address(0xBF8C027C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR28bits_t;
extern volatile __DSGPR28bits_t DSGPR28bits __asm__ ("DSGPR28") __attribute__((section("sfrs"), address(0xBF8C027C)));
#define DSGPR29 DSGPR29
extern volatile uint32_t   DSGPR29 __attribute__((section("sfrs"), address(0xBF8C0280)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR29bits_t;
extern volatile __DSGPR29bits_t DSGPR29bits __asm__ ("DSGPR29") __attribute__((section("sfrs"), address(0xBF8C0280)));
#define DSGPR30 DSGPR30
extern volatile uint32_t   DSGPR30 __attribute__((section("sfrs"), address(0xBF8C0284)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR30bits_t;
extern volatile __DSGPR30bits_t DSGPR30bits __asm__ ("DSGPR30") __attribute__((section("sfrs"), address(0xBF8C0284)));
#define DSGPR31 DSGPR31
extern volatile uint32_t   DSGPR31 __attribute__((section("sfrs"), address(0xBF8C0288)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR31bits_t;
extern volatile __DSGPR31bits_t DSGPR31bits __asm__ ("DSGPR31") __attribute__((section("sfrs"), address(0xBF8C0288)));
#define DSGPR32 DSGPR32
extern volatile uint32_t   DSGPR32 __attribute__((section("sfrs"), address(0xBF8C028C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR32bits_t;
extern volatile __DSGPR32bits_t DSGPR32bits __asm__ ("DSGPR32") __attribute__((section("sfrs"), address(0xBF8C028C)));
#define SBFLAG SBFLAG
extern volatile uint32_t   SBFLAG __attribute__((section("sfrs"), address(0xBF8F0510)));
typedef struct {
  uint32_t T0PGV:1;
  uint32_t T1PGV:1;
  uint32_t T2PGV:1;
  uint32_t T3PGV:1;
} __SBFLAGbits_t;
extern volatile __SBFLAGbits_t SBFLAGbits __asm__ ("SBFLAG") __attribute__((section("sfrs"), address(0xBF8F0510)));
#define SBT0ELOG1 SBT0ELOG1
extern volatile uint32_t   SBT0ELOG1 __attribute__((section("sfrs"), address(0xBF8F8020)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT0ELOG1bits_t;
extern volatile __SBT0ELOG1bits_t SBT0ELOG1bits __asm__ ("SBT0ELOG1") __attribute__((section("sfrs"), address(0xBF8F8020)));
#define SBT0ELOG2 SBT0ELOG2
extern volatile uint32_t   SBT0ELOG2 __attribute__((section("sfrs"), address(0xBF8F8024)));
typedef struct {
  uint32_t GROUP:2;
} __SBT0ELOG2bits_t;
extern volatile __SBT0ELOG2bits_t SBT0ELOG2bits __asm__ ("SBT0ELOG2") __attribute__((section("sfrs"), address(0xBF8F8024)));
#define SBT0ECON SBT0ECON
extern volatile uint32_t   SBT0ECON __attribute__((section("sfrs"), address(0xBF8F8028)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT0ECONbits_t;
extern volatile __SBT0ECONbits_t SBT0ECONbits __asm__ ("SBT0ECON") __attribute__((section("sfrs"), address(0xBF8F8028)));
#define SBT0ECLRS SBT0ECLRS
extern volatile uint32_t   SBT0ECLRS __attribute__((section("sfrs"), address(0xBF8F8030)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT0ECLRSbits_t;
extern volatile __SBT0ECLRSbits_t SBT0ECLRSbits __asm__ ("SBT0ECLRS") __attribute__((section("sfrs"), address(0xBF8F8030)));
#define SBT0ECLRM SBT0ECLRM
extern volatile uint32_t   SBT0ECLRM __attribute__((section("sfrs"), address(0xBF8F8038)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT0ECLRMbits_t;
