CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
extern volatile __SBT3REG1bits_t SBT3REG1bits __asm__ ("SBT3REG1") __attribute__((section("sfrs"), address(0xBF8F8C60)));
#define SBT3RD1 SBT3RD1
extern volatile uint32_t   SBT3RD1 __attribute__((section("sfrs"), address(0xBF8F8C70)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3RD1bits_t;
extern volatile __SBT3RD1bits_t SBT3RD1bits __asm__ ("SBT3RD1") __attribute__((section("sfrs"), address(0xBF8F8C70)));
#define SBT3WR1 SBT3WR1
extern volatile uint32_t   SBT3WR1 __attribute__((section("sfrs"), address(0xBF8F8C78)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3WR1bits_t;
extern volatile __SBT3WR1bits_t SBT3WR1bits __asm__ ("SBT3WR1") __attribute__((section("sfrs"), address(0xBF8F8C78)));
#define SBT3REG2 SBT3REG2
extern volatile uint32_t   SBT3REG2 __attribute__((section("sfrs"), address(0xBF8F8C80)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT3REG2bits_t;
extern volatile __SBT3REG2bits_t SBT3REG2bits __asm__ ("SBT3REG2") __attribute__((section("sfrs"), address(0xBF8F8C80)));
#define SBT3RD2 SBT3RD2
extern volatile uint32_t   SBT3RD2 __attribute__((section("sfrs"), address(0xBF8F8C90)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3RD2bits_t;
extern volatile __SBT3RD2bits_t SBT3RD2bits __asm__ ("SBT3RD2") __attribute__((section("sfrs"), address(0xBF8F8C90)));
#define SBT3WR2 SBT3WR2
extern volatile uint32_t   SBT3WR2 __attribute__((section("sfrs"), address(0xBF8F8C98)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3WR2bits_t;
extern volatile __SBT3WR2bits_t SBT3WR2bits __asm__ ("SBT3WR2") __attribute__((section("sfrs"), address(0xBF8F8C98)));
#define DEVCFG3 DEVCFG3
extern volatile uint32_t   DEVCFG3 __attribute__((section("sfrs"), address(0xBFC03FC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :11;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG3bits_t;
extern volatile __DEVCFG3bits_t DEVCFG3bits __asm__ ("DEVCFG3") __attribute__((section("sfrs"), address(0xBFC03FC0)));
#define DEVCFG2 DEVCFG2
extern volatile uint32_t   DEVCFG2 __attribute__((section("sfrs"), address(0xBFC03FC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t VBATBOREN:1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t BORSEL:1;
    uint32_t :1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG2bits_t;
extern volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2") __attribute__((section("sfrs"), address(0xBFC03FC4)));
#define DEVCFG1 DEVCFG1
extern volatile uint32_t   DEVCFG1 __attribute__((section("sfrs"), address(0xBFC03FC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG1bits_t;
extern volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs"), address(0xBFC03FC8)));
#define DEVCFG0 DEVCFG0
extern volatile uint32_t   DEVCFG0 __attribute__((section("sfrs"), address(0xBFC03FCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :3;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t :8;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG0bits_t;
extern volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0") __attribute__((section("sfrs"), address(0xBFC03FCC)));
#define DEVCP DEVCP
extern volatile uint32_t   DEVCP __attribute__((section("sfrs"), address(0xBFC03FDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCPbits_t;
extern volatile __DEVCPbits_t DEVCPbits __asm__ ("DEVCP") __attribute__((section("sfrs"), address(0xBFC03FDC)));
#define DEVSIGN DEVSIGN
extern volatile uint32_t   DEVSIGN __attribute__((section("sfrs"), address(0xBFC03FEC)));
#define SEQ SEQ
extern volatile uint32_t   SEQ __attribute__((section("sfrs"), address(0xBFC03FF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __SEQbits_t;
extern volatile __SEQbits_t SEQbits __asm__ ("SEQ") __attribute__((section("sfrs"), address(0xBFC03FF0)));
#define DEVADC0 DEVADC0
extern volatile uint32_t   DEVADC0 __attribute__((section("sfrs"), address(0xBFC45000)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC0bits_t;
extern volatile __DEVADC0bits_t DEVADC0bits __asm__ ("DEVADC0") __attribute__((section("sfrs"), address(0xBFC45000)));
#define DEVADC1 DEVADC1
extern volatile uint32_t   DEVADC1 __attribute__((section("sfrs"), address(0xBFC45004)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC1bits_t;
extern volatile __DEVADC1bits_t DEVADC1bits __asm__ ("DEVADC1") __attribute__((section("sfrs"), address(0xBFC45004)));
#define DEVADC2 DEVADC2
extern volatile uint32_t   DEVADC2 __attribute__((section("sfrs"), address(0xBFC45008)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC2bits_t;
extern volatile __DEVADC2bits_t DEVADC2bits __asm__ ("DEVADC2") __attribute__((section("sfrs"), address(0xBFC45008)));
#define DEVADC3 DEVADC3
extern volatile uint32_t   DEVADC3 __attribute__((section("sfrs"), address(0xBFC4500C)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC3bits_t;
