CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
  .extern SPI2STAT         /* 0xBF827210 */
  .extern SPI2STATCLR      /* 0xBF827214 */
  .extern SPI2STATSET      /* 0xBF827218 */
  .extern SPI2STATINV      /* 0xBF82721C */
  .extern SPI2BUF          /* 0xBF827220 */
  .extern SPI2BRG          /* 0xBF827230 */
  .extern SPI2BRGCLR       /* 0xBF827234 */
  .extern SPI2BRGSET       /* 0xBF827238 */
  .extern SPI2BRGINV       /* 0xBF82723C */
  .extern SPI2CON2         /* 0xBF827240 */
  .extern SPI2CON2CLR      /* 0xBF827244 */
  .extern SPI2CON2SET      /* 0xBF827248 */
  .extern SPI2CON2INV      /* 0xBF82724C */
  .extern U1MODE           /* 0xBF828000 */
  .extern U1MODECLR        /* 0xBF828004 */
  .extern U1MODESET        /* 0xBF828008 */
  .extern U1MODEINV        /* 0xBF82800C */
  .extern U1STA            /* 0xBF828010 */
  .extern U1STACLR         /* 0xBF828014 */
  .extern U1STASET         /* 0xBF828018 */
  .extern U1STAINV         /* 0xBF82801C */
  .extern U1TXREG          /* 0xBF828020 */
  .extern U1RXREG          /* 0xBF828030 */
  .extern U1BRG            /* 0xBF828040 */
  .extern U1BRGCLR         /* 0xBF828044 */
  .extern U1BRGSET         /* 0xBF828048 */
  .extern U1BRGINV         /* 0xBF82804C */
  .extern U2MODE           /* 0xBF828200 */
  .extern U2MODECLR        /* 0xBF828204 */
  .extern U2MODESET        /* 0xBF828208 */
  .extern U2MODEINV        /* 0xBF82820C */
  .extern U2STA            /* 0xBF828210 */
  .extern U2STACLR         /* 0xBF828214 */
  .extern U2STASET         /* 0xBF828218 */
  .extern U2STAINV         /* 0xBF82821C */
  .extern U2TXREG          /* 0xBF828220 */
  .extern U2RXREG          /* 0xBF828230 */
  .extern U2BRG            /* 0xBF828240 */
  .extern U2BRGCLR         /* 0xBF828244 */
  .extern U2BRGSET         /* 0xBF828248 */
  .extern U2BRGINV         /* 0xBF82824C */
  .extern PTCON            /* 0xBF82A000 */
  .extern PTCONCLR         /* 0xBF82A004 */
  .extern PTCONSET         /* 0xBF82A008 */
  .extern PTCONINV         /* 0xBF82A00C */
  .extern PTPER            /* 0xBF82A010 */
  .extern PTPERCLR         /* 0xBF82A014 */
  .extern PTPERSET         /* 0xBF82A018 */
  .extern PTPERINV         /* 0xBF82A01C */
  .extern SEVTCMP          /* 0xBF82A020 */
  .extern SEVTCMPCLR       /* 0xBF82A024 */
  .extern SEVTCMPSET       /* 0xBF82A028 */
  .extern SEVTCMPINV       /* 0xBF82A02C */
  .extern PMTMR            /* 0xBF82A030 */
  .extern PMTMRCLR         /* 0xBF82A034 */
  .extern PMTMRSET         /* 0xBF82A038 */
  .extern PMTMRINV         /* 0xBF82A03C */
  .extern STCON            /* 0xBF82A040 */
  .extern STCONCLR         /* 0xBF82A044 */
  .extern STCONSET         /* 0xBF82A048 */
  .extern STCONINV         /* 0xBF82A04C */
  .extern STPER            /* 0xBF82A050 */
  .extern STPERCLR         /* 0xBF82A054 */
  .extern STPERSET         /* 0xBF82A058 */
  .extern STPERINV         /* 0xBF82A05C */
  .extern SSEVTCMP         /* 0xBF82A060 */
  .extern SSEVTCMPCLR      /* 0xBF82A064 */
  .extern SSEVTCMPSET      /* 0xBF82A068 */
  .extern SSEVTCMPINV      /* 0xBF82A06C */
  .extern SMTMR            /* 0xBF82A070 */
  .extern SMTMRCLR         /* 0xBF82A074 */
  .extern SMTMRSET         /* 0xBF82A078 */
  .extern SMTMRINV         /* 0xBF82A07C */
  .extern CHOP             /* 0xBF82A080 */
  .extern CHOPCLR          /* 0xBF82A084 */
  .extern CHOPSET          /* 0xBF82A088 */
  .extern CHOPINV          /* 0xBF82A08C */
  .extern PWMKEY           /* 0xBF82A090 */
  .extern PWMKEYCLR        /* 0xBF82A094 */
  .extern PWMKEYSET        /* 0xBF82A098 */
  .extern PWMKEYINV        /* 0xBF82A09C */
  .extern PWMCON1          /* 0xBF82A0C0 */
  .extern PWMCON1CLR       /* 0xBF82A0C4 */
  .extern PWMCON1SET       /* 0xBF82A0C8 */
  .extern PWMCON1INV       /* 0xBF82A0CC */
  .extern IOCON1           /* 0xBF82A0D0 */
  .extern IOCON1CLR        /* 0xBF82A0D4 */
  .extern IOCON1SET        /* 0xBF82A0D8 */
  .extern IOCON1INV        /* 0xBF82A0DC */
  .extern PDC1             /* 0xBF82A0E0 */
  .extern PDC1CLR          /* 0xBF82A0E4 */
  .extern PDC1SET          /* 0xBF82A0E8 */
  .extern PDC1INV          /* 0xBF82A0EC */
  .extern SDC1             /* 0xBF82A0F0 */
  .extern SDC1CLR          /* 0xBF82A0F4 */
  .extern SDC1SET          /* 0xBF82A0F8 */
  .extern SDC1INV          /* 0xBF82A0FC */
  .extern PHASE1           /* 0xBF82A100 */
  .extern PHASE1CLR        /* 0xBF82A104 */
  .extern PHASE1SET        /* 0xBF82A108 */
  .extern PHASE1INV        /* 0xBF82A10C */
  .extern DTR1             /* 0xBF82A110 */
  .extern DTR1CLR          /* 0xBF82A114 */
  .extern DTR1SET          /* 0xBF82A118 */
  .extern DTR1INV          /* 0xBF82A11C */
  .extern ALTDTR1          /* 0xBF82A120 */
  .extern ALTDTR1CLR       /* 0xBF82A124 */
  .extern ALTDTR1SET       /* 0xBF82A128 */
  .extern ALTDTR1INV       /* 0xBF82A12C */
  .extern DTCOMP1          /* 0xBF82A130 */
  .extern DTCOMP1CLR       /* 0xBF82A134 */
  .extern DTCOMP1SET       /* 0xBF82A138 */
  .extern DTCOMP1INV       /* 0xBF82A13C */
  .extern TRIG1            /* 0xBF82A140 */
  .extern TRIG1CLR         /* 0xBF82A144 */
  .extern TRIG1SET         /* 0xBF82A148 */
  .extern TRIG1INV         /* 0xBF82A14C */
  .extern TRGCON1          /* 0xBF82A150 */
  .extern TRGCON1CLR       /* 0xBF82A154 */
  .extern TRGCON1SET       /* 0xBF82A158 */
  .extern TRGCON1INV       /* 0xBF82A15C */
  .extern STRIG1           /* 0xBF82A160 */
  .extern STRIG1CLR        /* 0xBF82A164 */
  .extern STRIG1SET        /* 0xBF82A168 */
  .extern STRIG1INV        /* 0xBF82A16C */
  .extern CAP1             /* 0xBF82A170 */
  .extern CAP1CLR          /* 0xBF82A174 */
  .extern CAP1SET          /* 0xBF82A178 */
  .extern CAP1INV          /* 0xBF82A17C */
  .extern LEBCON1          /* 0xBF82A180 */
  .extern LEBCON1CLR       /* 0xBF82A184 */
  .extern LEBCON1SET       /* 0xBF82A188 */
  .extern LEBCON1INV       /* 0xBF82A18C */
  .extern LEBDLY1          /* 0xBF82A190 */
  .extern LEBDLY1CLR       /* 0xBF82A194 */
  .extern LEBDLY1SET       /* 0xBF82A198 */
  .extern LEBDLY1INV       /* 0xBF82A19C */
  .extern AUXCON1          /* 0xBF82A1A0 */
  .extern AUXCON1CLR       /* 0xBF82A1A4 */
  .extern AUXCON1SET       /* 0xBF82A1A8 */
  .extern AUXCON1INV       /* 0xBF82A1AC */
  .extern PTMR1            /* 0xBF82A1B0 */
  .extern PTMR1CLR         /* 0xBF82A1B4 */
  .extern PTMR1SET         /* 0xBF82A1B8 */
  .extern PTMR1INV         /* 0xBF82A1BC */
  .extern PWMCON2          /* 0xBF82A1C0 */
  .extern PWMCON2CLR       /* 0xBF82A1C4 */
  .extern PWMCON2SET       /* 0xBF82A1C8 */
  .extern PWMCON2INV       /* 0xBF82A1CC */
  .extern IOCON2           /* 0xBF82A1D0 */
  .extern IOCON2CLR        /* 0xBF82A1D4 */
  .extern IOCON2SET        /* 0xBF82A1D8 */
  .extern IOCON2INV        /* 0xBF82A1DC */
  .extern PDC2             /* 0xBF82A1E0 */
  .extern PDC2CLR          /* 0xBF82A1E4 */
  .extern PDC2SET          /* 0xBF82A1E8 */
  .extern PDC2INV          /* 0xBF82A1EC */
  .extern SDC2             /* 0xBF82A1F0 */
  .extern SDC2CLR          /* 0xBF82A1F4 */
  .extern SDC2SET          /* 0xBF82A1F8 */
  .extern SDC2INV          /* 0xBF82A1FC */
  .extern PHASE2           /* 0xBF82A200 */
  .extern PHASE2CLR        /* 0xBF82A204 */
  .extern PHASE2SET        /* 0xBF82A208 */
  .extern PHASE2INV        /* 0xBF82A20C */
  .extern DTR2             /* 0xBF82A210 */
  .extern DTR2CLR          /* 0xBF82A214 */
  .extern DTR2SET          /* 0xBF82A218 */
  .extern DTR2INV          /* 0xBF82A21C */
  .extern ALTDTR2          /* 0xBF82A220 */
  .extern ALTDTR2CLR       /* 0xBF82A224 */
  .extern ALTDTR2SET       /* 0xBF82A228 */
  .extern ALTDTR2INV       /* 0xBF82A22C */
  .extern DTCOMP2          /* 0xBF82A230 */
  .extern DTCOMP2CLR       /* 0xBF82A234 */
  .extern DTCOMP2SET       /* 0xBF82A238 */
  .extern DTCOMP2INV       /* 0xBF82A23C */
  .extern TRIG2            /* 0xBF82A240 */
  .extern TRIG2CLR         /* 0xBF82A244 */
  .extern TRIG2SET         /* 0xBF82A248 */
  .extern TRIG2INV         /* 0xBF82A24C */
  .extern TRGCON2          /* 0xBF82A250 */
  .extern TRGCON2CLR       /* 0xBF82A254 */
  .extern TRGCON2SET       /* 0xBF82A258 */
  .extern TRGCON2INV       /* 0xBF82A25C */
  .extern STRIG2           /* 0xBF82A260 */
  .extern STRIG2CLR        /* 0xBF82A264 */
  .extern STRIG2SET        /* 0xBF82A268 */
  .extern STRIG2INV        /* 0xBF82A26C */
  .extern CAP2             /* 0xBF82A270 */
  .extern CAP2CLR          /* 0xBF82A274 */
  .extern CAP2SET          /* 0xBF82A278 */
  .extern CAP2INV          /* 0xBF82A27C */
  .extern LEBCON2          /* 0xBF82A280 */
  .extern LEBCON2CLR       /* 0xBF82A284 */
  .extern LEBCON2SET       /* 0xBF82A288 */
  .extern LEBCON2INV       /* 0xBF82A28C */
  .extern LEBDLY2          /* 0xBF82A290 */
  .extern LEBDLY2CLR       /* 0xBF82A294 */
  .extern LEBDLY2SET       /* 0xBF82A298 */
  .extern LEBDLY2INV       /* 0xBF82A29C */
  .extern AUXCON2          /* 0xBF82A2A0 */
  .extern AUXCON2CLR       /* 0xBF82A2A4 */
  .extern AUXCON2SET       /* 0xBF82A2A8 */
  .extern AUXCON2INV       /* 0xBF82A2AC */
  .extern PTMR2            /* 0xBF82A2B0 */
  .extern PTMR2CLR         /* 0xBF82A2B4 */
  .extern PTMR2SET         /* 0xBF82A2B8 */
  .extern PTMR2INV         /* 0xBF82A2BC */
  .extern PWMCON3          /* 0xBF82A2C0 */
  .extern PWMCON3CLR       /* 0xBF82A2C4 */
  .extern PWMCON3SET       /* 0xBF82A2C8 */
  .extern PWMCON3INV       /* 0xBF82A2CC */
  .extern IOCON3           /* 0xBF82A2D0 */
  .extern IOCON3CLR        /* 0xBF82A2D4 */
  .extern IOCON3SET        /* 0xBF82A2D8 */
  .extern IOCON3INV        /* 0xBF82A2DC */
  .extern PDC3             /* 0xBF82A2E0 */
  .extern PDC3CLR          /* 0xBF82A2E4 */
  .extern PDC3SET          /* 0xBF82A2E8 */
  .extern PDC3INV          /* 0xBF82A2EC */
  .extern SDC3             /* 0xBF82A2F0 */
  .extern SDC3CLR          /* 0xBF82A2F4 */
  .extern SDC3SET          /* 0xBF82A2F8 */
  .extern SDC3INV          /* 0xBF82A2FC */
  .extern PHASE3           /* 0xBF82A300 */
  .extern PHASE3CLR        /* 0xBF82A304 */
  .extern PHASE3SET        /* 0xBF82A308 */
  .extern PHASE3INV        /* 0xBF82A30C */
  .extern DTR3             /* 0xBF82A310 */
  .extern DTR3CLR          /* 0xBF82A314 */
  .extern DTR3SET          /* 0xBF82A318 */
  .extern DTR3INV          /* 0xBF82A31C */
  .extern ALTDTR3          /* 0xBF82A320 */
  .extern ALTDTR3CLR       /* 0xBF82A324 */
  .extern ALTDTR3SET       /* 0xBF82A328 */
  .extern ALTDTR3INV       /* 0xBF82A32C */
  .extern DTCOMP3          /* 0xBF82A330 */
  .extern DTCOMP3CLR       /* 0xBF82A334 */
  .extern DTCOMP3SET       /* 0xBF82A338 */
  .extern DTCOMP3INV       /* 0xBF82A33C */
  .extern TRIG3            /* 0xBF82A340 */
  .extern TRIG3CLR         /* 0xBF82A344 */
  .extern TRIG3SET         /* 0xBF82A348 */
  .extern TRIG3INV         /* 0xBF82A34C */
  .extern TRGCON3          /* 0xBF82A350 */
  .extern TRGCON3CLR       /* 0xBF82A354 */
  .extern TRGCON3SET       /* 0xBF82A358 */
  .extern TRGCON3INV       /* 0xBF82A35C */
  .extern STRIG3           /* 0xBF82A360 */
  .extern STRIG3CLR        /* 0xBF82A364 */
  .extern STRIG3SET        /* 0xBF82A368 */
  .extern STRIG3INV        /* 0xBF82A36C */
  .extern CAP3             /* 0xBF82A370 */
  .extern CAP3CLR          /* 0xBF82A374 */
  .extern CAP3SET          /* 0xBF82A378 */
  .extern CAP3INV          /* 0xBF82A37C */
  .extern LEBCON3          /* 0xBF82A380 */
  .extern LEBCON3CLR       /* 0xBF82A384 */
  .extern LEBCON3SET       /* 0xBF82A388 */
  .extern LEBCON3INV       /* 0xBF82A38C */
  .extern LEBDLY3          /* 0xBF82A390 */
  .extern LEBDLY3CLR       /* 0xBF82A394 */
  .extern LEBDLY3SET       /* 0xBF82A398 */
  .extern LEBDLY3INV       /* 0xBF82A39C */
  .extern AUXCON3          /* 0xBF82A3A0 */
  .extern AUXCON3CLR       /* 0xBF82A3A4 */
  .extern AUXCON3SET       /* 0xBF82A3A8 */
  .extern AUXCON3INV       /* 0xBF82A3AC */
  .extern PTMR3            /* 0xBF82A3B0 */
  .extern PTMR3CLR         /* 0xBF82A3B4 */
  .extern PTMR3SET         /* 0xBF82A3B8 */
  .extern PTMR3INV         /* 0xBF82A3BC */
  .extern PWMCON4          /* 0xBF82A3C0 */
  .extern PWMCON4CLR       /* 0xBF82A3C4 */
  .extern PWMCON4SET       /* 0xBF82A3C8 */
  .extern PWMCON4INV       /* 0xBF82A3CC */
  .extern IOCON4           /* 0xBF82A3D0 */
  .extern IOCON4CLR        /* 0xBF82A3D4 */
  .extern IOCON4SET        /* 0xBF82A3D8 */
  .extern IOCON4INV        /* 0xBF82A3DC */
  .extern PDC4             /* 0xBF82A3E0 */
  .extern PDC4CLR          /* 0xBF82A3E4 */
  .extern PDC4SET          /* 0xBF82A3E8 */
  .extern PDC4INV          /* 0xBF82A3EC */
  .extern SDC4             /* 0xBF82A3F0 */
  .extern SDC4CLR          /* 0xBF82A3F4 */
  .extern SDC4SET          /* 0xBF82A3F8 */
  .extern SDC4INV          /* 0xBF82A3FC */
  .extern PHASE4           /* 0xBF82A400 */
  .extern PHASE4CLR        /* 0xBF82A404 */
  .extern PHASE4SET        /* 0xBF82A408 */
  .extern PHASE4INV        /* 0xBF82A40C */
  .extern DTR4             /* 0xBF82A410 */
  .extern DTR4CLR          /* 0xBF82A414 */
  .extern DTR4SET          /* 0xBF82A418 */
  .extern DTR4INV          /* 0xBF82A41C */
  .extern ALTDTR4          /* 0xBF82A420 */
  .extern ALTDTR4CLR       /* 0xBF82A424 */
  .extern ALTDTR4SET       /* 0xBF82A428 */
  .extern ALTDTR4INV       /* 0xBF82A42C */
  .extern DTCOMP4          /* 0xBF82A430 */
  .extern DTCOMP4CLR       /* 0xBF82A434 */
  .extern DTCOMP4SET       /* 0xBF82A438 */
  .extern DTCOMP4INV       /* 0xBF82A43C */
  .extern TRIG4            /* 0xBF82A440 */
  .extern TRIG4CLR         /* 0xBF82A444 */
  .extern TRIG4SET         /* 0xBF82A448 */
  .extern TRIG4INV         /* 0xBF82A44C */
  .extern TRGCON4          /* 0xBF82A450 */
  .extern TRGCON4CLR       /* 0xBF82A454 */
  .extern TRGCON4SET       /* 0xBF82A458 */
  .extern TRGCON4INV       /* 0xBF82A45C */
  .extern STRIG4           /* 0xBF82A460 */
  .extern STRIG4CLR        /* 0xBF82A464 */
  .extern STRIG4SET        /* 0xBF82A468 */
  .extern STRIG4INV        /* 0xBF82A46C */
  .extern CAP4             /* 0xBF82A470 */
  .extern CAP4CLR          /* 0xBF82A474 */
  .extern CAP4SET          /* 0xBF82A478 */
  .extern CAP4INV          /* 0xBF82A47C */
  .extern LEBCON4          /* 0xBF82A480 */
  .extern LEBCON4CLR       /* 0xBF82A484 */
  .extern LEBCON4SET       /* 0xBF82A488 */
  .extern LEBCON4INV       /* 0xBF82A48C */
  .extern LEBDLY4          /* 0xBF82A490 */
  .extern LEBDLY4CLR       /* 0xBF82A494 */
  .extern LEBDLY4SET       /* 0xBF82A498 */
  .extern LEBDLY4INV       /* 0xBF82A49C */
  .extern AUXCON4          /* 0xBF82A4A0 */
  .extern AUXCON4CLR       /* 0xBF82A4A4 */
  .extern AUXCON4SET       /* 0xBF82A4A8 */
  .extern AUXCON4INV       /* 0xBF82A4AC */
  .extern PTMR4            /* 0xBF82A4B0 */
  .extern PTMR4CLR         /* 0xBF82A4B4 */
  .extern PTMR4SET         /* 0xBF82A4B8 */
  .extern PTMR4INV         /* 0xBF82A4BC */
  .extern PWMCON5          /* 0xBF82A4C0 */
  .extern PWMCON5CLR       /* 0xBF82A4C4 */
  .extern PWMCON5SET       /* 0xBF82A4C8 */
  .extern PWMCON5INV       /* 0xBF82A4CC */
  .extern IOCON5           /* 0xBF82A4D0 */
  .extern IOCON5CLR        /* 0xBF82A4D4 */
  .extern IOCON5SET        /* 0xBF82A4D8 */
  .extern IOCON5INV        /* 0xBF82A4DC */
  .extern PDC5             /* 0xBF82A4E0 */
  .extern PDC5CLR          /* 0xBF82A4E4 */
  .extern PDC5SET          /* 0xBF82A4E8 */
  .extern PDC5INV          /* 0xBF82A4EC */
  .extern SDC5             /* 0xBF82A4F0 */
  .extern SDC5CLR          /* 0xBF82A4F4 */
  .extern SDC5SET          /* 0xBF82A4F8 */
  .extern SDC5INV          /* 0xBF82A4FC */
  .extern PHASE5           /* 0xBF82A500 */
  .extern PHASE5CLR        /* 0xBF82A504 */
  .extern PHASE5SET        /* 0xBF82A508 */
  .extern PHASE5INV        /* 0xBF82A50C */
  .extern DTR5             /* 0xBF82A510 */
  .extern DTR5CLR          /* 0xBF82A514 */
  .extern DTR5SET          /* 0xBF82A518 */
  .extern DTR5INV          /* 0xBF82A51C */
  .extern ALTDTR5          /* 0xBF82A520 */
  .extern ALTDTR5CLR       /* 0xBF82A524 */
  .extern ALTDTR5SET       /* 0xBF82A528 */
  .extern ALTDTR5INV       /* 0xBF82A52C */
  .extern DTCOMP5          /* 0xBF82A530 */
  .extern DTCOMP5CLR       /* 0xBF82A534 */
  .extern DTCOMP5SET       /* 0xBF82A538 */
  .extern DTCOMP5INV       /* 0xBF82A53C */
  .extern TRIG5            /* 0xBF82A540 */
  .extern TRIG5CLR         /* 0xBF82A544 */
  .extern TRIG5SET         /* 0xBF82A548 */
  .extern TRIG5INV         /* 0xBF82A54C */
  .extern TRGCON5          /* 0xBF82A550 */
  .extern TRGCON5CLR       /* 0xBF82A554 */
  .extern TRGCON5SET       /* 0xBF82A558 */
  .extern TRGCON5INV       /* 0xBF82A55C */
  .extern STRIG5           /* 0xBF82A560 */
  .extern STRIG5CLR        /* 0xBF82A564 */
  .extern STRIG5SET        /* 0xBF82A568 */
  .extern STRIG5INV        /* 0xBF82A56C */
  .extern CAP5             /* 0xBF82A570 */
  .extern CAP5CLR          /* 0xBF82A574 */
  .extern CAP5SET          /* 0xBF82A578 */
  .extern CAP5INV          /* 0xBF82A57C */
  .extern LEBCON5          /* 0xBF82A580 */
  .extern LEBCON5CLR       /* 0xBF82A584 */
  .extern LEBCON5SET       /* 0xBF82A588 */
  .extern LEBCON5INV       /* 0xBF82A58C */
  .extern LEBDLY5          /* 0xBF82A590 */
  .extern LEBDLY5CLR       /* 0xBF82A594 */
  .extern LEBDLY5SET       /* 0xBF82A598 */
  .extern LEBDLY5INV       /* 0xBF82A59C */
  .extern AUXCON5          /* 0xBF82A5A0 */
  .extern AUXCON5CLR       /* 0xBF82A5A4 */
  .extern AUXCON5SET       /* 0xBF82A5A8 */
  .extern AUXCON5INV       /* 0xBF82A5AC */
  .extern PTMR5            /* 0xBF82A5B0 */
  .extern PTMR5CLR         /* 0xBF82A5B4 */
  .extern PTMR5SET         /* 0xBF82A5B8 */
  .extern PTMR5INV         /* 0xBF82A5BC */
  .extern PWMCON6          /* 0xBF82A5C0 */
  .extern PWMCON6CLR       /* 0xBF82A5C4 */
  .extern PWMCON6SET       /* 0xBF82A5C8 */
  .extern PWMCON6INV       /* 0xBF82A5CC */
  .extern IOCON6           /* 0xBF82A5D0 */
  .extern IOCON6CLR        /* 0xBF82A5D4 */
  .extern IOCON6SET        /* 0xBF82A5D8 */
  .extern IOCON6INV        /* 0xBF82A5DC */
  .extern PDC6             /* 0xBF82A5E0 */
  .extern PDC6CLR          /* 0xBF82A5E4 */
  .extern PDC6SET          /* 0xBF82A5E8 */
  .extern PDC6INV          /* 0xBF82A5EC */
  .extern SDC6             /* 0xBF82A5F0 */
  .extern SDC6CLR          /* 0xBF82A5F4 */
  .extern SDC6SET          /* 0xBF82A5F8 */
  .extern SDC6INV          /* 0xBF82A5FC */
  .extern PHASE6           /* 0xBF82A600 */
  .extern PHASE6CLR        /* 0xBF82A604 */
  .extern PHASE6SET        /* 0xBF82A608 */
  .extern PHASE6INV        /* 0xBF82A60C */
  .extern DTR6             /* 0xBF82A610 */
  .extern DTR6CLR          /* 0xBF82A614 */
  .extern DTR6SET          /* 0xBF82A618 */
  .extern DTR6INV          /* 0xBF82A61C */
  .extern ALTDTR6          /* 0xBF82A620 */
  .extern ALTDTR6CLR       /* 0xBF82A624 */
  .extern ALTDTR6SET       /* 0xBF82A628 */
  .extern ALTDTR6INV       /* 0xBF82A62C */
  .extern DTCOMP6          /* 0xBF82A630 */
  .extern DTCOMP6CLR       /* 0xBF82A634 */
  .extern DTCOMP6SET       /* 0xBF82A638 */
  .extern DTCOMP6INV       /* 0xBF82A63C */
  .extern TRIG6            /* 0xBF82A640 */
  .extern TRIG6CLR         /* 0xBF82A644 */
  .extern TRIG6SET         /* 0xBF82A648 */
  .extern TRIG6INV         /* 0xBF82A64C */
  .extern TRGCON6          /* 0xBF82A650 */
  .extern TRGCON6CLR       /* 0xBF82A654 */
  .extern TRGCON6SET       /* 0xBF82A658 */
  .extern TRGCON6INV       /* 0xBF82A65C */
  .extern STRIG6           /* 0xBF82A660 */
  .extern STRIG6CLR        /* 0xBF82A664 */
  .extern STRIG6SET        /* 0xBF82A668 */
  .extern STRIG6INV        /* 0xBF82A66C */
  .extern CAP6             /* 0xBF82A670 */
  .extern CAP6CLR          /* 0xBF82A674 */
  .extern CAP6SET          /* 0xBF82A678 */
  .extern CAP6INV          /* 0xBF82A67C */
  .extern LEBCON6          /* 0xBF82A680 */
  .extern LEBCON6CLR       /* 0xBF82A684 */
  .extern LEBCON6SET       /* 0xBF82A688 */
  .extern LEBCON6INV       /* 0xBF82A68C */
  .extern LEBDLY6          /* 0xBF82A690 */
  .extern LEBDLY6CLR       /* 0xBF82A694 */
  .extern LEBDLY6SET       /* 0xBF82A698 */
  .extern LEBDLY6INV       /* 0xBF82A69C */
  .extern AUXCON6          /* 0xBF82A6A0 */
  .extern AUXCON6CLR       /* 0xBF82A6A4 */
  .extern AUXCON6SET       /* 0xBF82A6A8 */
  .extern AUXCON6INV       /* 0xBF82A6AC */
  .extern PTMR6            /* 0xBF82A6B0 */
  .extern PTMR6CLR         /* 0xBF82A6B4 */
  .extern PTMR6SET         /* 0xBF82A6B8 */
  .extern PTMR6INV         /* 0xBF82A6BC */
  .extern PWMCON7          /* 0xBF82A6C0 */
  .extern PWMCON7CLR       /* 0xBF82A6C4 */
  .extern PWMCON7SET       /* 0xBF82A6C8 */
  .extern PWMCON7INV       /* 0xBF82A6CC */
  .extern IOCON7           /* 0xBF82A6D0 */
  .extern IOCON7CLR        /* 0xBF82A6D4 */
  .extern IOCON7SET        /* 0xBF82A6D8 */
  .extern IOCON7INV        /* 0xBF82A6DC */
  .extern PDC7             /* 0xBF82A6E0 */
  .extern PDC7CLR          /* 0xBF82A6E4 */
  .extern PDC7SET          /* 0xBF82A6E8 */
  .extern PDC7INV          /* 0xBF82A6EC */
  .extern SDC7             /* 0xBF82A6F0 */
  .extern SDC7CLR          /* 0xBF82A6F4 */
  .extern SDC7SET          /* 0xBF82A6F8 */
  .extern SDC7INV          /* 0xBF82A6FC */
  .extern PHASE7           /* 0xBF82A700 */
  .extern PHASE7CLR        /* 0xBF82A704 */
  .extern PHASE7SET        /* 0xBF82A708 */
  .extern PHASE7INV        /* 0xBF82A70C */
  .extern DTR7             /* 0xBF82A710 */
  .extern DTR7CLR          /* 0xBF82A714 */
  .extern DTR7SET          /* 0xBF82A718 */
  .extern DTR7INV          /* 0xBF82A71C */
  .extern ALTDTR7          /* 0xBF82A720 */
  .extern ALTDTR7CLR       /* 0xBF82A724 */
  .extern ALTDTR7SET       /* 0xBF82A728 */
  .extern ALTDTR7INV       /* 0xBF82A72C */
  .extern DTCOMP7          /* 0xBF82A730 */
  .extern DTCOMP7CLR       /* 0xBF82A734 */
  .extern DTCOMP7SET       /* 0xBF82A738 */
  .extern DTCOMP7INV       /* 0xBF82A73C */
  .extern TRIG7            /* 0xBF82A740 */
  .extern TRIG7CLR         /* 0xBF82A744 */
  .extern TRIG7SET         /* 0xBF82A748 */
  .extern TRIG7INV         /* 0xBF82A74C */
  .extern TRGCON7          /* 0xBF82A750 */
  .extern TRGCON7CLR       /* 0xBF82A754 */
  .extern TRGCON7SET       /* 0xBF82A758 */
  .extern TRGCON7INV       /* 0xBF82A75C */
  .extern STRIG7           /* 0xBF82A760 */
  .extern STRIG7CLR        /* 0xBF82A764 */
  .extern STRIG7SET        /* 0xBF82A768 */
  .extern STRIG7INV        /* 0xBF82A76C */
  .extern CAP7             /* 0xBF82A770 */
  .extern CAP7CLR          /* 0xBF82A774 */
  .extern CAP7SET          /* 0xBF82A778 */
  .extern CAP7INV          /* 0xBF82A77C */
  .extern LEBCON7          /* 0xBF82A780 */
  .extern LEBCON7CLR       /* 0xBF82A784 */
  .extern LEBCON7SET       /* 0xBF82A788 */
  .extern LEBCON7INV       /* 0xBF82A78C */
  .extern LEBDLY7          /* 0xBF82A790 */
  .extern LEBDLY7CLR       /* 0xBF82A794 */
  .extern LEBDLY7SET       /* 0xBF82A798 */
  .extern LEBDLY7INV       /* 0xBF82A79C */
  .extern AUXCON7          /* 0xBF82A7A0 */
  .extern AUXCON7CLR       /* 0xBF82A7A4 */
  .extern AUXCON7SET       /* 0xBF82A7A8 */
  .extern AUXCON7INV       /* 0xBF82A7AC */
  .extern PTMR7            /* 0xBF82A7B0 */
  .extern PTMR7CLR         /* 0xBF82A7B4 */
  .extern PTMR7SET         /* 0xBF82A7B8 */
  .extern PTMR7INV         /* 0xBF82A7BC */
  .extern PWMCON8          /* 0xBF82A7C0 */
  .extern PWMCON8CLR       /* 0xBF82A7C4 */
  .extern PWMCON8SET       /* 0xBF82A7C8 */
  .extern PWMCON8INV       /* 0xBF82A7CC */
  .extern IOCON8           /* 0xBF82A7D0 */
  .extern IOCON8CLR        /* 0xBF82A7D4 */
  .extern IOCON8SET        /* 0xBF82A7D8 */
  .extern IOCON8INV        /* 0xBF82A7DC */
  .extern PDC8             /* 0xBF82A7E0 */
  .extern PDC8CLR          /* 0xBF82A7E4 */
  .extern PDC8SET          /* 0xBF82A7E8 */
  .extern PDC8INV          /* 0xBF82A7EC */
  .extern SDC8             /* 0xBF82A7F0 */
  .extern SDC8CLR          /* 0xBF82A7F4 */
  .extern SDC8SET          /* 0xBF82A7F8 */
  .extern SDC8INV          /* 0xBF82A7FC */
