CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
  .extern CNCONFCLR        /* 0xBF860574 */
  .extern CNCONFSET        /* 0xBF860578 */
  .extern CNCONFINV        /* 0xBF86057C */
  .extern CNENF            /* 0xBF860580 */
  .extern CNENFCLR         /* 0xBF860584 */
  .extern CNENFSET         /* 0xBF860588 */
  .extern CNENFINV         /* 0xBF86058C */
  .extern CNSTATF          /* 0xBF860590 */
  .extern CNSTATFCLR       /* 0xBF860594 */
  .extern CNSTATFSET       /* 0xBF860598 */
  .extern CNSTATFINV       /* 0xBF86059C */
  .extern CNNEF            /* 0xBF8605A0 */
  .extern CNNEFCLR         /* 0xBF8605A4 */
  .extern CNNEFSET         /* 0xBF8605A8 */
  .extern CNNEFINV         /* 0xBF8605AC */
  .extern CNFF             /* 0xBF8605B0 */
  .extern CNFFCLR          /* 0xBF8605B4 */
  .extern CNFFSET          /* 0xBF8605B8 */
  .extern CNFFINV          /* 0xBF8605BC */
  .extern SRCON0F          /* 0xBF8605C0 */
  .extern SRCON0FCLR       /* 0xBF8605C4 */
  .extern SRCON0FSET       /* 0xBF8605C8 */
  .extern SRCON0FINV       /* 0xBF8605CC */
  .extern SRCON1F          /* 0xBF8605D0 */
  .extern SRCON1FCLR       /* 0xBF8605D4 */
  .extern SRCON1FSET       /* 0xBF8605D8 */
  .extern SRCON1FINV       /* 0xBF8605DC */
  .extern ANSELG           /* 0xBF860600 */
  .extern ANSELGCLR        /* 0xBF860604 */
  .extern ANSELGSET        /* 0xBF860608 */
  .extern ANSELGINV        /* 0xBF86060C */
  .extern TRISG            /* 0xBF860610 */
  .extern TRISGCLR         /* 0xBF860614 */
  .extern TRISGSET         /* 0xBF860618 */
  .extern TRISGINV         /* 0xBF86061C */
  .extern PORTG            /* 0xBF860620 */
  .extern PORTGCLR         /* 0xBF860624 */
  .extern PORTGSET         /* 0xBF860628 */
  .extern PORTGINV         /* 0xBF86062C */
  .extern LATG             /* 0xBF860630 */
  .extern LATGCLR          /* 0xBF860634 */
  .extern LATGSET          /* 0xBF860638 */
  .extern LATGINV          /* 0xBF86063C */
  .extern ODCG             /* 0xBF860640 */
  .extern ODCGCLR          /* 0xBF860644 */
  .extern ODCGSET          /* 0xBF860648 */
  .extern ODCGINV          /* 0xBF86064C */
  .extern CNPUG            /* 0xBF860650 */
  .extern CNPUGCLR         /* 0xBF860654 */
  .extern CNPUGSET         /* 0xBF860658 */
  .extern CNPUGINV         /* 0xBF86065C */
  .extern CNPDG            /* 0xBF860660 */
  .extern CNPDGCLR         /* 0xBF860664 */
  .extern CNPDGSET         /* 0xBF860668 */
  .extern CNPDGINV         /* 0xBF86066C */
  .extern CNCONG           /* 0xBF860670 */
  .extern CNCONGCLR        /* 0xBF860674 */
  .extern CNCONGSET        /* 0xBF860678 */
  .extern CNCONGINV        /* 0xBF86067C */
  .extern CNENG            /* 0xBF860680 */
  .extern CNENGCLR         /* 0xBF860684 */
  .extern CNENGSET         /* 0xBF860688 */
  .extern CNENGINV         /* 0xBF86068C */
  .extern CNSTATG          /* 0xBF860690 */
  .extern CNSTATGCLR       /* 0xBF860694 */
  .extern CNSTATGSET       /* 0xBF860698 */
  .extern CNSTATGINV       /* 0xBF86069C */
  .extern CNNEG            /* 0xBF8606A0 */
  .extern CNNEGCLR         /* 0xBF8606A4 */
  .extern CNNEGSET         /* 0xBF8606A8 */
  .extern CNNEGINV         /* 0xBF8606AC */
  .extern CNFG             /* 0xBF8606B0 */
  .extern CNFGCLR          /* 0xBF8606B4 */
  .extern CNFGSET          /* 0xBF8606B8 */
  .extern CNFGINV          /* 0xBF8606BC */
  .extern SRCON0G          /* 0xBF8606C0 */
  .extern SRCON0GCLR       /* 0xBF8606C4 */
  .extern SRCON0GSET       /* 0xBF8606C8 */
  .extern SRCON0GINV       /* 0xBF8606CC */
  .extern SRCON1G          /* 0xBF8606D0 */
  .extern SRCON1GCLR       /* 0xBF8606D4 */
  .extern SRCON1GSET       /* 0xBF8606D8 */
  .extern SRCON1GINV       /* 0xBF8606DC */
  .extern C1CON            /* 0xBF880000 */
  .extern C1NBTCFG         /* 0xBF880004 */
  .extern C1DBTCFG         /* 0xBF880008 */
  .extern C1TDC            /* 0xBF88000C */
  .extern C1TBC            /* 0xBF880010 */
  .extern C1TSCON          /* 0xBF880014 */
  .extern C1VEC            /* 0xBF880018 */
  .extern C1INT            /* 0xBF88001C */
  .extern C1RXIF           /* 0xBF880020 */
  .extern C1TXIF           /* 0xBF880024 */
  .extern C1RXOVIF         /* 0xBF880028 */
  .extern C1TXATIF         /* 0xBF88002C */
  .extern C1TXREQ          /* 0xBF880030 */
  .extern C1TREC           /* 0xBF880034 */
  .extern C1BDIAG0         /* 0xBF880038 */
  .extern C1BDIAG1         /* 0xBF88003C */
  .extern C1TEFCON         /* 0xBF880040 */
  .extern C1TEFSTA         /* 0xBF880044 */
  .extern C1TEFUA          /* 0xBF880048 */
  .extern C1FIFOBA         /* 0xBF88004C */
  .extern C1TXQCON         /* 0xBF880050 */
  .extern C1TXQSTA         /* 0xBF880054 */
  .extern C1TXQUA          /* 0xBF880058 */
  .extern C1FIFOCON1       /* 0xBF88005C */
  .extern C1FIFOSTA1       /* 0xBF880060 */
  .extern C1FIFOUA1        /* 0xBF880064 */
  .extern C1FIFOCON2       /* 0xBF880068 */
  .extern C1FIFOSTA2       /* 0xBF88006C */
  .extern C1FIFOUA2        /* 0xBF880070 */
  .extern C1FIFOCON3       /* 0xBF880074 */
  .extern C1FIFOSTA3       /* 0xBF880078 */
  .extern C1FIFOUA3        /* 0xBF88007C */
  .extern C1FIFOCON4       /* 0xBF880080 */
  .extern C1FIFOSTA4       /* 0xBF880084 */
  .extern C1FIFOUA4        /* 0xBF880088 */
  .extern C1FIFOCON5       /* 0xBF88008C */
  .extern C1FIFOSTA5       /* 0xBF880090 */
  .extern C1FIFOUA5        /* 0xBF880094 */
  .extern C1FIFOCON6       /* 0xBF880098 */
  .extern C1FIFOSTA6       /* 0xBF88009C */
  .extern C1FIFOUA6        /* 0xBF8800A0 */
  .extern C1FIFOCON7       /* 0xBF8800A4 */
  .extern C1FIFOSTA7       /* 0xBF8800A8 */
  .extern C1FIFOUA7        /* 0xBF8800AC */
  .extern C1FIFOCON8       /* 0xBF8800B0 */
  .extern C1FIFOSTA8       /* 0xBF8800B4 */
  .extern C1FIFOUA8        /* 0xBF8800B8 */
  .extern C1FIFOCON9       /* 0xBF8800BC */
  .extern C1FIFOSTA9       /* 0xBF8800C0 */
  .extern C1FIFOUA9        /* 0xBF8800C4 */
  .extern C1FIFOCON10      /* 0xBF8800C8 */
  .extern C1FIFOSTA10      /* 0xBF8800CC */
  .extern C1FIFOUA10       /* 0xBF8800D0 */
  .extern C1FIFOCON11      /* 0xBF8800D4 */
  .extern C1FIFOSTA11      /* 0xBF8800D8 */
  .extern C1FIFOUA11       /* 0xBF8800DC */
  .extern C1FIFOCON12      /* 0xBF8800E0 */
  .extern C1FIFOSTA12      /* 0xBF8800E4 */
  .extern C1FIFOUA12       /* 0xBF8800E8 */
  .extern C1FIFOCON13      /* 0xBF8800EC */
  .extern C1FIFOSTA13      /* 0xBF8800F0 */
  .extern C1FIFOUA13       /* 0xBF8800F4 */
  .extern C1FIFOCON14      /* 0xBF8800F8 */
  .extern C1FIFOSTA14      /* 0xBF8800FC */
  .extern C1FIFOUA14       /* 0xBF880100 */
  .extern C1FIFOCON15      /* 0xBF880104 */
  .extern C1FIFOSTA15      /* 0xBF880108 */
  .extern C1FIFOUA15       /* 0xBF88010C */
  .extern C1FIFOCON16      /* 0xBF880110 */
  .extern C1FIFOSTA16      /* 0xBF880114 */
  .extern C1FIFOUA16       /* 0xBF880118 */
  .extern C1FIFOCON17      /* 0xBF88011C */
  .extern C1FIFOSTA17      /* 0xBF880120 */
  .extern C1FIFOUA17       /* 0xBF880124 */
  .extern C1FIFOCON18      /* 0xBF880128 */
  .extern C1FIFOSTA18      /* 0xBF88012C */
  .extern C1FIFOUA18       /* 0xBF880130 */
  .extern C1FIFOCON19      /* 0xBF880134 */
  .extern C1FIFOSTA19      /* 0xBF880138 */
  .extern C1FIFOUA19       /* 0xBF88013C */
  .extern C1FIFOCON20      /* 0xBF880140 */
  .extern C1FIFOSTA20      /* 0xBF880144 */
  .extern C1FIFOUA20       /* 0xBF880148 */
  .extern C1FIFOCON21      /* 0xBF88014C */
  .extern C1FIFOSTA21      /* 0xBF880150 */
  .extern C1FIFOUA21       /* 0xBF880154 */
  .extern C1FIFOCON22      /* 0xBF880158 */
  .extern C1FIFOSTA22      /* 0xBF88015C */
  .extern C1FIFOUA22       /* 0xBF880160 */
  .extern C1FIFOCON23      /* 0xBF880164 */
  .extern C1FIFOSTA23      /* 0xBF880168 */
  .extern C1FIFOUA23       /* 0xBF88016C */
  .extern C1FIFOCON24      /* 0xBF880170 */
  .extern C1FIFOSTA24      /* 0xBF880174 */
  .extern C1FIFOUA24       /* 0xBF880178 */
  .extern C1FIFOCON25      /* 0xBF88017C */
  .extern C1FIFOSTA25      /* 0xBF880180 */
  .extern C1FIFOUA25       /* 0xBF880184 */
  .extern C1FIFOCON26      /* 0xBF880188 */
  .extern C1FIFOSTA26      /* 0xBF88018C */
  .extern C1FIFOUA26       /* 0xBF880190 */
  .extern C1FIFOCON27      /* 0xBF880194 */
  .extern C1FIFOSTA27      /* 0xBF880198 */
  .extern C1FIFOUA27       /* 0xBF88019C */
  .extern C1FIFOCON28      /* 0xBF8801A0 */
  .extern C1FIFOSTA28      /* 0xBF8801A4 */
  .extern C1FIFOUA28       /* 0xBF8801A8 */
  .extern C1FIFOCON29      /* 0xBF8801AC */
  .extern C1FIFOSTA29      /* 0xBF8801B0 */
  .extern C1FIFOUA29       /* 0xBF8801B4 */
  .extern C1FIFOCON30      /* 0xBF8801B8 */
  .extern C1FIFOSTA30      /* 0xBF8801BC */
  .extern C1FIFOUA30       /* 0xBF8801C0 */
  .extern C1FIFOCON31      /* 0xBF8801C4 */
  .extern C1FIFOSTA31      /* 0xBF8801C8 */
  .extern C1FIFOUA31       /* 0xBF8801CC */
  .extern C1FLTCON0        /* 0xBF8801D0 */
  .extern C1FLTCON1        /* 0xBF8801D4 */
  .extern C1FLTCON2        /* 0xBF8801D8 */
  .extern C1FLTCON3        /* 0xBF8801DC */
  .extern C1FLTCON4        /* 0xBF8801E0 */
  .extern C1FLTCON5        /* 0xBF8801E4 */
  .extern C1FLTCON6        /* 0xBF8801E8 */
  .extern C1FLTCON7        /* 0xBF8801EC */
  .extern C1FLTOBJ0        /* 0xBF8801F0 */
  .extern C1MASK0          /* 0xBF8801F4 */
  .extern C1FLTOBJ1        /* 0xBF8801F8 */
  .extern C1MASK1          /* 0xBF8801FC */
  .extern C1FLTOBJ2        /* 0xBF880200 */
  .extern C1MASK2          /* 0xBF880204 */
  .extern C1FLTOBJ3        /* 0xBF880208 */
  .extern C1MASK3          /* 0xBF88020C */
  .extern C1FLTOBJ4        /* 0xBF880210 */
  .extern C1MASK4          /* 0xBF880214 */
  .extern C1FLTOBJ5        /* 0xBF880218 */
  .extern C1MASK5          /* 0xBF88021C */
  .extern C1FLTOBJ6        /* 0xBF880220 */
  .extern C1MASK6          /* 0xBF880224 */
  .extern C1FLTOBJ7        /* 0xBF880228 */
  .extern C1MASK7          /* 0xBF88022C */
  .extern C1FLTOBJ8        /* 0xBF880230 */
  .extern C1MASK8          /* 0xBF880234 */
  .extern C1FLTOBJ9        /* 0xBF880238 */
  .extern C1MASK9          /* 0xBF88023C */
  .extern C1FLTOBJ10       /* 0xBF880240 */
  .extern C1MASK10         /* 0xBF880244 */
  .extern C1FLTOBJ11       /* 0xBF880248 */
  .extern C1MASK11         /* 0xBF88024C */
  .extern C1FLTOBJ12       /* 0xBF880250 */
  .extern C1MASK12         /* 0xBF880254 */
  .extern C1FLTOBJ13       /* 0xBF880258 */
  .extern C1MASK13         /* 0xBF88025C */
  .extern C1FLTOBJ14       /* 0xBF880260 */
  .extern C1MASK14         /* 0xBF880264 */
  .extern C1FLTOBJ15       /* 0xBF880268 */
  .extern C1MASK15         /* 0xBF88026C */
  .extern C1FLTOBJ16       /* 0xBF880270 */
  .extern C1MASK16         /* 0xBF880274 */
  .extern C1FLTOBJ17       /* 0xBF880278 */
  .extern C1MASK17         /* 0xBF88027C */
  .extern C1FLTOBJ18       /* 0xBF880280 */
  .extern C1MASK18         /* 0xBF880284 */
  .extern C1FLTOBJ19       /* 0xBF880288 */
  .extern C1MASK19         /* 0xBF88028C */
  .extern C1FLTOBJ20       /* 0xBF880290 */
  .extern C1MASK20         /* 0xBF880294 */
  .extern C1FLTOBJ21       /* 0xBF880298 */
  .extern C1MASK21         /* 0xBF88029C */
  .extern C1FLTOBJ22       /* 0xBF8802A0 */
  .extern C1MASK22         /* 0xBF8802A4 */
  .extern C1FLTOBJ23       /* 0xBF8802A8 */
  .extern C1MASK23         /* 0xBF8802AC */
  .extern C1FLTOBJ24       /* 0xBF8802B0 */
  .extern C1MASK24         /* 0xBF8802B4 */
  .extern C1FLTOBJ25       /* 0xBF8802B8 */
  .extern C1MASK25         /* 0xBF8802BC */
  .extern C1FLTOBJ26       /* 0xBF8802C0 */
  .extern C1MASK26         /* 0xBF8802C4 */
  .extern C1FLTOBJ27       /* 0xBF8802C8 */
  .extern C1MASK27         /* 0xBF8802CC */
  .extern C1FLTOBJ28       /* 0xBF8802D0 */
  .extern C1MASK28         /* 0xBF8802D4 */
  .extern C1FLTOBJ29       /* 0xBF8802D8 */
  .extern C1MASK29         /* 0xBF8802DC */
  .extern C1FLTOBJ30       /* 0xBF8802E0 */
  .extern C1MASK30         /* 0xBF8802E4 */
  .extern C1FLTOBJ31       /* 0xBF8802E8 */
  .extern C1MASK31         /* 0xBF8802EC */
  .extern ADCCON1          /* 0xBF887000 */
  .extern ADCCON1CLR       /* 0xBF887004 */
  .extern ADCCON1SET       /* 0xBF887008 */
  .extern ADCCON1INV       /* 0xBF88700C */
  .extern ADCCON2          /* 0xBF887010 */
  .extern ADCCON2CLR       /* 0xBF887014 */
  .extern ADCCON2SET       /* 0xBF887018 */
  .extern ADCCON2INV       /* 0xBF88701C */
  .extern ADCCON3          /* 0xBF887020 */
  .extern ADCCON3CLR       /* 0xBF887024 */
  .extern ADCCON3SET       /* 0xBF887028 */
  .extern ADCCON3INV       /* 0xBF88702C */
  .extern ADCTRGMODE       /* 0xBF887030 */
  .extern ADCTRGMODECLR    /* 0xBF887034 */
  .extern ADCTRGMODESET    /* 0xBF887038 */
  .extern ADCTRGMODEINV    /* 0xBF88703C */
  .extern ADCIMCON1        /* 0xBF887040 */
  .extern ADCIMCON1CLR     /* 0xBF887044 */
  .extern ADCIMCON1SET     /* 0xBF887048 */
  .extern ADCIMCON1INV     /* 0xBF88704C */
  .extern ADCIMCON2        /* 0xBF887050 */
  .extern ADCIMCON2CLR     /* 0xBF887054 */
  .extern ADCIMCON2SET     /* 0xBF887058 */
  .extern ADCIMCON2INV     /* 0xBF88705C */
  .extern ADCIMCON3        /* 0xBF887060 */
  .extern ADCIMCON3CLR     /* 0xBF887064 */
  .extern ADCIMCON3SET     /* 0xBF887068 */
  .extern ADCIMCON3INV     /* 0xBF88706C */
  .extern ADCIMCON4        /* 0xBF887070 */
  .extern ADCIMCON4CLR     /* 0xBF887074 */
  .extern ADCIMCON4SET     /* 0xBF887078 */
  .extern ADCIMCON4INV     /* 0xBF88707C */
  .extern ADCGIRQEN1       /* 0xBF887080 */
  .extern ADCGIRQEN1CLR    /* 0xBF887084 */
  .extern ADCGIRQEN1SET    /* 0xBF887088 */
  .extern ADCGIRQEN1INV    /* 0xBF88708C */
  .extern ADCGIRQEN2       /* 0xBF887090 */
  .extern ADCGIRQEN2CLR    /* 0xBF887094 */
  .extern ADCGIRQEN2SET    /* 0xBF887098 */
  .extern ADCGIRQEN2INV    /* 0xBF88709C */
  .extern ADCCSS1          /* 0xBF8870A0 */
  .extern ADCCSS1CLR       /* 0xBF8870A4 */
  .extern ADCCSS1SET       /* 0xBF8870A8 */
  .extern ADCCSS1INV       /* 0xBF8870AC */
  .extern ADCCSS2          /* 0xBF8870B0 */
  .extern ADCCSS2CLR       /* 0xBF8870B4 */
  .extern ADCCSS2SET       /* 0xBF8870B8 */
  .extern ADCCSS2INV       /* 0xBF8870BC */
  .extern ADCDSTAT1        /* 0xBF8870C0 */
  .extern ADCDSTAT1CLR     /* 0xBF8870C4 */
  .extern ADCDSTAT1SET     /* 0xBF8870C8 */
  .extern ADCDSTAT1INV     /* 0xBF8870CC */
  .extern ADCDSTAT2        /* 0xBF8870D0 */
  .extern ADCDSTAT2CLR     /* 0xBF8870D4 */
  .extern ADCDSTAT2SET     /* 0xBF8870D8 */
  .extern ADCDSTAT2INV     /* 0xBF8870DC */
  .extern ADCCMPEN1        /* 0xBF8870E0 */
  .extern ADCCMPEN1CLR     /* 0xBF8870E4 */
  .extern ADCCMPEN1SET     /* 0xBF8870E8 */
  .extern ADCCMPEN1INV     /* 0xBF8870EC */
  .extern ADCCMP1          /* 0xBF8870F0 */
  .extern ADCCMP1CLR       /* 0xBF8870F4 */
  .extern ADCCMP1SET       /* 0xBF8870F8 */
  .extern ADCCMP1INV       /* 0xBF8870FC */
  .extern ADCCMPEN2        /* 0xBF887100 */
  .extern ADCCMPEN2CLR     /* 0xBF887104 */
  .extern ADCCMPEN2SET     /* 0xBF887108 */
  .extern ADCCMPEN2INV     /* 0xBF88710C */
  .extern ADCCMP2          /* 0xBF887110 */
  .extern ADCCMP2CLR       /* 0xBF887114 */
  .extern ADCCMP2SET       /* 0xBF887118 */
  .extern ADCCMP2INV       /* 0xBF88711C */
  .extern ADCCMPEN3        /* 0xBF887120 */
  .extern ADCCMPEN3CLR     /* 0xBF887124 */
  .extern ADCCMPEN3SET     /* 0xBF887128 */
  .extern ADCCMPEN3INV     /* 0xBF88712C */
  .extern ADCCMP3          /* 0xBF887130 */
  .extern ADCCMP3CLR       /* 0xBF887134 */
  .extern ADCCMP3SET       /* 0xBF887138 */
  .extern ADCCMP3INV       /* 0xBF88713C */
  .extern ADCCMPEN4        /* 0xBF887140 */
  .extern ADCCMPEN4CLR     /* 0xBF887144 */
  .extern ADCCMPEN4SET     /* 0xBF887148 */
  .extern ADCCMPEN4INV     /* 0xBF88714C */
  .extern ADCCMP4          /* 0xBF887150 */
  .extern ADCCMP4CLR       /* 0xBF887154 */
  .extern ADCCMP4SET       /* 0xBF887158 */
  .extern ADCCMP4INV       /* 0xBF88715C */
  .extern ADCFLTR1         /* 0xBF8871A0 */
  .extern ADCFLTR1CLR      /* 0xBF8871A4 */
  .extern ADCFLTR1SET      /* 0xBF8871A8 */
  .extern ADCFLTR1INV      /* 0xBF8871AC */
  .extern ADCFLTR2         /* 0xBF8871B0 */
  .extern ADCFLTR2CLR      /* 0xBF8871B4 */
  .extern ADCFLTR2SET      /* 0xBF8871B8 */
  .extern ADCFLTR2INV      /* 0xBF8871BC */
  .extern ADCFLTR3         /* 0xBF8871C0 */
  .extern ADCFLTR3CLR      /* 0xBF8871C4 */
  .extern ADCFLTR3SET      /* 0xBF8871C8 */
  .extern ADCFLTR3INV      /* 0xBF8871CC */
  .extern ADCFLTR4         /* 0xBF8871D0 */
  .extern ADCFLTR4CLR      /* 0xBF8871D4 */
  .extern ADCFLTR4SET      /* 0xBF8871D8 */
  .extern ADCFLTR4INV      /* 0xBF8871DC */
  .extern ADCTRG1          /* 0xBF887200 */
  .extern ADCTRG1CLR       /* 0xBF887204 */
  .extern ADCTRG1SET       /* 0xBF887208 */
  .extern ADCTRG1INV       /* 0xBF88720C */
  .extern ADCTRG2          /* 0xBF887210 */
  .extern ADCTRG2CLR       /* 0xBF887214 */
  .extern ADCTRG2SET       /* 0xBF887218 */
  .extern ADCTRG2INV       /* 0xBF88721C */
  .extern ADCTRG3          /* 0xBF887220 */
  .extern ADCTRG3CLR       /* 0xBF887224 */
  .extern ADCTRG3SET       /* 0xBF887228 */
  .extern ADCTRG3INV       /* 0xBF88722C */
  .extern ADCTRG4          /* 0xBF887230 */
  .extern ADCTRG4CLR       /* 0xBF887234 */
  .extern ADCTRG4SET       /* 0xBF887238 */
  .extern ADCTRG4INV       /* 0xBF88723C */
  .extern ADCTRG5          /* 0xBF887240 */
  .extern ADCTRG5CLR       /* 0xBF887244 */
  .extern ADCTRG5SET       /* 0xBF887248 */
  .extern ADCTRG5INV       /* 0xBF88724C */
  .extern ADCTRG7          /* 0xBF887260 */
  .extern ADCTRG7CLR       /* 0xBF887264 */
  .extern ADCTRG7SET       /* 0xBF887268 */
  .extern ADCTRG7INV       /* 0xBF88726C */
  .extern ADCCMPCON1       /* 0xBF887280 */
  .extern ADCCMPCON1CLR    /* 0xBF887284 */
  .extern ADCCMPCON1SET    /* 0xBF887288 */
  .extern ADCCMPCON1INV    /* 0xBF88728C */
  .extern ADCCMPCON2       /* 0xBF887290 */
  .extern ADCCMPCON2CLR    /* 0xBF887294 */
  .extern ADCCMPCON2SET    /* 0xBF887298 */
  .extern ADCCMPCON2INV    /* 0xBF88729C */
  .extern ADCCMPCON3       /* 0xBF8872A0 */
  .extern ADCCMPCON3CLR    /* 0xBF8872A4 */
  .extern ADCCMPCON3SET    /* 0xBF8872A8 */
  .extern ADCCMPCON3INV    /* 0xBF8872AC */
  .extern ADCCMPCON4       /* 0xBF8872B0 */
  .extern ADCCMPCON4CLR    /* 0xBF8872B4 */
  .extern ADCCMPCON4SET    /* 0xBF8872B8 */
  .extern ADCCMPCON4INV    /* 0xBF8872BC */
  .extern ADCBASE          /* 0xBF887300 */
  .extern ADCBASECLR       /* 0xBF887304 */
  .extern ADCBASESET       /* 0xBF887308 */
  .extern ADCBASEINV       /* 0xBF88730C */
  .extern ADCDSTAT         /* 0xBF887310 */
  .extern ADCDSTATCLR      /* 0xBF887314 */
  .extern ADCDSTATSET      /* 0xBF887318 */
  .extern ADCDSTATINV      /* 0xBF88731C */
  .extern ADCCNTB          /* 0xBF887320 */
  .extern ADCCNTBCLR       /* 0xBF887324 */
  .extern ADCCNTBSET       /* 0xBF887328 */
  .extern ADCCNTBINV       /* 0xBF88732C */
  .extern ADCDMAB          /* 0xBF887330 */
  .extern ADCDMABCLR       /* 0xBF887334 */
  .extern ADCDMABSET       /* 0xBF887338 */
  .extern ADCDMABINV       /* 0xBF88733C */
  .extern ADCTRGSNS        /* 0xBF887340 */
  .extern ADCTRGSNSCLR     /* 0xBF887344 */
  .extern ADCTRGSNSSET     /* 0xBF887348 */
  .extern ADCTRGSNSINV     /* 0xBF88734C */
  .extern ADC0TIME         /* 0xBF887350 */
  .extern ADC0TIMECLR      /* 0xBF887354 */
  .extern ADC0TIMESET      /* 0xBF887358 */
  .extern ADC0TIMEINV      /* 0xBF88735C */
  .extern ADC1TIME         /* 0xBF887360 */
  .extern ADC1TIMECLR      /* 0xBF887364 */
  .extern ADC1TIMESET      /* 0xBF887368 */
  .extern ADC1TIMEINV      /* 0xBF88736C */
  .extern ADC2TIME         /* 0xBF887370 */
  .extern ADC2TIMECLR      /* 0xBF887374 */
  .extern ADC2TIMESET      /* 0xBF887378 */
  .extern ADC2TIMEINV      /* 0xBF88737C */
  .extern ADC3TIME         /* 0xBF887380 */
  .extern ADC3TIMECLR      /* 0xBF887384 */
  .extern ADC3TIMESET      /* 0xBF887388 */
  .extern ADC3TIMEINV      /* 0xBF88738C */
  .extern ADC4TIME         /* 0xBF887390 */
  .extern ADC4TIMECLR      /* 0xBF887394 */
  .extern ADC4TIMESET      /* 0xBF887398 */
  .extern ADC4TIMEINV      /* 0xBF88739C */
  .extern ADCEIEN1         /* 0xBF8873C0 */
  .extern ADCEIEN1CLR      /* 0xBF8873C4 */
  .extern ADCEIEN1SET      /* 0xBF8873C8 */
  .extern ADCEIEN1INV      /* 0xBF8873CC */
  .extern ADCEIEN2         /* 0xBF8873D0 */
  .extern ADCEIEN2CLR      /* 0xBF8873D4 */
  .extern ADCEIEN2SET      /* 0xBF8873D8 */
  .extern ADCEIEN2INV      /* 0xBF8873DC */
  .extern ADCEISTAT1       /* 0xBF8873E0 */
  .extern ADCEISTAT1CLR    /* 0xBF8873E4 */
  .extern ADCEISTAT1SET    /* 0xBF8873E8 */
  .extern ADCEISTAT1INV    /* 0xBF8873EC */
  .extern ADCEISTAT2       /* 0xBF8873F0 */
  .extern ADCEISTAT2CLR    /* 0xBF8873F4 */
  .extern ADCEISTAT2SET    /* 0xBF8873F8 */
  .extern ADCEISTAT2INV    /* 0xBF8873FC */
  .extern ADCANCON         /* 0xBF887400 */
  .extern ADCANCONCLR      /* 0xBF887404 */
  .extern ADCANCONSET      /* 0xBF887408 */
  .extern ADCANCONINV      /* 0xBF88740C */
  .extern ADCDATA0         /* 0xBF887600 */
  .extern ADCDATA0CLR      /* 0xBF887604 */
  .extern ADCDATA0SET      /* 0xBF887608 */
  .extern ADCDATA0INV      /* 0xBF88760C */
  .extern ADCDATA1         /* 0xBF887610 */
  .extern ADCDATA1CLR      /* 0xBF887614 */
  .extern ADCDATA1SET      /* 0xBF887618 */
  .extern ADCDATA1INV      /* 0xBF88761C */
  .extern ADCDATA2         /* 0xBF887620 */
  .extern ADCDATA2CLR      /* 0xBF887624 */
  .extern ADCDATA2SET      /* 0xBF887628 */
  .extern ADCDATA2INV      /* 0xBF88762C */
  .extern ADCDATA3         /* 0xBF887630 */
  .extern ADCDATA3CLR      /* 0xBF887634 */
  .extern ADCDATA3SET      /* 0xBF887638 */
  .extern ADCDATA3INV      /* 0xBF88763C */
  .extern ADCDATA4         /* 0xBF887640 */
  .extern ADCDATA4CLR      /* 0xBF887644 */
  .extern ADCDATA4SET      /* 0xBF887648 */
  .extern ADCDATA4INV      /* 0xBF88764C */
  .extern ADCDATA5         /* 0xBF887650 */
  .extern ADCDATA5CLR      /* 0xBF887654 */
  .extern ADCDATA5SET      /* 0xBF887658 */
  .extern ADCDATA5INV      /* 0xBF88765C */
  .extern ADCDATA6         /* 0xBF887660 */
  .extern ADCDATA6CLR      /* 0xBF887664 */
  .extern ADCDATA6SET      /* 0xBF887668 */
  .extern ADCDATA6INV      /* 0xBF88766C */
  .extern ADCDATA7         /* 0xBF887670 */
  .extern ADCDATA7CLR      /* 0xBF887674 */
  .extern ADCDATA7SET      /* 0xBF887678 */
  .extern ADCDATA7INV      /* 0xBF88767C */
  .extern ADCDATA8         /* 0xBF887680 */
  .extern ADCDATA8CLR      /* 0xBF887684 */
  .extern ADCDATA8SET      /* 0xBF887688 */
  .extern ADCDATA8INV      /* 0xBF88768C */
  .extern ADCDATA9         /* 0xBF887690 */
  .extern ADCDATA9CLR      /* 0xBF887694 */
  .extern ADCDATA9SET      /* 0xBF887698 */
  .extern ADCDATA9INV      /* 0xBF88769C */
  .extern ADCDATA10        /* 0xBF8876A0 */
  .extern ADCDATA10CLR     /* 0xBF8876A4 */
  .extern ADCDATA10SET     /* 0xBF8876A8 */
  .extern ADCDATA10INV     /* 0xBF8876AC */
  .extern ADCDATA11        /* 0xBF8876B0 */
  .extern ADCDATA11CLR     /* 0xBF8876B4 */
  .extern ADCDATA11SET     /* 0xBF8876B8 */
  .extern ADCDATA11INV     /* 0xBF8876BC */
  .extern ADCDATA12        /* 0xBF8876C0 */
  .extern ADCDATA12CLR     /* 0xBF8876C4 */
  .extern ADCDATA12SET     /* 0xBF8876C8 */
  .extern ADCDATA12INV     /* 0xBF8876CC */
  .extern ADCDATA13        /* 0xBF8876D0 */
  .extern ADCDATA13CLR     /* 0xBF8876D4 */
  .extern ADCDATA13SET     /* 0xBF8876D8 */
  .extern ADCDATA13INV     /* 0xBF8876DC */
  .extern ADCDATA14        /* 0xBF8876E0 */
  .extern ADCDATA14CLR     /* 0xBF8876E4 */
  .extern ADCDATA14SET     /* 0xBF8876E8 */
  .extern ADCDATA14INV     /* 0xBF8876EC */
  .extern ADCDATA15        /* 0xBF8876F0 */
  .extern ADCDATA15CLR     /* 0xBF8876F4 */
  .extern ADCDATA15SET     /* 0xBF8876F8 */
  .extern ADCDATA15INV     /* 0xBF8876FC */
  .extern ADCDATA16        /* 0xBF887700 */
  .extern ADCDATA16CLR     /* 0xBF887704 */
  .extern ADCDATA16SET     /* 0xBF887708 */
  .extern ADCDATA16INV     /* 0xBF88770C */
  .extern ADCDATA17        /* 0xBF887710 */
  .extern ADCDATA17CLR     /* 0xBF887714 */
