CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _IFS1_I2C2BIF_POSITION                   0x0000001B
#define _IFS1_I2C2BIF_MASK                       0x08000000
#define _IFS1_I2C2BIF_LENGTH                     0x00000001

#define _IFS1_I2C2SIF_POSITION                   0x0000001C
#define _IFS1_I2C2SIF_MASK                       0x10000000
#define _IFS1_I2C2SIF_LENGTH                     0x00000001

#define _IFS1_I2C2MIF_POSITION                   0x0000001D
#define _IFS1_I2C2MIF_MASK                       0x20000000
#define _IFS1_I2C2MIF_LENGTH                     0x00000001

#define _IFS1_w_POSITION                         0x00000000
#define _IFS1_w_MASK                             0xFFFFFFFF
#define _IFS1_w_LENGTH                           0x00000020

#define _IFS2_CTMUIF_POSITION                    0x00000007
#define _IFS2_CTMUIF_MASK                        0x00000080
#define _IFS2_CTMUIF_LENGTH                      0x00000001

#define _IFS2_DMA0IF_POSITION                    0x00000008
#define _IFS2_DMA0IF_MASK                        0x00000100
#define _IFS2_DMA0IF_LENGTH                      0x00000001

#define _IFS2_DMA1IF_POSITION                    0x00000009
#define _IFS2_DMA1IF_MASK                        0x00000200
#define _IFS2_DMA1IF_LENGTH                      0x00000001

#define _IFS2_DMA2IF_POSITION                    0x0000000A
#define _IFS2_DMA2IF_MASK                        0x00000400
#define _IFS2_DMA2IF_LENGTH                      0x00000001

#define _IFS2_DMA3IF_POSITION                    0x0000000B
#define _IFS2_DMA3IF_MASK                        0x00000800
#define _IFS2_DMA3IF_LENGTH                      0x00000001

#define _IFS2_T6IF_POSITION                      0x0000000C
#define _IFS2_T6IF_MASK                          0x00001000
#define _IFS2_T6IF_LENGTH                        0x00000001

#define _IFS2_IC6EIF_POSITION                    0x0000000D
#define _IFS2_IC6EIF_MASK                        0x00002000
#define _IFS2_IC6EIF_LENGTH                      0x00000001

#define _IFS2_IC6IF_POSITION                     0x0000000E
#define _IFS2_IC6IF_MASK                         0x00004000
#define _IFS2_IC6IF_LENGTH                       0x00000001

#define _IFS2_OC6IF_POSITION                     0x0000000F
#define _IFS2_OC6IF_MASK                         0x00008000
#define _IFS2_OC6IF_LENGTH                       0x00000001

#define _IFS2_T7IF_POSITION                      0x00000010
#define _IFS2_T7IF_MASK                          0x00010000
#define _IFS2_T7IF_LENGTH                        0x00000001

#define _IFS2_IC7EIF_POSITION                    0x00000011
#define _IFS2_IC7EIF_MASK                        0x00020000
#define _IFS2_IC7EIF_LENGTH                      0x00000001

#define _IFS2_IC7IF_POSITION                     0x00000012
#define _IFS2_IC7IF_MASK                         0x00040000
#define _IFS2_IC7IF_LENGTH                       0x00000001

#define _IFS2_OC7IF_POSITION                     0x00000013
#define _IFS2_OC7IF_MASK                         0x00080000
#define _IFS2_OC7IF_LENGTH                       0x00000001

#define _IFS2_T8IF_POSITION                      0x00000014
#define _IFS2_T8IF_MASK                          0x00100000
#define _IFS2_T8IF_LENGTH                        0x00000001

#define _IFS2_IC8EIF_POSITION                    0x00000015
#define _IFS2_IC8EIF_MASK                        0x00200000
#define _IFS2_IC8EIF_LENGTH                      0x00000001

#define _IFS2_IC8IF_POSITION                     0x00000016
#define _IFS2_IC8IF_MASK                         0x00400000
#define _IFS2_IC8IF_LENGTH                       0x00000001

#define _IFS2_OC8IF_POSITION                     0x00000017
#define _IFS2_OC8IF_MASK                         0x00800000
#define _IFS2_OC8IF_LENGTH                       0x00000001

#define _IFS2_T9IF_POSITION                      0x00000018
#define _IFS2_T9IF_MASK                          0x01000000
#define _IFS2_T9IF_LENGTH                        0x00000001

#define _IFS2_IC9EIF_POSITION                    0x00000019
#define _IFS2_IC9EIF_MASK                        0x02000000
#define _IFS2_IC9EIF_LENGTH                      0x00000001

#define _IFS2_IC9IF_POSITION                     0x0000001A
#define _IFS2_IC9IF_MASK                         0x04000000
#define _IFS2_IC9IF_LENGTH                       0x00000001

#define _IFS2_OC9IF_POSITION                     0x0000001B
#define _IFS2_OC9IF_MASK                         0x08000000
#define _IFS2_OC9IF_LENGTH                       0x00000001

#define _IFS2_AD1IF_POSITION                     0x0000001C
#define _IFS2_AD1IF_MASK                         0x10000000
#define _IFS2_AD1IF_LENGTH                       0x00000001

#define _IFS2_AD1DC1IF_POSITION                  0x0000001E
#define _IFS2_AD1DC1IF_MASK                      0x40000000
#define _IFS2_AD1DC1IF_LENGTH                    0x00000001

#define _IFS2_AD1DC2IF_POSITION                  0x0000001F
#define _IFS2_AD1DC2IF_MASK                      0x80000000
#define _IFS2_AD1DC2IF_LENGTH                    0x00000001

#define _IFS2_w_POSITION                         0x00000000
#define _IFS2_w_MASK                             0xFFFFFFFF
#define _IFS2_w_LENGTH                           0x00000020

#define _IFS3_AD1DF1IF_POSITION                  0x00000000
#define _IFS3_AD1DF1IF_MASK                      0x00000001
#define _IFS3_AD1DF1IF_LENGTH                    0x00000001

#define _IFS3_AD1DF2IF_POSITION                  0x00000001
#define _IFS3_AD1DF2IF_MASK                      0x00000002
#define _IFS3_AD1DF2IF_LENGTH                    0x00000001

#define _IFS3_AD1DF3IF_POSITION                  0x00000002
#define _IFS3_AD1DF3IF_MASK                      0x00000004
#define _IFS3_AD1DF3IF_LENGTH                    0x00000001

#define _IFS3_AD1DF4IF_POSITION                  0x00000003
#define _IFS3_AD1DF4IF_MASK                      0x00000008
#define _IFS3_AD1DF4IF_LENGTH                    0x00000001

#define _IFS3_AD1FIIF_POSITION                   0x00000004
#define _IFS3_AD1FIIF_MASK                       0x00000010
#define _IFS3_AD1FIIF_LENGTH                     0x00000001

