CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _IFS5_CMP4IF_POSITION                    0x00000001
#define _IFS5_CMP4IF_MASK                        0x00000002
#define _IFS5_CMP4IF_LENGTH                      0x00000001

#define _IFS5_CMP5IF_POSITION                    0x00000002
#define _IFS5_CMP5IF_MASK                        0x00000004
#define _IFS5_CMP5IF_LENGTH                      0x00000001

#define _IFS5_CAN1IF_POSITION                    0x00000007
#define _IFS5_CAN1IF_MASK                        0x00000080
#define _IFS5_CAN1IF_LENGTH                      0x00000001

#define _IFS5_QEI1IF_POSITION                    0x00000009
#define _IFS5_QEI1IF_MASK                        0x00000200
#define _IFS5_QEI1IF_LENGTH                      0x00000001

#define _IFS5_QEI2IF_POSITION                    0x0000000A
#define _IFS5_QEI2IF_MASK                        0x00000400
#define _IFS5_QEI2IF_LENGTH                      0x00000001

#define _IFS5_PWMPEVTIF_POSITION                 0x0000000B
#define _IFS5_PWMPEVTIF_MASK                     0x00000800
#define _IFS5_PWMPEVTIF_LENGTH                   0x00000001

#define _IFS5_PWMSEVTIF_POSITION                 0x0000000C
#define _IFS5_PWMSEVTIF_MASK                     0x00001000
#define _IFS5_PWMSEVTIF_LENGTH                   0x00000001

#define _IFS5_PWM1IF_POSITION                    0x0000000D
#define _IFS5_PWM1IF_MASK                        0x00002000
#define _IFS5_PWM1IF_LENGTH                      0x00000001

#define _IFS5_PWM2IF_POSITION                    0x0000000E
#define _IFS5_PWM2IF_MASK                        0x00004000
#define _IFS5_PWM2IF_LENGTH                      0x00000001

#define _IFS5_PWM3IF_POSITION                    0x0000000F
#define _IFS5_PWM3IF_MASK                        0x00008000
#define _IFS5_PWM3IF_LENGTH                      0x00000001

#define _IFS5_PWM4IF_POSITION                    0x00000010
#define _IFS5_PWM4IF_MASK                        0x00010000
#define _IFS5_PWM4IF_LENGTH                      0x00000001

#define _IFS5_PWM5IF_POSITION                    0x00000011
#define _IFS5_PWM5IF_MASK                        0x00020000
#define _IFS5_PWM5IF_LENGTH                      0x00000001

#define _IFS5_PWM6IF_POSITION                    0x00000012
#define _IFS5_PWM6IF_MASK                        0x00040000
#define _IFS5_PWM6IF_LENGTH                      0x00000001

#define _IFS5_DMA4IF_POSITION                    0x00000016
#define _IFS5_DMA4IF_MASK                        0x00400000
#define _IFS5_DMA4IF_LENGTH                      0x00000001

#define _IFS5_DMA5IF_POSITION                    0x00000017
#define _IFS5_DMA5IF_MASK                        0x00800000
#define _IFS5_DMA5IF_LENGTH                      0x00000001

#define _IFS5_DMA6IF_POSITION                    0x00000018
#define _IFS5_DMA6IF_MASK                        0x01000000
#define _IFS5_DMA6IF_LENGTH                      0x00000001

#define _IFS5_DMA7IF_POSITION                    0x00000019
#define _IFS5_DMA7IF_MASK                        0x02000000
#define _IFS5_DMA7IF_LENGTH                      0x00000001

#define _IFS5_w_POSITION                         0x00000000
#define _IFS5_w_MASK                             0xFFFFFFFF
#define _IFS5_w_LENGTH                           0x00000020

#define _IFS7_SBIF_POSITION                      0x00000006
#define _IFS7_SBIF_MASK                          0x00000040
#define _IFS7_SBIF_LENGTH                        0x00000001

#define _IFS7_PWM7IF_POSITION                    0x0000000E
#define _IFS7_PWM7IF_MASK                        0x00004000
#define _IFS7_PWM7IF_LENGTH                      0x00000001

#define _IFS7_PWM8IF_POSITION                    0x0000000F
#define _IFS7_PWM8IF_MASK                        0x00008000
#define _IFS7_PWM8IF_LENGTH                      0x00000001

#define _IFS7_AD1DC3IF_POSITION                  0x00000015
#define _IFS7_AD1DC3IF_MASK                      0x00200000
#define _IFS7_AD1DC3IF_LENGTH                    0x00000001

#define _IFS7_AD1DC4IF_POSITION                  0x00000016
#define _IFS7_AD1DC4IF_MASK                      0x00400000
#define _IFS7_AD1DC4IF_LENGTH                    0x00000001

#define _IFS7_CLC1IF_POSITION                    0x00000019
#define _IFS7_CLC1IF_MASK                        0x02000000
#define _IFS7_CLC1IF_LENGTH                      0x00000001

#define _IFS7_CLC2IF_POSITION                    0x0000001A
#define _IFS7_CLC2IF_MASK                        0x04000000
#define _IFS7_CLC2IF_LENGTH                      0x00000001

#define _IFS7_CLC3IF_POSITION                    0x0000001B
#define _IFS7_CLC3IF_MASK                        0x08000000
#define _IFS7_CLC3IF_LENGTH                      0x00000001

#define _IFS7_CLC4IF_POSITION                    0x0000001C
#define _IFS7_CLC4IF_MASK                        0x10000000
#define _IFS7_CLC4IF_LENGTH                      0x00000001

#define _IFS7_CPCIF_POSITION                     0x0000001E
#define _IFS7_CPCIF_MASK                         0x40000000
#define _IFS7_CPCIF_LENGTH                       0x00000001

#define _IFS7_CFDCIF_POSITION                    0x0000001F
#define _IFS7_CFDCIF_MASK                        0x80000000
#define _IFS7_CFDCIF_LENGTH                      0x00000001

#define _IFS7_w_POSITION                         0x00000000
#define _IFS7_w_MASK                             0xFFFFFFFF
#define _IFS7_w_LENGTH                           0x00000020

#define _IEC0_CTIE_POSITION                      0x00000000
#define _IEC0_CTIE_MASK                          0x00000001
#define _IEC0_CTIE_LENGTH                        0x00000001

#define _IEC0_CS0IE_POSITION                     0x00000001
#define _IEC0_CS0IE_MASK                         0x00000002
#define _IEC0_CS0IE_LENGTH                       0x00000001

#define _IEC0_CS1IE_POSITION                     0x00000002
#define _IEC0_CS1IE_MASK                         0x00000004
#define _IEC0_CS1IE_LENGTH                       0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000003
#define _IEC0_INT0IE_MASK                        0x00000008
#define _IEC0_INT0IE_LENGTH                      0x00000001

