CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _IEC1_I2C1SIE_POSITION                   0x0000000A
#define _IEC1_I2C1SIE_MASK                       0x00000400
#define _IEC1_I2C1SIE_LENGTH                     0x00000001

#define _IEC1_I2C1MIE_POSITION                   0x0000000B
#define _IEC1_I2C1MIE_MASK                       0x00000800
#define _IEC1_I2C1MIE_LENGTH                     0x00000001

#define _IEC1_CNAIE_POSITION                     0x0000000C
#define _IEC1_CNAIE_MASK                         0x00001000
#define _IEC1_CNAIE_LENGTH                       0x00000001

#define _IEC1_CNBIE_POSITION                     0x0000000D
#define _IEC1_CNBIE_MASK                         0x00002000
#define _IEC1_CNBIE_LENGTH                       0x00000001

#define _IEC1_CNCIE_POSITION                     0x0000000E
#define _IEC1_CNCIE_MASK                         0x00004000
#define _IEC1_CNCIE_LENGTH                       0x00000001

#define _IEC1_CNDIE_POSITION                     0x0000000F
#define _IEC1_CNDIE_MASK                         0x00008000
#define _IEC1_CNDIE_LENGTH                       0x00000001

#define _IEC1_CNEIE_POSITION                     0x00000010
#define _IEC1_CNEIE_MASK                         0x00010000
#define _IEC1_CNEIE_LENGTH                       0x00000001

#define _IEC1_CNFIE_POSITION                     0x00000011
#define _IEC1_CNFIE_MASK                         0x00020000
#define _IEC1_CNFIE_LENGTH                       0x00000001

#define _IEC1_CNGIE_POSITION                     0x00000012
#define _IEC1_CNGIE_MASK                         0x00040000
#define _IEC1_CNGIE_LENGTH                       0x00000001

#define _IEC1_SPI2EIE_POSITION                   0x00000015
#define _IEC1_SPI2EIE_MASK                       0x00200000
#define _IEC1_SPI2EIE_LENGTH                     0x00000001

#define _IEC1_SPI2RXIE_POSITION                  0x00000016
#define _IEC1_SPI2RXIE_MASK                      0x00400000
#define _IEC1_SPI2RXIE_LENGTH                    0x00000001

#define _IEC1_SPI2TXIE_POSITION                  0x00000017
#define _IEC1_SPI2TXIE_MASK                      0x00800000
#define _IEC1_SPI2TXIE_LENGTH                    0x00000001

#define _IEC1_U2EIE_POSITION                     0x00000018
#define _IEC1_U2EIE_MASK                         0x01000000
#define _IEC1_U2EIE_LENGTH                       0x00000001

#define _IEC1_U2RXIE_POSITION                    0x00000019
#define _IEC1_U2RXIE_MASK                        0x02000000
#define _IEC1_U2RXIE_LENGTH                      0x00000001

#define _IEC1_U2TXIE_POSITION                    0x0000001A
#define _IEC1_U2TXIE_MASK                        0x04000000
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC1_I2C2BIE_POSITION                   0x0000001B
#define _IEC1_I2C2BIE_MASK                       0x08000000
#define _IEC1_I2C2BIE_LENGTH                     0x00000001

#define _IEC1_I2C2SIE_POSITION                   0x0000001C
#define _IEC1_I2C2SIE_MASK                       0x10000000
#define _IEC1_I2C2SIE_LENGTH                     0x00000001

#define _IEC1_I2C2MIE_POSITION                   0x0000001D
#define _IEC1_I2C2MIE_MASK                       0x20000000
#define _IEC1_I2C2MIE_LENGTH                     0x00000001

#define _IEC1_w_POSITION                         0x00000000
#define _IEC1_w_MASK                             0xFFFFFFFF
#define _IEC1_w_LENGTH                           0x00000020

#define _IEC2_CTMUIE_POSITION                    0x00000007
#define _IEC2_CTMUIE_MASK                        0x00000080
#define _IEC2_CTMUIE_LENGTH                      0x00000001

#define _IEC2_DMA0IE_POSITION                    0x00000008
#define _IEC2_DMA0IE_MASK                        0x00000100
#define _IEC2_DMA0IE_LENGTH                      0x00000001

#define _IEC2_DMA1IE_POSITION                    0x00000009
#define _IEC2_DMA1IE_MASK                        0x00000200
#define _IEC2_DMA1IE_LENGTH                      0x00000001

#define _IEC2_DMA2IE_POSITION                    0x0000000A
#define _IEC2_DMA2IE_MASK                        0x00000400
#define _IEC2_DMA2IE_LENGTH                      0x00000001

#define _IEC2_DMA3IE_POSITION                    0x0000000B
#define _IEC2_DMA3IE_MASK                        0x00000800
#define _IEC2_DMA3IE_LENGTH                      0x00000001

#define _IEC2_T6IE_POSITION                      0x0000000C
#define _IEC2_T6IE_MASK                          0x00001000
#define _IEC2_T6IE_LENGTH                        0x00000001

#define _IEC2_IC6EIE_POSITION                    0x0000000D
#define _IEC2_IC6EIE_MASK                        0x00002000
#define _IEC2_IC6EIE_LENGTH                      0x00000001

#define _IEC2_IC6IE_POSITION                     0x0000000E
#define _IEC2_IC6IE_MASK                         0x00004000
#define _IEC2_IC6IE_LENGTH                       0x00000001

#define _IEC2_OC6IE_POSITION                     0x0000000F
#define _IEC2_OC6IE_MASK                         0x00008000
#define _IEC2_OC6IE_LENGTH                       0x00000001

#define _IEC2_T7IE_POSITION                      0x00000010
#define _IEC2_T7IE_MASK                          0x00010000
#define _IEC2_T7IE_LENGTH                        0x00000001

#define _IEC2_IC7EIE_POSITION                    0x00000011
#define _IEC2_IC7EIE_MASK                        0x00020000
#define _IEC2_IC7EIE_LENGTH                      0x00000001

#define _IEC2_IC7IE_POSITION                     0x00000012
#define _IEC2_IC7IE_MASK                         0x00040000
#define _IEC2_IC7IE_LENGTH                       0x00000001

#define _IEC2_OC7IE_POSITION                     0x00000013
#define _IEC2_OC7IE_MASK                         0x00080000
#define _IEC2_OC7IE_LENGTH                       0x00000001

#define _IEC2_T8IE_POSITION                      0x00000014
#define _IEC2_T8IE_MASK                          0x00100000
#define _IEC2_T8IE_LENGTH                        0x00000001

#define _IEC2_IC8EIE_POSITION                    0x00000015
#define _IEC2_IC8EIE_MASK                        0x00200000
#define _IEC2_IC8EIE_LENGTH                      0x00000001

#define _IEC2_IC8IE_POSITION                     0x00000016
#define _IEC2_IC8IE_MASK                         0x00400000
#define _IEC2_IC8IE_LENGTH                       0x00000001

#define _IEC2_OC8IE_POSITION                     0x00000017
#define _IEC2_OC8IE_MASK                         0x00800000
#define _IEC2_OC8IE_LENGTH                       0x00000001

#define _IEC2_T9IE_POSITION                      0x00000018
#define _IEC2_T9IE_MASK                          0x01000000
#define _IEC2_T9IE_LENGTH                        0x00000001

#define _IEC2_IC9EIE_POSITION                    0x00000019
#define _IEC2_IC9EIE_MASK                        0x02000000
#define _IEC2_IC9EIE_LENGTH                      0x00000001

#define _IEC2_IC9IE_POSITION                     0x0000001A
#define _IEC2_IC9IE_MASK                         0x04000000
#define _IEC2_IC9IE_LENGTH                       0x00000001

#define _IEC2_OC9IE_POSITION                     0x0000001B
#define _IEC2_OC9IE_MASK                         0x08000000
#define _IEC2_OC9IE_LENGTH                       0x00000001

