CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _IEC4_AD1D24IE_POSITION                  0x00000002
#define _IEC4_AD1D24IE_MASK                      0x00000004
#define _IEC4_AD1D24IE_LENGTH                    0x00000001

#define _IEC4_AD1D25IE_POSITION                  0x00000003
#define _IEC4_AD1D25IE_MASK                      0x00000008
#define _IEC4_AD1D25IE_LENGTH                    0x00000001

#define _IEC4_AD1D26IE_POSITION                  0x00000004
#define _IEC4_AD1D26IE_MASK                      0x00000010
#define _IEC4_AD1D26IE_LENGTH                    0x00000001

#define _IEC4_AD1D27IE_POSITION                  0x00000005
#define _IEC4_AD1D27IE_MASK                      0x00000020
#define _IEC4_AD1D27IE_LENGTH                    0x00000001

#define _IEC4_AD1D40IE_POSITION                  0x00000012
#define _IEC4_AD1D40IE_MASK                      0x00040000
#define _IEC4_AD1D40IE_LENGTH                    0x00000001

#define _IEC4_AD1D41IE_POSITION                  0x00000013
#define _IEC4_AD1D41IE_MASK                      0x00080000
#define _IEC4_AD1D41IE_LENGTH                    0x00000001

#define _IEC4_AD1D45IE_POSITION                  0x00000017
#define _IEC4_AD1D45IE_MASK                      0x00800000
#define _IEC4_AD1D45IE_LENGTH                    0x00000001

#define _IEC4_AD1D46IE_POSITION                  0x00000018
#define _IEC4_AD1D46IE_MASK                      0x01000000
#define _IEC4_AD1D46IE_LENGTH                    0x00000001

#define _IEC4_AD1D47IE_POSITION                  0x00000019
#define _IEC4_AD1D47IE_MASK                      0x02000000
#define _IEC4_AD1D47IE_LENGTH                    0x00000001

#define _IEC4_AD1D48IE_POSITION                  0x0000001A
#define _IEC4_AD1D48IE_MASK                      0x04000000
#define _IEC4_AD1D48IE_LENGTH                    0x00000001

#define _IEC4_AD1D49IE_POSITION                  0x0000001B
#define _IEC4_AD1D49IE_MASK                      0x08000000
#define _IEC4_AD1D49IE_LENGTH                    0x00000001

#define _IEC4_AD1D50IE_POSITION                  0x0000001C
#define _IEC4_AD1D50IE_MASK                      0x10000000
#define _IEC4_AD1D50IE_LENGTH                    0x00000001

#define _IEC4_AD1D51IE_POSITION                  0x0000001D
#define _IEC4_AD1D51IE_MASK                      0x20000000
#define _IEC4_AD1D51IE_LENGTH                    0x00000001

#define _IEC4_AD1D52IE_POSITION                  0x0000001E
#define _IEC4_AD1D52IE_MASK                      0x40000000
#define _IEC4_AD1D52IE_LENGTH                    0x00000001

#define _IEC4_AD1D53IE_POSITION                  0x0000001F
#define _IEC4_AD1D53IE_MASK                      0x80000000
#define _IEC4_AD1D53IE_LENGTH                    0x00000001

#define _IEC4_w_POSITION                         0x00000000
#define _IEC4_w_MASK                             0xFFFFFFFF
#define _IEC4_w_LENGTH                           0x00000020

#define _IEC5_CMP3IE_POSITION                    0x00000000
#define _IEC5_CMP3IE_MASK                        0x00000001
#define _IEC5_CMP3IE_LENGTH                      0x00000001

#define _IEC5_CMP4IE_POSITION                    0x00000001
#define _IEC5_CMP4IE_MASK                        0x00000002
#define _IEC5_CMP4IE_LENGTH                      0x00000001

#define _IEC5_CMP5IE_POSITION                    0x00000002
#define _IEC5_CMP5IE_MASK                        0x00000004
#define _IEC5_CMP5IE_LENGTH                      0x00000001

#define _IEC5_CAN1IE_POSITION                    0x00000007
#define _IEC5_CAN1IE_MASK                        0x00000080
#define _IEC5_CAN1IE_LENGTH                      0x00000001

#define _IEC5_QEI1IE_POSITION                    0x00000009
#define _IEC5_QEI1IE_MASK                        0x00000200
#define _IEC5_QEI1IE_LENGTH                      0x00000001

#define _IEC5_QEI2IE_POSITION                    0x0000000A
#define _IEC5_QEI2IE_MASK                        0x00000400
#define _IEC5_QEI2IE_LENGTH                      0x00000001

#define _IEC5_PWMPEVTIE_POSITION                 0x0000000B
#define _IEC5_PWMPEVTIE_MASK                     0x00000800
#define _IEC5_PWMPEVTIE_LENGTH                   0x00000001

#define _IEC5_PWMSEVTIE_POSITION                 0x0000000C
#define _IEC5_PWMSEVTIE_MASK                     0x00001000
#define _IEC5_PWMSEVTIE_LENGTH                   0x00000001

#define _IEC5_PWM1IE_POSITION                    0x0000000D
#define _IEC5_PWM1IE_MASK                        0x00002000
#define _IEC5_PWM1IE_LENGTH                      0x00000001

#define _IEC5_PWM2IE_POSITION                    0x0000000E
#define _IEC5_PWM2IE_MASK                        0x00004000
#define _IEC5_PWM2IE_LENGTH                      0x00000001

#define _IEC5_PWM3IE_POSITION                    0x0000000F
#define _IEC5_PWM3IE_MASK                        0x00008000
#define _IEC5_PWM3IE_LENGTH                      0x00000001

#define _IEC5_PWM4IE_POSITION                    0x00000010
#define _IEC5_PWM4IE_MASK                        0x00010000
#define _IEC5_PWM4IE_LENGTH                      0x00000001

#define _IEC5_PWM5IE_POSITION                    0x00000011
#define _IEC5_PWM5IE_MASK                        0x00020000
#define _IEC5_PWM5IE_LENGTH                      0x00000001

#define _IEC5_PWM6IE_POSITION                    0x00000012
#define _IEC5_PWM6IE_MASK                        0x00040000
#define _IEC5_PWM6IE_LENGTH                      0x00000001

#define _IEC5_DMA4IE_POSITION                    0x00000016
#define _IEC5_DMA4IE_MASK                        0x00400000
#define _IEC5_DMA4IE_LENGTH                      0x00000001

#define _IEC5_DMA5IE_POSITION                    0x00000017
#define _IEC5_DMA5IE_MASK                        0x00800000
#define _IEC5_DMA5IE_LENGTH                      0x00000001

#define _IEC5_DMA6IE_POSITION                    0x00000018
#define _IEC5_DMA6IE_MASK                        0x01000000
#define _IEC5_DMA6IE_LENGTH                      0x00000001

#define _IEC5_DMA7IE_POSITION                    0x00000019
#define _IEC5_DMA7IE_MASK                        0x02000000
#define _IEC5_DMA7IE_LENGTH                      0x00000001

#define _IEC5_w_POSITION                         0x00000000
#define _IEC5_w_MASK                             0xFFFFFFFF
#define _IEC5_w_LENGTH                           0x00000020

