CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _IPC43_PWM1IP_POSITION                   0x0000000A
#define _IPC43_PWM1IP_MASK                       0x00001C00
#define _IPC43_PWM1IP_LENGTH                     0x00000003

#define _IPC43_PWM2IS_POSITION                   0x00000010
#define _IPC43_PWM2IS_MASK                       0x00030000
#define _IPC43_PWM2IS_LENGTH                     0x00000002

#define _IPC43_PWM2IP_POSITION                   0x00000012
#define _IPC43_PWM2IP_MASK                       0x001C0000
#define _IPC43_PWM2IP_LENGTH                     0x00000003

#define _IPC43_PWM3IS_POSITION                   0x00000018
#define _IPC43_PWM3IS_MASK                       0x03000000
#define _IPC43_PWM3IS_LENGTH                     0x00000002

#define _IPC43_PWM3IP_POSITION                   0x0000001A
#define _IPC43_PWM3IP_MASK                       0x1C000000
#define _IPC43_PWM3IP_LENGTH                     0x00000003

#define _IPC43_w_POSITION                        0x00000000
#define _IPC43_w_MASK                            0xFFFFFFFF
#define _IPC43_w_LENGTH                          0x00000020

#define _IPC44_PWM4IS_POSITION                   0x00000000
#define _IPC44_PWM4IS_MASK                       0x00000003
#define _IPC44_PWM4IS_LENGTH                     0x00000002

#define _IPC44_PWM4IP_POSITION                   0x00000002
#define _IPC44_PWM4IP_MASK                       0x0000001C
#define _IPC44_PWM4IP_LENGTH                     0x00000003

#define _IPC44_PWM5IS_POSITION                   0x00000008
#define _IPC44_PWM5IS_MASK                       0x00000300
#define _IPC44_PWM5IS_LENGTH                     0x00000002

#define _IPC44_PWM5IP_POSITION                   0x0000000A
#define _IPC44_PWM5IP_MASK                       0x00001C00
#define _IPC44_PWM5IP_LENGTH                     0x00000003

#define _IPC44_PWM6IS_POSITION                   0x00000010
#define _IPC44_PWM6IS_MASK                       0x00030000
#define _IPC44_PWM6IS_LENGTH                     0x00000002

#define _IPC44_PWM6IP_POSITION                   0x00000012
#define _IPC44_PWM6IP_MASK                       0x001C0000
#define _IPC44_PWM6IP_LENGTH                     0x00000003

#define _IPC44_w_POSITION                        0x00000000
#define _IPC44_w_MASK                            0xFFFFFFFF
#define _IPC44_w_LENGTH                          0x00000020

#define _IPC45_DMA4IS_POSITION                   0x00000010
#define _IPC45_DMA4IS_MASK                       0x00030000
#define _IPC45_DMA4IS_LENGTH                     0x00000002

#define _IPC45_DMA4IP_POSITION                   0x00000012
#define _IPC45_DMA4IP_MASK                       0x001C0000
#define _IPC45_DMA4IP_LENGTH                     0x00000003

#define _IPC45_DMA5IS_POSITION                   0x00000018
#define _IPC45_DMA5IS_MASK                       0x03000000
#define _IPC45_DMA5IS_LENGTH                     0x00000002

#define _IPC45_DMA5IP_POSITION                   0x0000001A
#define _IPC45_DMA5IP_MASK                       0x1C000000
#define _IPC45_DMA5IP_LENGTH                     0x00000003

#define _IPC45_w_POSITION                        0x00000000
#define _IPC45_w_MASK                            0xFFFFFFFF
#define _IPC45_w_LENGTH                          0x00000020

#define _IPC46_DMA6IS_POSITION                   0x00000000
#define _IPC46_DMA6IS_MASK                       0x00000003
#define _IPC46_DMA6IS_LENGTH                     0x00000002

#define _IPC46_DMA6IP_POSITION                   0x00000002
#define _IPC46_DMA6IP_MASK                       0x0000001C
#define _IPC46_DMA6IP_LENGTH                     0x00000003

#define _IPC46_DMA7IS_POSITION                   0x00000008
#define _IPC46_DMA7IS_MASK                       0x00000300
#define _IPC46_DMA7IS_LENGTH                     0x00000002

#define _IPC46_DMA7IP_POSITION                   0x0000000A
#define _IPC46_DMA7IP_MASK                       0x00001C00
#define _IPC46_DMA7IP_LENGTH                     0x00000003

#define _IPC46_w_POSITION                        0x00000000
#define _IPC46_w_MASK                            0xFFFFFFFF
#define _IPC46_w_LENGTH                          0x00000020

#define _IPC57_SBIS_POSITION                     0x00000010
#define _IPC57_SBIS_MASK                         0x00030000
#define _IPC57_SBIS_LENGTH                       0x00000002

#define _IPC57_SBIP_POSITION                     0x00000012
#define _IPC57_SBIP_MASK                         0x001C0000
#define _IPC57_SBIP_LENGTH                       0x00000003

#define _IPC57_w_POSITION                        0x00000000
#define _IPC57_w_MASK                            0xFFFFFFFF
#define _IPC57_w_LENGTH                          0x00000020

#define _IPC59_PWM7IS_POSITION                   0x00000010
#define _IPC59_PWM7IS_MASK                       0x00030000
#define _IPC59_PWM7IS_LENGTH                     0x00000002

#define _IPC59_PWM7IP_POSITION                   0x00000012
#define _IPC59_PWM7IP_MASK                       0x001C0000
#define _IPC59_PWM7IP_LENGTH                     0x00000003

#define _IPC59_PWM8IS_POSITION                   0x00000018
#define _IPC59_PWM8IS_MASK                       0x03000000
#define _IPC59_PWM8IS_LENGTH                     0x00000002

#define _IPC59_PWM8IP_POSITION                   0x0000001A
#define _IPC59_PWM8IP_MASK                       0x1C000000
#define _IPC59_PWM8IP_LENGTH                     0x00000003

#define _IPC59_w_POSITION                        0x00000000
#define _IPC59_w_MASK                            0xFFFFFFFF
#define _IPC59_w_LENGTH                          0x00000020

#define _IPC61_AD1DC3IS_POSITION                 0x00000008
#define _IPC61_AD1DC3IS_MASK                     0x00000300
#define _IPC61_AD1DC3IS_LENGTH                   0x00000002

#define _IPC61_AD1DC3IP_POSITION                 0x0000000A
#define _IPC61_AD1DC3IP_MASK                     0x00001C00
#define _IPC61_AD1DC3IP_LENGTH                   0x00000003

#define _IPC61_AD1DC4IS_POSITION                 0x00000010
#define _IPC61_AD1DC4IS_MASK                     0x00030000
#define _IPC61_AD1DC4IS_LENGTH                   0x00000002

#define _IPC61_AD1DC4IP_POSITION                 0x00000012
#define _IPC61_AD1DC4IP_MASK                     0x001C0000
#define _IPC61_AD1DC4IP_LENGTH                   0x00000003

#define _IPC61_w_POSITION                        0x00000000
#define _IPC61_w_MASK                            0xFFFFFFFF
#define _IPC61_w_LENGTH                          0x00000020

#define _IPC62_CLC1IS_POSITION                   0x00000008
#define _IPC62_CLC1IS_MASK                       0x00000300
#define _IPC62_CLC1IS_LENGTH                     0x00000002

#define _IPC62_CLC1IP_POSITION                   0x0000000A
#define _IPC62_CLC1IP_MASK                       0x00001C00
#define _IPC62_CLC1IP_LENGTH                     0x00000003

#define _IPC62_CLC2IS_POSITION                   0x00000010
#define _IPC62_CLC2IS_MASK                       0x00030000
#define _IPC62_CLC2IS_LENGTH                     0x00000002

