CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _OFF036_VOFF_POSITION                    0x00000001
#define _OFF036_VOFF_MASK                        0x0003FFFE
#define _OFF036_VOFF_LENGTH                      0x00000011

#define _OFF037_VOFF_POSITION                    0x00000001
#define _OFF037_VOFF_MASK                        0x0003FFFE
#define _OFF037_VOFF_LENGTH                      0x00000011

#define _OFF038_VOFF_POSITION                    0x00000001
#define _OFF038_VOFF_MASK                        0x0003FFFE
#define _OFF038_VOFF_LENGTH                      0x00000011

#define _OFF039_VOFF_POSITION                    0x00000001
#define _OFF039_VOFF_MASK                        0x0003FFFE
#define _OFF039_VOFF_LENGTH                      0x00000011

#define _OFF040_VOFF_POSITION                    0x00000001
#define _OFF040_VOFF_MASK                        0x0003FFFE
#define _OFF040_VOFF_LENGTH                      0x00000011

#define _OFF041_VOFF_POSITION                    0x00000001
#define _OFF041_VOFF_MASK                        0x0003FFFE
#define _OFF041_VOFF_LENGTH                      0x00000011

#define _OFF042_VOFF_POSITION                    0x00000001
#define _OFF042_VOFF_MASK                        0x0003FFFE
#define _OFF042_VOFF_LENGTH                      0x00000011

#define _OFF043_VOFF_POSITION                    0x00000001
#define _OFF043_VOFF_MASK                        0x0003FFFE
#define _OFF043_VOFF_LENGTH                      0x00000011

#define _OFF044_VOFF_POSITION                    0x00000001
#define _OFF044_VOFF_MASK                        0x0003FFFE
#define _OFF044_VOFF_LENGTH                      0x00000011

#define _OFF045_VOFF_POSITION                    0x00000001
#define _OFF045_VOFF_MASK                        0x0003FFFE
#define _OFF045_VOFF_LENGTH                      0x00000011

#define _OFF046_VOFF_POSITION                    0x00000001
#define _OFF046_VOFF_MASK                        0x0003FFFE
#define _OFF046_VOFF_LENGTH                      0x00000011

#define _OFF047_VOFF_POSITION                    0x00000001
#define _OFF047_VOFF_MASK                        0x0003FFFE
#define _OFF047_VOFF_LENGTH                      0x00000011

#define _OFF048_VOFF_POSITION                    0x00000001
#define _OFF048_VOFF_MASK                        0x0003FFFE
#define _OFF048_VOFF_LENGTH                      0x00000011

#define _OFF049_VOFF_POSITION                    0x00000001
#define _OFF049_VOFF_MASK                        0x0003FFFE
#define _OFF049_VOFF_LENGTH                      0x00000011

#define _OFF050_VOFF_POSITION                    0x00000001
#define _OFF050_VOFF_MASK                        0x0003FFFE
#define _OFF050_VOFF_LENGTH                      0x00000011

#define _OFF053_VOFF_POSITION                    0x00000001
#define _OFF053_VOFF_MASK                        0x0003FFFE
#define _OFF053_VOFF_LENGTH                      0x00000011

#define _OFF054_VOFF_POSITION                    0x00000001
#define _OFF054_VOFF_MASK                        0x0003FFFE
#define _OFF054_VOFF_LENGTH                      0x00000011

#define _OFF055_VOFF_POSITION                    0x00000001
#define _OFF055_VOFF_MASK                        0x0003FFFE
#define _OFF055_VOFF_LENGTH                      0x00000011

#define _OFF056_VOFF_POSITION                    0x00000001
#define _OFF056_VOFF_MASK                        0x0003FFFE
#define _OFF056_VOFF_LENGTH                      0x00000011

#define _OFF057_VOFF_POSITION                    0x00000001
#define _OFF057_VOFF_MASK                        0x0003FFFE
#define _OFF057_VOFF_LENGTH                      0x00000011

#define _OFF058_VOFF_POSITION                    0x00000001
#define _OFF058_VOFF_MASK                        0x0003FFFE
#define _OFF058_VOFF_LENGTH                      0x00000011

#define _OFF059_VOFF_POSITION                    0x00000001
#define _OFF059_VOFF_MASK                        0x0003FFFE
#define _OFF059_VOFF_LENGTH                      0x00000011

#define _OFF060_VOFF_POSITION                    0x00000001
#define _OFF060_VOFF_MASK                        0x0003FFFE
#define _OFF060_VOFF_LENGTH                      0x00000011

#define _OFF061_VOFF_POSITION                    0x00000001
#define _OFF061_VOFF_MASK                        0x0003FFFE
#define _OFF061_VOFF_LENGTH                      0x00000011

#define _OFF071_VOFF_POSITION                    0x00000001
#define _OFF071_VOFF_MASK                        0x0003FFFE
#define _OFF071_VOFF_LENGTH                      0x00000011

#define _OFF072_VOFF_POSITION                    0x00000001
#define _OFF072_VOFF_MASK                        0x0003FFFE
#define _OFF072_VOFF_LENGTH                      0x00000011

#define _OFF073_VOFF_POSITION                    0x00000001
#define _OFF073_VOFF_MASK                        0x0003FFFE
#define _OFF073_VOFF_LENGTH                      0x00000011

#define _OFF074_VOFF_POSITION                    0x00000001
#define _OFF074_VOFF_MASK                        0x0003FFFE
#define _OFF074_VOFF_LENGTH                      0x00000011

#define _OFF075_VOFF_POSITION                    0x00000001
#define _OFF075_VOFF_MASK                        0x0003FFFE
#define _OFF075_VOFF_LENGTH                      0x00000011

#define _OFF076_VOFF_POSITION                    0x00000001
#define _OFF076_VOFF_MASK                        0x0003FFFE
#define _OFF076_VOFF_LENGTH                      0x00000011

#define _OFF077_VOFF_POSITION                    0x00000001
#define _OFF077_VOFF_MASK                        0x0003FFFE
#define _OFF077_VOFF_LENGTH                      0x00000011

#define _OFF078_VOFF_POSITION                    0x00000001
#define _OFF078_VOFF_MASK                        0x0003FFFE
#define _OFF078_VOFF_LENGTH                      0x00000011

#define _OFF079_VOFF_POSITION                    0x00000001
#define _OFF079_VOFF_MASK                        0x0003FFFE
#define _OFF079_VOFF_LENGTH                      0x00000011

#define _OFF080_VOFF_POSITION                    0x00000001
#define _OFF080_VOFF_MASK                        0x0003FFFE
#define _OFF080_VOFF_LENGTH                      0x00000011

#define _OFF081_VOFF_POSITION                    0x00000001
#define _OFF081_VOFF_MASK                        0x0003FFFE
#define _OFF081_VOFF_LENGTH                      0x00000011

