CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _IOCON1_CLPOL_POSITION                   0x00000019
#define _IOCON1_CLPOL_MASK                       0x02000000
#define _IOCON1_CLPOL_LENGTH                     0x00000001

#define _IOCON1_CLSRC_POSITION                   0x0000001A
#define _IOCON1_CLSRC_MASK                       0x3C000000
#define _IOCON1_CLSRC_LENGTH                     0x00000004

#define _PDC1_PDC_POSITION                       0x00000000
#define _PDC1_PDC_MASK                           0x0000FFFF
#define _PDC1_PDC_LENGTH                         0x00000010

#define _SDC1_SDC_POSITION                       0x00000000
#define _SDC1_SDC_MASK                           0x0000FFFF
#define _SDC1_SDC_LENGTH                         0x00000010

#define _PHASE1_PHASE_POSITION                   0x00000000
#define _PHASE1_PHASE_MASK                       0x0000FFFF
#define _PHASE1_PHASE_LENGTH                     0x00000010

#define _DTR1_DTR_POSITION                       0x00000000
#define _DTR1_DTR_MASK                           0x0000FFFF
#define _DTR1_DTR_LENGTH                         0x00000010

#define _ALTDTR1_ALTDTR_POSITION                 0x00000000
#define _ALTDTR1_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR1_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP1_COMP_POSITION                   0x00000000
#define _DTCOMP1_COMP_MASK                       0x00003FFF
#define _DTCOMP1_COMP_LENGTH                     0x0000000E

#define _TRIG1_TRGCMP_POSITION                   0x00000000
#define _TRIG1_TRGCMP_MASK                       0x0000FFFF
#define _TRIG1_TRGCMP_LENGTH                     0x00000010

#define _TRGCON1_STRGIS_POSITION                 0x00000006
#define _TRGCON1_STRGIS_MASK                     0x00000040
#define _TRGCON1_STRGIS_LENGTH                   0x00000001

#define _TRGCON1_DTM_POSITION                    0x00000007
#define _TRGCON1_DTM_MASK                        0x00000080
#define _TRGCON1_DTM_LENGTH                      0x00000001

#define _TRGCON1_STRGSEL_POSITION                0x00000008
#define _TRGCON1_STRGSEL_MASK                    0x00000300
#define _TRGCON1_STRGSEL_LENGTH                  0x00000002

#define _TRGCON1_TRGSEL_POSITION                 0x0000000A
#define _TRGCON1_TRGSEL_MASK                     0x00000C00
#define _TRGCON1_TRGSEL_LENGTH                   0x00000002

#define _TRGCON1_TRGDIV_POSITION                 0x0000000C
#define _TRGCON1_TRGDIV_MASK                     0x0000F000
#define _TRGCON1_TRGDIV_LENGTH                   0x00000004

#define _STRIG1_STRGCMP_POSITION                 0x00000000
#define _STRIG1_STRGCMP_MASK                     0x0000FFFF
#define _STRIG1_STRGCMP_LENGTH                   0x00000010

#define _CAP1_CAP_POSITION                       0x00000000
#define _CAP1_CAP_MASK                           0x0000FFFF
#define _CAP1_CAP_LENGTH                         0x00000010

#define _LEBCON1_CLLEBEN_POSITION                0x0000000A
#define _LEBCON1_CLLEBEN_MASK                    0x00000400
#define _LEBCON1_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON1_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON1_FLTLEBEN_MASK                   0x00000800
#define _LEBCON1_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON1_PLF_POSITION                    0x0000000C
#define _LEBCON1_PLF_MASK                        0x00001000
#define _LEBCON1_PLF_LENGTH                      0x00000001

#define _LEBCON1_PLR_POSITION                    0x0000000D
#define _LEBCON1_PLR_MASK                        0x00002000
#define _LEBCON1_PLR_LENGTH                      0x00000001

#define _LEBCON1_PHF_POSITION                    0x0000000E
#define _LEBCON1_PHF_MASK                        0x00004000
#define _LEBCON1_PHF_LENGTH                      0x00000001

#define _LEBCON1_PHR_POSITION                    0x0000000F
#define _LEBCON1_PHR_MASK                        0x00008000
#define _LEBCON1_PHR_LENGTH                      0x00000001

#define _LEBDLY1_LEB_POSITION                    0x00000000
#define _LEBDLY1_LEB_MASK                        0x00000FFF
#define _LEBDLY1_LEB_LENGTH                      0x0000000C

#define _AUXCON1_CHOPLEN_POSITION                0x00000000
#define _AUXCON1_CHOPLEN_MASK                    0x00000001
#define _AUXCON1_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON1_CHOPHEN_POSITION                0x00000001
#define _AUXCON1_CHOPHEN_MASK                    0x00000002
#define _AUXCON1_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON1_CHOPSEL_POSITION                0x00000002
#define _AUXCON1_CHOPSEL_MASK                    0x0000003C
#define _AUXCON1_CHOPSEL_LENGTH                  0x00000004

#define _PTMR1_TMR_POSITION                      0x00000000
#define _PTMR1_TMR_MASK                          0x0000FFFF
#define _PTMR1_TMR_LENGTH                        0x00000010

#define _PWMCON2_XPRES_POSITION                  0x00000001
#define _PWMCON2_XPRES_MASK                      0x00000002
#define _PWMCON2_XPRES_LENGTH                    0x00000001

#define _PWMCON2_MTBS_POSITION                   0x00000003
#define _PWMCON2_MTBS_MASK                       0x00000008
#define _PWMCON2_MTBS_LENGTH                     0x00000001

#define _PWMCON2_PTDIR_POSITION                  0x00000004
#define _PWMCON2_PTDIR_MASK                      0x00000010
#define _PWMCON2_PTDIR_LENGTH                    0x00000001

#define _PWMCON2_DTCP_POSITION                   0x00000005
#define _PWMCON2_DTCP_MASK                       0x00000020
#define _PWMCON2_DTCP_LENGTH                     0x00000001

#define _PWMCON2_DTC_POSITION                    0x00000006
#define _PWMCON2_DTC_MASK                        0x000000C0
#define _PWMCON2_DTC_LENGTH                      0x00000002

#define _PWMCON2_ITB_POSITION                    0x00000009
#define _PWMCON2_ITB_MASK                        0x00000200
#define _PWMCON2_ITB_LENGTH                      0x00000001

#define _PWMCON2_ECAM_POSITION                   0x0000000A
#define _PWMCON2_ECAM_MASK                       0x00000C00
#define _PWMCON2_ECAM_LENGTH                     0x00000002

