CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _PWMCON2_CLTSTAT_POSITION                0x0000000E
#define _PWMCON2_CLTSTAT_MASK                    0x00004000
#define _PWMCON2_CLTSTAT_LENGTH                  0x00000001

#define _PWMCON2_FLTSTAT_POSITION                0x0000000F
#define _PWMCON2_FLTSTAT_MASK                    0x00008000
#define _PWMCON2_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON2_PWMHIEN_POSITION                0x00000013
#define _PWMCON2_PWMHIEN_MASK                    0x00080000
#define _PWMCON2_PWMHIEN_LENGTH                  0x00000001

#define _PWMCON2_PWMLIEN_POSITION                0x00000014
#define _PWMCON2_PWMLIEN_MASK                    0x00100000
#define _PWMCON2_PWMLIEN_LENGTH                  0x00000001

#define _PWMCON2_TRGIEN_POSITION                 0x00000015
#define _PWMCON2_TRGIEN_MASK                     0x00200000
#define _PWMCON2_TRGIEN_LENGTH                   0x00000001

#define _PWMCON2_CLIEN_POSITION                  0x00000016
#define _PWMCON2_CLIEN_MASK                      0x00400000
#define _PWMCON2_CLIEN_LENGTH                    0x00000001

#define _PWMCON2_FLTIEN_POSITION                 0x00000017
#define _PWMCON2_FLTIEN_MASK                     0x00800000
#define _PWMCON2_FLTIEN_LENGTH                   0x00000001

#define _PWMCON2_PWMHIF_POSITION                 0x0000001B
#define _PWMCON2_PWMHIF_MASK                     0x08000000
#define _PWMCON2_PWMHIF_LENGTH                   0x00000001

#define _PWMCON2_PWMLIF_POSITION                 0x0000001C
#define _PWMCON2_PWMLIF_MASK                     0x10000000
#define _PWMCON2_PWMLIF_LENGTH                   0x00000001

#define _PWMCON2_TRGIF_POSITION                  0x0000001D
#define _PWMCON2_TRGIF_MASK                      0x20000000
#define _PWMCON2_TRGIF_LENGTH                    0x00000001

#define _PWMCON2_CLIF_POSITION                   0x0000001E
#define _PWMCON2_CLIF_MASK                       0x40000000
#define _PWMCON2_CLIF_LENGTH                     0x00000001

#define _PWMCON2_FLTIF_POSITION                  0x0000001F
#define _PWMCON2_FLTIF_MASK                      0x80000000
#define _PWMCON2_FLTIF_LENGTH                    0x00000001

#define _IOCON2_OSYNC_POSITION                   0x00000000
#define _IOCON2_OSYNC_MASK                       0x00000001
#define _IOCON2_OSYNC_LENGTH                     0x00000001

#define _IOCON2_SWAP_POSITION                    0x00000001
#define _IOCON2_SWAP_MASK                        0x00000002
#define _IOCON2_SWAP_LENGTH                      0x00000001

#define _IOCON2_CLDAT_POSITION                   0x00000002
#define _IOCON2_CLDAT_MASK                       0x0000000C
#define _IOCON2_CLDAT_LENGTH                     0x00000002

#define _IOCON2_FLTDAT_POSITION                  0x00000004
#define _IOCON2_FLTDAT_MASK                      0x00000030
#define _IOCON2_FLTDAT_LENGTH                    0x00000002

#define _IOCON2_OVRDAT_POSITION                  0x00000006
#define _IOCON2_OVRDAT_MASK                      0x000000C0
#define _IOCON2_OVRDAT_LENGTH                    0x00000002

#define _IOCON2_OVRENL_POSITION                  0x00000008
#define _IOCON2_OVRENL_MASK                      0x00000100
#define _IOCON2_OVRENL_LENGTH                    0x00000001

#define _IOCON2_OVRENH_POSITION                  0x00000009
#define _IOCON2_OVRENH_MASK                      0x00000200
#define _IOCON2_OVRENH_LENGTH                    0x00000001

#define _IOCON2_PMOD_POSITION                    0x0000000A
#define _IOCON2_PMOD_MASK                        0x00000C00
#define _IOCON2_PMOD_LENGTH                      0x00000002

#define _IOCON2_POLL_POSITION                    0x0000000C
#define _IOCON2_POLL_MASK                        0x00001000
#define _IOCON2_POLL_LENGTH                      0x00000001

#define _IOCON2_POLH_POSITION                    0x0000000D
#define _IOCON2_POLH_MASK                        0x00002000
#define _IOCON2_POLH_LENGTH                      0x00000001

#define _IOCON2_PENL_POSITION                    0x0000000E
#define _IOCON2_PENL_MASK                        0x00004000
#define _IOCON2_PENL_LENGTH                      0x00000001

#define _IOCON2_PENH_POSITION                    0x0000000F
#define _IOCON2_PENH_MASK                        0x00008000
#define _IOCON2_PENH_LENGTH                      0x00000001

#define _IOCON2_FLTMOD_POSITION                  0x00000010
#define _IOCON2_FLTMOD_MASK                      0x00030000
#define _IOCON2_FLTMOD_LENGTH                    0x00000002

#define _IOCON2_FLTPOL_POSITION                  0x00000012
#define _IOCON2_FLTPOL_MASK                      0x00040000
#define _IOCON2_FLTPOL_LENGTH                    0x00000001

#define _IOCON2_FLTSRC_POSITION                  0x00000013
#define _IOCON2_FLTSRC_MASK                      0x00780000
#define _IOCON2_FLTSRC_LENGTH                    0x00000004

#define _IOCON2_CLMOD_POSITION                   0x00000018
#define _IOCON2_CLMOD_MASK                       0x01000000
#define _IOCON2_CLMOD_LENGTH                     0x00000001

#define _IOCON2_CLPOL_POSITION                   0x00000019
#define _IOCON2_CLPOL_MASK                       0x02000000
#define _IOCON2_CLPOL_LENGTH                     0x00000001

#define _IOCON2_CLSRC_POSITION                   0x0000001A
#define _IOCON2_CLSRC_MASK                       0x3C000000
#define _IOCON2_CLSRC_LENGTH                     0x00000004

#define _PDC2_PDC_POSITION                       0x00000000
#define _PDC2_PDC_MASK                           0x0000FFFF
#define _PDC2_PDC_LENGTH                         0x00000010

#define _SDC2_SDC_POSITION                       0x00000000
#define _SDC2_SDC_MASK                           0x0000FFFF
#define _SDC2_SDC_LENGTH                         0x00000010

#define _PHASE2_PHASE_POSITION                   0x00000000
#define _PHASE2_PHASE_MASK                       0x0000FFFF
#define _PHASE2_PHASE_LENGTH                     0x00000010

#define _DTR2_DTR_POSITION                       0x00000000
#define _DTR2_DTR_MASK                           0x0000FFFF
#define _DTR2_DTR_LENGTH                         0x00000010

#define _ALTDTR2_ALTDTR_POSITION                 0x00000000
#define _ALTDTR2_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR2_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP2_COMP_POSITION                   0x00000000
#define _DTCOMP2_COMP_MASK                       0x00003FFF
#define _DTCOMP2_COMP_LENGTH                     0x0000000E

#define _TRIG2_TRGCMP_POSITION                   0x00000000
#define _TRIG2_TRGCMP_MASK                       0x0000FFFF
#define _TRIG2_TRGCMP_LENGTH                     0x00000010

