CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _CM1CON_CFLTREN_POSITION                 0x00000013
#define _CM1CON_CFLTREN_MASK                     0x00080000
#define _CM1CON_CFLTREN_LENGTH                   0x00000001

#define _CM1CON_CFSEL_POSITION                   0x00000014
#define _CM1CON_CFSEL_MASK                       0x00700000
#define _CM1CON_CFSEL_LENGTH                     0x00000003

#define _CM1CON_ENPGA_POSITION                   0x0000001E
#define _CM1CON_ENPGA_MASK                       0x40000000
#define _CM1CON_ENPGA_LENGTH                     0x00000001

#define _CM1CON_OPAON_POSITION                   0x0000001F
#define _CM1CON_OPAON_MASK                       0x80000000
#define _CM1CON_OPAON_LENGTH                     0x00000001

#define _CM2CON_CCH_POSITION                     0x00000000
#define _CM2CON_CCH_MASK                         0x00000003
#define _CM2CON_CCH_LENGTH                       0x00000002

#define _CM2CON_CREF_POSITION                    0x00000004
#define _CM2CON_CREF_MASK                        0x00000010
#define _CM2CON_CREF_LENGTH                      0x00000001

#define _CM2CON_EVPOL_POSITION                   0x00000006
#define _CM2CON_EVPOL_MASK                       0x000000C0
#define _CM2CON_EVPOL_LENGTH                     0x00000002

#define _CM2CON_COUT_POSITION                    0x00000008
#define _CM2CON_COUT_MASK                        0x00000100
#define _CM2CON_COUT_LENGTH                      0x00000001

#define _CM2CON_CEVT_POSITION                    0x00000009
#define _CM2CON_CEVT_MASK                        0x00000200
#define _CM2CON_CEVT_LENGTH                      0x00000001

#define _CM2CON_CPOL_POSITION                    0x0000000D
#define _CM2CON_CPOL_MASK                        0x00002000
#define _CM2CON_CPOL_LENGTH                      0x00000001

#define _CM2CON_COE_POSITION                     0x0000000E
#define _CM2CON_COE_MASK                         0x00004000
#define _CM2CON_COE_LENGTH                       0x00000001

#define _CM2CON_ON_POSITION                      0x0000000F
#define _CM2CON_ON_MASK                          0x00008000
#define _CM2CON_ON_LENGTH                        0x00000001

#define _CM2CON_CFDIV_POSITION                   0x00000010
#define _CM2CON_CFDIV_MASK                       0x00070000
#define _CM2CON_CFDIV_LENGTH                     0x00000003

#define _CM2CON_CFLTREN_POSITION                 0x00000013
#define _CM2CON_CFLTREN_MASK                     0x00080000
#define _CM2CON_CFLTREN_LENGTH                   0x00000001

#define _CM2CON_CFSEL_POSITION                   0x00000014
#define _CM2CON_CFSEL_MASK                       0x00700000
#define _CM2CON_CFSEL_LENGTH                     0x00000003

#define _CM2CON_ENPGA_POSITION                   0x0000001E
#define _CM2CON_ENPGA_MASK                       0x40000000
#define _CM2CON_ENPGA_LENGTH                     0x00000001

#define _CM2CON_OPAON_POSITION                   0x0000001F
#define _CM2CON_OPAON_MASK                       0x80000000
#define _CM2CON_OPAON_LENGTH                     0x00000001

#define _CM3CON_CCH_POSITION                     0x00000000
#define _CM3CON_CCH_MASK                         0x00000003
#define _CM3CON_CCH_LENGTH                       0x00000002

#define _CM3CON_CREF_POSITION                    0x00000004
#define _CM3CON_CREF_MASK                        0x00000010
#define _CM3CON_CREF_LENGTH                      0x00000001

#define _CM3CON_EVPOL_POSITION                   0x00000006
#define _CM3CON_EVPOL_MASK                       0x000000C0
#define _CM3CON_EVPOL_LENGTH                     0x00000002

#define _CM3CON_COUT_POSITION                    0x00000008
#define _CM3CON_COUT_MASK                        0x00000100
#define _CM3CON_COUT_LENGTH                      0x00000001

#define _CM3CON_CEVT_POSITION                    0x00000009
#define _CM3CON_CEVT_MASK                        0x00000200
#define _CM3CON_CEVT_LENGTH                      0x00000001

#define _CM3CON_CPOL_POSITION                    0x0000000D
#define _CM3CON_CPOL_MASK                        0x00002000
#define _CM3CON_CPOL_LENGTH                      0x00000001

#define _CM3CON_COE_POSITION                     0x0000000E
#define _CM3CON_COE_MASK                         0x00004000
#define _CM3CON_COE_LENGTH                       0x00000001

#define _CM3CON_ON_POSITION                      0x0000000F
#define _CM3CON_ON_MASK                          0x00008000
#define _CM3CON_ON_LENGTH                        0x00000001

#define _CM3CON_CFDIV_POSITION                   0x00000010
#define _CM3CON_CFDIV_MASK                       0x00070000
#define _CM3CON_CFDIV_LENGTH                     0x00000003

#define _CM3CON_CFLTREN_POSITION                 0x00000013
#define _CM3CON_CFLTREN_MASK                     0x00080000
#define _CM3CON_CFLTREN_LENGTH                   0x00000001

#define _CM3CON_CFSEL_POSITION                   0x00000014
#define _CM3CON_CFSEL_MASK                       0x00700000
#define _CM3CON_CFSEL_LENGTH                     0x00000003

#define _CM3CON_ENPGA_POSITION                   0x0000001E
#define _CM3CON_ENPGA_MASK                       0x40000000
#define _CM3CON_ENPGA_LENGTH                     0x00000001

#define _CM3CON_OPAON_POSITION                   0x0000001F
#define _CM3CON_OPAON_MASK                       0x80000000
#define _CM3CON_OPAON_LENGTH                     0x00000001

#define _CM4CON_CCH_POSITION                     0x00000000
#define _CM4CON_CCH_MASK                         0x00000003
#define _CM4CON_CCH_LENGTH                       0x00000002

#define _CM4CON_CREF_POSITION                    0x00000004
#define _CM4CON_CREF_MASK                        0x00000010
#define _CM4CON_CREF_LENGTH                      0x00000001

#define _CM4CON_EVPOL_POSITION                   0x00000006
#define _CM4CON_EVPOL_MASK                       0x000000C0
#define _CM4CON_EVPOL_LENGTH                     0x00000002

#define _CM4CON_COUT_POSITION                    0x00000008
#define _CM4CON_COUT_MASK                        0x00000100
#define _CM4CON_COUT_LENGTH                      0x00000001

#define _CM4CON_CEVT_POSITION                    0x00000009
#define _CM4CON_CEVT_MASK                        0x00000200
#define _CM4CON_CEVT_LENGTH                      0x00000001

#define _CM4CON_CPOL_POSITION                    0x0000000D
#define _CM4CON_CPOL_MASK                        0x00002000
#define _CM4CON_CPOL_LENGTH                      0x00000001

#define _CM4CON_COE_POSITION                     0x0000000E
#define _CM4CON_COE_MASK                         0x00004000
#define _CM4CON_COE_LENGTH                       0x00000001

#define _CM4CON_ON_POSITION                      0x0000000F
#define _CM4CON_ON_MASK                          0x00008000
#define _CM4CON_ON_LENGTH                        0x00000001

#define _CM4CON_CFDIV_POSITION                   0x00000010
#define _CM4CON_CFDIV_MASK                       0x00070000
#define _CM4CON_CFDIV_LENGTH                     0x00000003

