CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _CM4CON_CFLTREN_POSITION                 0x00000013
#define _CM4CON_CFLTREN_MASK                     0x00080000
#define _CM4CON_CFLTREN_LENGTH                   0x00000001

#define _CM4CON_CFSEL_POSITION                   0x00000014
#define _CM4CON_CFSEL_MASK                       0x00700000
#define _CM4CON_CFSEL_LENGTH                     0x00000003

#define _CM4CON_ENPGA_POSITION                   0x0000001E
#define _CM4CON_ENPGA_MASK                       0x40000000
#define _CM4CON_ENPGA_LENGTH                     0x00000001

#define _CM4CON_OPAON_POSITION                   0x0000001F
#define _CM4CON_OPAON_MASK                       0x80000000
#define _CM4CON_OPAON_LENGTH                     0x00000001

#define _CM5CON_CCH_POSITION                     0x00000000
#define _CM5CON_CCH_MASK                         0x00000003
#define _CM5CON_CCH_LENGTH                       0x00000002

#define _CM5CON_CREF_POSITION                    0x00000004
#define _CM5CON_CREF_MASK                        0x00000010
#define _CM5CON_CREF_LENGTH                      0x00000001

#define _CM5CON_EVPOL_POSITION                   0x00000006
#define _CM5CON_EVPOL_MASK                       0x000000C0
#define _CM5CON_EVPOL_LENGTH                     0x00000002

#define _CM5CON_COUT_POSITION                    0x00000008
#define _CM5CON_COUT_MASK                        0x00000100
#define _CM5CON_COUT_LENGTH                      0x00000001

#define _CM5CON_CEVT_POSITION                    0x00000009
#define _CM5CON_CEVT_MASK                        0x00000200
#define _CM5CON_CEVT_LENGTH                      0x00000001

#define _CM5CON_CPOL_POSITION                    0x0000000D
#define _CM5CON_CPOL_MASK                        0x00002000
#define _CM5CON_CPOL_LENGTH                      0x00000001

#define _CM5CON_COE_POSITION                     0x0000000E
#define _CM5CON_COE_MASK                         0x00004000
#define _CM5CON_COE_LENGTH                       0x00000001

#define _CM5CON_ON_POSITION                      0x0000000F
#define _CM5CON_ON_MASK                          0x00008000
#define _CM5CON_ON_LENGTH                        0x00000001

#define _CM5CON_CFDIV_POSITION                   0x00000010
#define _CM5CON_CFDIV_MASK                       0x00070000
#define _CM5CON_CFDIV_LENGTH                     0x00000003

#define _CM5CON_CFLTREN_POSITION                 0x00000013
#define _CM5CON_CFLTREN_MASK                     0x00080000
#define _CM5CON_CFLTREN_LENGTH                   0x00000001

#define _CM5CON_CFSEL_POSITION                   0x00000014
#define _CM5CON_CFSEL_MASK                       0x00700000
#define _CM5CON_CFSEL_LENGTH                     0x00000003

#define _CM5CON_ENPGA_POSITION                   0x0000001E
#define _CM5CON_ENPGA_MASK                       0x40000000
#define _CM5CON_ENPGA_LENGTH                     0x00000001

#define _CM5CON_OPAON_POSITION                   0x0000001F
#define _CM5CON_OPAON_MASK                       0x80000000
#define _CM5CON_OPAON_LENGTH                     0x00000001

#define _DAC2CON_REFSEL_POSITION                 0x00000000
#define _DAC2CON_REFSEL_MASK                     0x00000003
#define _DAC2CON_REFSEL_LENGTH                   0x00000002

#define _DAC2CON_DACOE_POSITION                  0x00000008
#define _DAC2CON_DACOE_MASK                      0x00000100
#define _DAC2CON_DACOE_LENGTH                    0x00000001

#define _DAC2CON_ON_POSITION                     0x0000000F
#define _DAC2CON_ON_MASK                         0x00008000
#define _DAC2CON_ON_LENGTH                       0x00000001

#define _DAC2CON_DACDAT_POSITION                 0x00000010
#define _DAC2CON_DACDAT_MASK                     0xFFFF0000
#define _DAC2CON_DACDAT_LENGTH                   0x00000010

#define _DAC3CON_REFSEL_POSITION                 0x00000000
#define _DAC3CON_REFSEL_MASK                     0x00000003
#define _DAC3CON_REFSEL_LENGTH                   0x00000002

#define _DAC3CON_DACOE_POSITION                  0x00000008
#define _DAC3CON_DACOE_MASK                      0x00000100
#define _DAC3CON_DACOE_LENGTH                    0x00000001

#define _DAC3CON_ON_POSITION                     0x0000000F
#define _DAC3CON_ON_MASK                         0x00008000
#define _DAC3CON_ON_LENGTH                       0x00000001

#define _DAC3CON_DACDAT_POSITION                 0x00000010
#define _DAC3CON_DACDAT_MASK                     0xFFFF0000
#define _DAC3CON_DACDAT_LENGTH                   0x00000010

#define _CTMUCON_IRNG_POSITION                   0x00000000
#define _CTMUCON_IRNG_MASK                       0x00000003
#define _CTMUCON_IRNG_LENGTH                     0x00000002

#define _CTMUCON_ITRIM_POSITION                  0x00000002
#define _CTMUCON_ITRIM_MASK                      0x000000FC
#define _CTMUCON_ITRIM_LENGTH                    0x00000006

#define _CTMUCON_CTTRIG_POSITION                 0x00000008
#define _CTMUCON_CTTRIG_MASK                     0x00000100
#define _CTMUCON_CTTRIG_LENGTH                   0x00000001

#define _CTMUCON_IDISSEN_POSITION                0x00000009
#define _CTMUCON_IDISSEN_MASK                    0x00000200
#define _CTMUCON_IDISSEN_LENGTH                  0x00000001

#define _CTMUCON_EDGSEQEN_POSITION               0x0000000A
#define _CTMUCON_EDGSEQEN_MASK                   0x00000400
#define _CTMUCON_EDGSEQEN_LENGTH                 0x00000001

#define _CTMUCON_EDGEN_POSITION                  0x0000000B
#define _CTMUCON_EDGEN_MASK                      0x00000800
#define _CTMUCON_EDGEN_LENGTH                    0x00000001

#define _CTMUCON_TGEN_POSITION                   0x0000000C
#define _CTMUCON_TGEN_MASK                       0x00001000
#define _CTMUCON_TGEN_LENGTH                     0x00000001

#define _CTMUCON_CTMUSIDL_POSITION               0x0000000D
#define _CTMUCON_CTMUSIDL_MASK                   0x00002000
#define _CTMUCON_CTMUSIDL_LENGTH                 0x00000001

#define _CTMUCON_ON_POSITION                     0x0000000F
#define _CTMUCON_ON_MASK                         0x00008000
#define _CTMUCON_ON_LENGTH                       0x00000001

#define _CTMUCON_EDG2SEL_POSITION                0x00000012
#define _CTMUCON_EDG2SEL_MASK                    0x003C0000
#define _CTMUCON_EDG2SEL_LENGTH                  0x00000004

