CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _CNSTATD_w_POSITION                      0x00000000
#define _CNSTATD_w_MASK                          0xFFFFFFFF
#define _CNSTATD_w_LENGTH                        0x00000020

#define _CNNED_CNNED5_POSITION                   0x00000005
#define _CNNED_CNNED5_MASK                       0x00000020
#define _CNNED_CNNED5_LENGTH                     0x00000001

#define _CNNED_CNNED6_POSITION                   0x00000006
#define _CNNED_CNNED6_MASK                       0x00000040
#define _CNNED_CNNED6_LENGTH                     0x00000001

#define _CNNED_CNNED8_POSITION                   0x00000008
#define _CNNED_CNNED8_MASK                       0x00000100
#define _CNNED_CNNED8_LENGTH                     0x00000001

#define _CNFD_CNFD5_POSITION                     0x00000005
#define _CNFD_CNFD5_MASK                         0x00000020
#define _CNFD_CNFD5_LENGTH                       0x00000001

#define _CNFD_CNFD6_POSITION                     0x00000006
#define _CNFD_CNFD6_MASK                         0x00000040
#define _CNFD_CNFD6_LENGTH                       0x00000001

#define _CNFD_CNFD8_POSITION                     0x00000008
#define _CNFD_CNFD8_MASK                         0x00000100
#define _CNFD_CNFD8_LENGTH                       0x00000001

#define _SRCON0D_SR0D5_POSITION                  0x00000005
#define _SRCON0D_SR0D5_MASK                      0x00000020
#define _SRCON0D_SR0D5_LENGTH                    0x00000001

#define _SRCON0D_SR0D6_POSITION                  0x00000006
#define _SRCON0D_SR0D6_MASK                      0x00000040
#define _SRCON0D_SR0D6_LENGTH                    0x00000001

#define _SRCON0D_SR0D8_POSITION                  0x00000008
#define _SRCON0D_SR0D8_MASK                      0x00000100
#define _SRCON0D_SR0D8_LENGTH                    0x00000001

#define _SRCON1D_SR1D5_POSITION                  0x00000005
#define _SRCON1D_SR1D5_MASK                      0x00000020
#define _SRCON1D_SR1D5_LENGTH                    0x00000001

#define _SRCON1D_SR1D6_POSITION                  0x00000006
#define _SRCON1D_SR1D6_MASK                      0x00000040
#define _SRCON1D_SR1D6_LENGTH                    0x00000001

#define _SRCON1D_SR1D8_POSITION                  0x00000008
#define _SRCON1D_SR1D8_MASK                      0x00000100
#define _SRCON1D_SR1D8_LENGTH                    0x00000001

#define _ANSELE_ANSE12_POSITION                  0x0000000C
#define _ANSELE_ANSE12_MASK                      0x00001000
#define _ANSELE_ANSE12_LENGTH                    0x00000001

#define _ANSELE_ANSE13_POSITION                  0x0000000D
#define _ANSELE_ANSE13_MASK                      0x00002000
#define _ANSELE_ANSE13_LENGTH                    0x00000001

#define _ANSELE_ANSE14_POSITION                  0x0000000E
#define _ANSELE_ANSE14_MASK                      0x00004000
#define _ANSELE_ANSE14_LENGTH                    0x00000001

#define _ANSELE_ANSE15_POSITION                  0x0000000F
#define _ANSELE_ANSE15_MASK                      0x00008000
#define _ANSELE_ANSE15_LENGTH                    0x00000001

#define _ANSELE_w_POSITION                       0x00000000
#define _ANSELE_w_MASK                           0xFFFFFFFF
#define _ANSELE_w_LENGTH                         0x00000020

#define _TRISE_TRISE12_POSITION                  0x0000000C
#define _TRISE_TRISE12_MASK                      0x00001000
#define _TRISE_TRISE12_LENGTH                    0x00000001

#define _TRISE_TRISE13_POSITION                  0x0000000D
#define _TRISE_TRISE13_MASK                      0x00002000
#define _TRISE_TRISE13_LENGTH                    0x00000001

#define _TRISE_TRISE14_POSITION                  0x0000000E
#define _TRISE_TRISE14_MASK                      0x00004000
#define _TRISE_TRISE14_LENGTH                    0x00000001

#define _TRISE_TRISE15_POSITION                  0x0000000F
#define _TRISE_TRISE15_MASK                      0x00008000
#define _TRISE_TRISE15_LENGTH                    0x00000001

#define _TRISE_w_POSITION                        0x00000000
#define _TRISE_w_MASK                            0xFFFFFFFF
#define _TRISE_w_LENGTH                          0x00000020

#define _PORTE_RE12_POSITION                     0x0000000C
#define _PORTE_RE12_MASK                         0x00001000
#define _PORTE_RE12_LENGTH                       0x00000001

#define _PORTE_RE13_POSITION                     0x0000000D
#define _PORTE_RE13_MASK                         0x00002000
#define _PORTE_RE13_LENGTH                       0x00000001

#define _PORTE_RE14_POSITION                     0x0000000E
#define _PORTE_RE14_MASK                         0x00004000
#define _PORTE_RE14_LENGTH                       0x00000001

#define _PORTE_RE15_POSITION                     0x0000000F
#define _PORTE_RE15_MASK                         0x00008000
#define _PORTE_RE15_LENGTH                       0x00000001

#define _PORTE_w_POSITION                        0x00000000
#define _PORTE_w_MASK                            0xFFFFFFFF
#define _PORTE_w_LENGTH                          0x00000020

#define _LATE_LATE12_POSITION                    0x0000000C
#define _LATE_LATE12_MASK                        0x00001000
#define _LATE_LATE12_LENGTH                      0x00000001

#define _LATE_LATE13_POSITION                    0x0000000D
#define _LATE_LATE13_MASK                        0x00002000
#define _LATE_LATE13_LENGTH                      0x00000001

#define _LATE_LATE14_POSITION                    0x0000000E
#define _LATE_LATE14_MASK                        0x00004000
#define _LATE_LATE14_LENGTH                      0x00000001

#define _LATE_LATE15_POSITION                    0x0000000F
#define _LATE_LATE15_MASK                        0x00008000
#define _LATE_LATE15_LENGTH                      0x00000001

#define _LATE_w_POSITION                         0x00000000
#define _LATE_w_MASK                             0xFFFFFFFF
#define _LATE_w_LENGTH                           0x00000020

#define _ODCE_ODCE12_POSITION                    0x0000000C
#define _ODCE_ODCE12_MASK                        0x00001000
#define _ODCE_ODCE12_LENGTH                      0x00000001

#define _ODCE_ODCE13_POSITION                    0x0000000D
#define _ODCE_ODCE13_MASK                        0x00002000
#define _ODCE_ODCE13_LENGTH                      0x00000001

