CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _ODCE_ODCE14_POSITION                    0x0000000E
#define _ODCE_ODCE14_MASK                        0x00004000
#define _ODCE_ODCE14_LENGTH                      0x00000001

#define _ODCE_ODCE15_POSITION                    0x0000000F
#define _ODCE_ODCE15_MASK                        0x00008000
#define _ODCE_ODCE15_LENGTH                      0x00000001

#define _ODCE_w_POSITION                         0x00000000
#define _ODCE_w_MASK                             0xFFFFFFFF
#define _ODCE_w_LENGTH                           0x00000020

#define _CNPUE_CNPUE12_POSITION                  0x0000000C
#define _CNPUE_CNPUE12_MASK                      0x00001000
#define _CNPUE_CNPUE12_LENGTH                    0x00000001

#define _CNPUE_CNPUE13_POSITION                  0x0000000D
#define _CNPUE_CNPUE13_MASK                      0x00002000
#define _CNPUE_CNPUE13_LENGTH                    0x00000001

#define _CNPUE_CNPUE14_POSITION                  0x0000000E
#define _CNPUE_CNPUE14_MASK                      0x00004000
#define _CNPUE_CNPUE14_LENGTH                    0x00000001

#define _CNPUE_CNPUE15_POSITION                  0x0000000F
#define _CNPUE_CNPUE15_MASK                      0x00008000
#define _CNPUE_CNPUE15_LENGTH                    0x00000001

#define _CNPUE_w_POSITION                        0x00000000
#define _CNPUE_w_MASK                            0xFFFFFFFF
#define _CNPUE_w_LENGTH                          0x00000020

#define _CNPDE_CNPDE12_POSITION                  0x0000000C
#define _CNPDE_CNPDE12_MASK                      0x00001000
#define _CNPDE_CNPDE12_LENGTH                    0x00000001

#define _CNPDE_CNPDE13_POSITION                  0x0000000D
#define _CNPDE_CNPDE13_MASK                      0x00002000
#define _CNPDE_CNPDE13_LENGTH                    0x00000001

#define _CNPDE_CNPDE14_POSITION                  0x0000000E
#define _CNPDE_CNPDE14_MASK                      0x00004000
#define _CNPDE_CNPDE14_LENGTH                    0x00000001

#define _CNPDE_CNPDE15_POSITION                  0x0000000F
#define _CNPDE_CNPDE15_MASK                      0x00008000
#define _CNPDE_CNPDE15_LENGTH                    0x00000001

#define _CNPDE_w_POSITION                        0x00000000
#define _CNPDE_w_MASK                            0xFFFFFFFF
#define _CNPDE_w_LENGTH                          0x00000020

#define _CNCONE_EDGEDETECT_POSITION              0x0000000B
#define _CNCONE_EDGEDETECT_MASK                  0x00000800
#define _CNCONE_EDGEDETECT_LENGTH                0x00000001

#define _CNCONE_ON_POSITION                      0x0000000F
#define _CNCONE_ON_MASK                          0x00008000
#define _CNCONE_ON_LENGTH                        0x00000001

#define _CNCONE_w_POSITION                       0x00000000
#define _CNCONE_w_MASK                           0xFFFFFFFF
#define _CNCONE_w_LENGTH                         0x00000020

#define _CNENE_CNIEE12_POSITION                  0x0000000C
#define _CNENE_CNIEE12_MASK                      0x00001000
#define _CNENE_CNIEE12_LENGTH                    0x00000001

#define _CNENE_CNIEE13_POSITION                  0x0000000D
#define _CNENE_CNIEE13_MASK                      0x00002000
#define _CNENE_CNIEE13_LENGTH                    0x00000001

#define _CNENE_CNIEE14_POSITION                  0x0000000E
#define _CNENE_CNIEE14_MASK                      0x00004000
#define _CNENE_CNIEE14_LENGTH                    0x00000001

#define _CNENE_CNIEE15_POSITION                  0x0000000F
#define _CNENE_CNIEE15_MASK                      0x00008000
#define _CNENE_CNIEE15_LENGTH                    0x00000001

#define _CNENE_w_POSITION                        0x00000000
#define _CNENE_w_MASK                            0xFFFFFFFF
#define _CNENE_w_LENGTH                          0x00000020

#define _CNSTATE_CNSTATE12_POSITION              0x0000000C
#define _CNSTATE_CNSTATE12_MASK                  0x00001000
#define _CNSTATE_CNSTATE12_LENGTH                0x00000001

#define _CNSTATE_CNSTATE13_POSITION              0x0000000D
#define _CNSTATE_CNSTATE13_MASK                  0x00002000
#define _CNSTATE_CNSTATE13_LENGTH                0x00000001

#define _CNSTATE_CNSTATE14_POSITION              0x0000000E
#define _CNSTATE_CNSTATE14_MASK                  0x00004000
#define _CNSTATE_CNSTATE14_LENGTH                0x00000001

#define _CNSTATE_CNSTATE15_POSITION              0x0000000F
#define _CNSTATE_CNSTATE15_MASK                  0x00008000
#define _CNSTATE_CNSTATE15_LENGTH                0x00000001

#define _CNSTATE_w_POSITION                      0x00000000
#define _CNSTATE_w_MASK                          0xFFFFFFFF
#define _CNSTATE_w_LENGTH                        0x00000020

#define _CNNEE_CNNEE12_POSITION                  0x0000000C
#define _CNNEE_CNNEE12_MASK                      0x00001000
#define _CNNEE_CNNEE12_LENGTH                    0x00000001

#define _CNNEE_CNNEE13_POSITION                  0x0000000D
#define _CNNEE_CNNEE13_MASK                      0x00002000
#define _CNNEE_CNNEE13_LENGTH                    0x00000001

#define _CNNEE_CNNEE14_POSITION                  0x0000000E
#define _CNNEE_CNNEE14_MASK                      0x00004000
#define _CNNEE_CNNEE14_LENGTH                    0x00000001

#define _CNNEE_CNNEE15_POSITION                  0x0000000F
#define _CNNEE_CNNEE15_MASK                      0x00008000
#define _CNNEE_CNNEE15_LENGTH                    0x00000001

#define _CNFE_CNFE12_POSITION                    0x0000000C
#define _CNFE_CNFE12_MASK                        0x00001000
#define _CNFE_CNFE12_LENGTH                      0x00000001

#define _CNFE_CNFE13_POSITION                    0x0000000D
#define _CNFE_CNFE13_MASK                        0x00002000
#define _CNFE_CNFE13_LENGTH                      0x00000001

#define _CNFE_CNFE14_POSITION                    0x0000000E
#define _CNFE_CNFE14_MASK                        0x00004000
#define _CNFE_CNFE14_LENGTH                      0x00000001

#define _CNFE_CNFE15_POSITION                    0x0000000F
#define _CNFE_CNFE15_MASK                        0x00008000
#define _CNFE_CNFE15_LENGTH                      0x00000001

#define _SRCON0E_SR0E12_POSITION                 0x0000000C
#define _SRCON0E_SR0E12_MASK                     0x00001000
#define _SRCON0E_SR0E12_LENGTH                   0x00000001

#define _SRCON0E_SR0E13_POSITION                 0x0000000D
#define _SRCON0E_SR0E13_MASK                     0x00002000
#define _SRCON0E_SR0E13_LENGTH                   0x00000001

