CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _SRCON0G_SR0G10_POSITION                 0x0000000A
#define _SRCON0G_SR0G10_MASK                     0x00000400
#define _SRCON0G_SR0G10_LENGTH                   0x00000001

#define _SRCON0G_SR0G11_POSITION                 0x0000000B
#define _SRCON0G_SR0G11_MASK                     0x00000800
#define _SRCON0G_SR0G11_LENGTH                   0x00000001

#define _SRCON0G_SR0G12_POSITION                 0x0000000C
#define _SRCON0G_SR0G12_MASK                     0x00001000
#define _SRCON0G_SR0G12_LENGTH                   0x00000001

#define _SRCON0G_SR0G13_POSITION                 0x0000000D
#define _SRCON0G_SR0G13_MASK                     0x00002000
#define _SRCON0G_SR0G13_LENGTH                   0x00000001

#define _SRCON0G_SR0G14_POSITION                 0x0000000E
#define _SRCON0G_SR0G14_MASK                     0x00004000
#define _SRCON0G_SR0G14_LENGTH                   0x00000001

#define _SRCON0G_SR0G15_POSITION                 0x0000000F
#define _SRCON0G_SR0G15_MASK                     0x00008000
#define _SRCON0G_SR0G15_LENGTH                   0x00000001

#define _SRCON1G_SR1G0_POSITION                  0x00000000
#define _SRCON1G_SR1G0_MASK                      0x00000001
#define _SRCON1G_SR1G0_LENGTH                    0x00000001

#define _SRCON1G_SR1G1_POSITION                  0x00000001
#define _SRCON1G_SR1G1_MASK                      0x00000002
#define _SRCON1G_SR1G1_LENGTH                    0x00000001

#define _SRCON1G_SR1G2_POSITION                  0x00000002
#define _SRCON1G_SR1G2_MASK                      0x00000004
#define _SRCON1G_SR1G2_LENGTH                    0x00000001

#define _SRCON1G_SR1G3_POSITION                  0x00000003
#define _SRCON1G_SR1G3_MASK                      0x00000008
#define _SRCON1G_SR1G3_LENGTH                    0x00000001

#define _SRCON1G_SR1G4_POSITION                  0x00000004
#define _SRCON1G_SR1G4_MASK                      0x00000010
#define _SRCON1G_SR1G4_LENGTH                    0x00000001

#define _SRCON1G_SR1G5_POSITION                  0x00000005
#define _SRCON1G_SR1G5_MASK                      0x00000020
#define _SRCON1G_SR1G5_LENGTH                    0x00000001

#define _SRCON1G_SR1G6_POSITION                  0x00000006
#define _SRCON1G_SR1G6_MASK                      0x00000040
#define _SRCON1G_SR1G6_LENGTH                    0x00000001

#define _SRCON1G_SR1G7_POSITION                  0x00000007
#define _SRCON1G_SR1G7_MASK                      0x00000080
#define _SRCON1G_SR1G7_LENGTH                    0x00000001

#define _SRCON1G_SR1G8_POSITION                  0x00000008
#define _SRCON1G_SR1G8_MASK                      0x00000100
#define _SRCON1G_SR1G8_LENGTH                    0x00000001

#define _SRCON1G_SR1G9_POSITION                  0x00000009
#define _SRCON1G_SR1G9_MASK                      0x00000200
#define _SRCON1G_SR1G9_LENGTH                    0x00000001

#define _SRCON1G_SR1G10_POSITION                 0x0000000A
#define _SRCON1G_SR1G10_MASK                     0x00000400
#define _SRCON1G_SR1G10_LENGTH                   0x00000001

#define _SRCON1G_SR1G11_POSITION                 0x0000000B
#define _SRCON1G_SR1G11_MASK                     0x00000800
#define _SRCON1G_SR1G11_LENGTH                   0x00000001

#define _SRCON1G_SR1G12_POSITION                 0x0000000C
#define _SRCON1G_SR1G12_MASK                     0x00001000
#define _SRCON1G_SR1G12_LENGTH                   0x00000001

#define _SRCON1G_SR1G13_POSITION                 0x0000000D
#define _SRCON1G_SR1G13_MASK                     0x00002000
#define _SRCON1G_SR1G13_LENGTH                   0x00000001

#define _SRCON1G_SR1G14_POSITION                 0x0000000E
#define _SRCON1G_SR1G14_MASK                     0x00004000
#define _SRCON1G_SR1G14_LENGTH                   0x00000001

#define _SRCON1G_SR1G15_POSITION                 0x0000000F
#define _SRCON1G_SR1G15_MASK                     0x00008000
#define _SRCON1G_SR1G15_LENGTH                   0x00000001

#define _C1CON_DNCNT_POSITION                    0x00000000
#define _C1CON_DNCNT_MASK                        0x0000001F
#define _C1CON_DNCNT_LENGTH                      0x00000005

#define _C1CON_ISOCRCEN_POSITION                 0x00000005
#define _C1CON_ISOCRCEN_MASK                     0x00000020
#define _C1CON_ISOCRCEN_LENGTH                   0x00000001

#define _C1CON_PXEDIS_POSITION                   0x00000006
#define _C1CON_PXEDIS_MASK                       0x00000040
#define _C1CON_PXEDIS_LENGTH                     0x00000001

#define _C1CON_CLKSEL0_POSITION                  0x00000007
#define _C1CON_CLKSEL0_MASK                      0x00000080
#define _C1CON_CLKSEL0_LENGTH                    0x00000001

#define _C1CON_WAKFIL_POSITION                   0x00000008
#define _C1CON_WAKFIL_MASK                       0x00000100
#define _C1CON_WAKFIL_LENGTH                     0x00000001

#define _C1CON_WFT_POSITION                      0x00000009
#define _C1CON_WFT_MASK                          0x00000600
#define _C1CON_WFT_LENGTH                        0x00000002

#define _C1CON_CANBUSY_POSITION                  0x0000000B
#define _C1CON_CANBUSY_MASK                      0x00000800
#define _C1CON_CANBUSY_LENGTH                    0x00000001

#define _C1CON_BRSDIS_POSITION                   0x0000000C
#define _C1CON_BRSDIS_MASK                       0x00001000
#define _C1CON_BRSDIS_LENGTH                     0x00000001

#define _C1CON_SIDL_POSITION                     0x0000000D
#define _C1CON_SIDL_MASK                         0x00002000
#define _C1CON_SIDL_LENGTH                       0x00000001

#define _C1CON_ON_POSITION                       0x0000000F
#define _C1CON_ON_MASK                           0x00008000
#define _C1CON_ON_LENGTH                         0x00000001

#define _C1CON_RTXAT_POSITION                    0x00000010
#define _C1CON_RTXAT_MASK                        0x00010000
#define _C1CON_RTXAT_LENGTH                      0x00000001

#define _C1CON_ESIGM_POSITION                    0x00000011
#define _C1CON_ESIGM_MASK                        0x00020000
#define _C1CON_ESIGM_LENGTH                      0x00000001

#define _C1CON_SERR2LOM_POSITION                 0x00000012
#define _C1CON_SERR2LOM_MASK                     0x00040000
#define _C1CON_SERR2LOM_LENGTH                   0x00000001

#define _C1CON_STEF_POSITION                     0x00000013
#define _C1CON_STEF_MASK                         0x00080000
#define _C1CON_STEF_LENGTH                       0x00000001

#define _C1CON_TXQEN_POSITION                    0x00000014
#define _C1CON_TXQEN_MASK                        0x00100000
#define _C1CON_TXQEN_LENGTH                      0x00000001

#define _C1CON_OPMOD_POSITION                    0x00000015
#define _C1CON_OPMOD_MASK                        0x00E00000
#define _C1CON_OPMOD_LENGTH                      0x00000003

