CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1INT_WAKIF_POSITION                    0x0000000E
#define _C1INT_WAKIF_MASK                        0x00004000
#define _C1INT_WAKIF_LENGTH                      0x00000001

#define _C1INT_IVMIF_POSITION                    0x0000000F
#define _C1INT_IVMIF_MASK                        0x00008000
#define _C1INT_IVMIF_LENGTH                      0x00000001

#define _C1INT_TXIE_POSITION                     0x00000010
#define _C1INT_TXIE_MASK                         0x00010000
#define _C1INT_TXIE_LENGTH                       0x00000001

#define _C1INT_RXIE_POSITION                     0x00000011
#define _C1INT_RXIE_MASK                         0x00020000
#define _C1INT_RXIE_LENGTH                       0x00000001

#define _C1INT_TBCIE_POSITION                    0x00000012
#define _C1INT_TBCIE_MASK                        0x00040000
#define _C1INT_TBCIE_LENGTH                      0x00000001

#define _C1INT_MODIE_POSITION                    0x00000013
#define _C1INT_MODIE_MASK                        0x00080000
#define _C1INT_MODIE_LENGTH                      0x00000001

#define _C1INT_TEFIE_POSITION                    0x00000014
#define _C1INT_TEFIE_MASK                        0x00100000
#define _C1INT_TEFIE_LENGTH                      0x00000001

#define _C1INT_ECCIE_POSITION                    0x00000018
#define _C1INT_ECCIE_MASK                        0x01000000
#define _C1INT_ECCIE_LENGTH                      0x00000001

#define _C1INT_SPICRCIE_POSITION                 0x00000019
#define _C1INT_SPICRCIE_MASK                     0x02000000
#define _C1INT_SPICRCIE_LENGTH                   0x00000001

#define _C1INT_TXATIE_POSITION                   0x0000001A
#define _C1INT_TXATIE_MASK                       0x04000000
#define _C1INT_TXATIE_LENGTH                     0x00000001

#define _C1INT_RXOVIE_POSITION                   0x0000001B
#define _C1INT_RXOVIE_MASK                       0x08000000
#define _C1INT_RXOVIE_LENGTH                     0x00000001

#define _C1INT_SERRIE_POSITION                   0x0000001C
#define _C1INT_SERRIE_MASK                       0x10000000
#define _C1INT_SERRIE_LENGTH                     0x00000001

#define _C1INT_CERRIE_POSITION                   0x0000001D
#define _C1INT_CERRIE_MASK                       0x20000000
#define _C1INT_CERRIE_LENGTH                     0x00000001

#define _C1INT_WAKIE_POSITION                    0x0000001E
#define _C1INT_WAKIE_MASK                        0x40000000
#define _C1INT_WAKIE_LENGTH                      0x00000001

#define _C1INT_IVMIE_POSITION                    0x0000001F
#define _C1INT_IVMIE_MASK                        0x80000000
#define _C1INT_IVMIE_LENGTH                      0x00000001

#define _C1INT_w_POSITION                        0x00000000
#define _C1INT_w_MASK                            0xFFFFFFFF
#define _C1INT_w_LENGTH                          0x00000020

#define _C1RXIF_RFIF_POSITION                    0x00000001
#define _C1RXIF_RFIF_MASK                        0xFFFFFFFE
#define _C1RXIF_RFIF_LENGTH                      0x0000001F

#define _C1TXIF_TFIF_POSITION                    0x00000000
#define _C1TXIF_TFIF_MASK                        0xFFFFFFFF
#define _C1TXIF_TFIF_LENGTH                      0x00000020

#define _C1RXOVIF_RFOVIF_POSITION                0x00000001
#define _C1RXOVIF_RFOVIF_MASK                    0xFFFFFFFE
#define _C1RXOVIF_RFOVIF_LENGTH                  0x0000001F

#define _C1TXATIF_TFATIF_POSITION                0x00000000
#define _C1TXATIF_TFATIF_MASK                    0xFFFFFFFF
#define _C1TXATIF_TFATIF_LENGTH                  0x00000020

#define _C1TXREQ_TXREQ_POSITION                  0x00000000
#define _C1TXREQ_TXREQ_MASK                      0xFFFFFFFF
#define _C1TXREQ_TXREQ_LENGTH                    0x00000020

#define _C1TREC_RERRCNT_POSITION                 0x00000000
#define _C1TREC_RERRCNT_MASK                     0x000000FF
#define _C1TREC_RERRCNT_LENGTH                   0x00000008

#define _C1TREC_TERRCNT_POSITION                 0x00000008
#define _C1TREC_TERRCNT_MASK                     0x0000FF00
#define _C1TREC_TERRCNT_LENGTH                   0x00000008

#define _C1TREC_EWARN_POSITION                   0x00000010
#define _C1TREC_EWARN_MASK                       0x00010000
#define _C1TREC_EWARN_LENGTH                     0x00000001

#define _C1TREC_RXWARN_POSITION                  0x00000011
#define _C1TREC_RXWARN_MASK                      0x00020000
#define _C1TREC_RXWARN_LENGTH                    0x00000001

#define _C1TREC_TXWARN_POSITION                  0x00000012
#define _C1TREC_TXWARN_MASK                      0x00040000
#define _C1TREC_TXWARN_LENGTH                    0x00000001

#define _C1TREC_RXBP_POSITION                    0x00000013
#define _C1TREC_RXBP_MASK                        0x00080000
#define _C1TREC_RXBP_LENGTH                      0x00000001

#define _C1TREC_TXBP_POSITION                    0x00000014
#define _C1TREC_TXBP_MASK                        0x00100000
#define _C1TREC_TXBP_LENGTH                      0x00000001

#define _C1TREC_TXBO_POSITION                    0x00000015
#define _C1TREC_TXBO_MASK                        0x00200000
#define _C1TREC_TXBO_LENGTH                      0x00000001

#define _C1TREC_w_POSITION                       0x00000000
#define _C1TREC_w_MASK                           0xFFFFFFFF
#define _C1TREC_w_LENGTH                         0x00000020

#define _C1BDIAG0_NRERRCNT_POSITION              0x00000000
#define _C1BDIAG0_NRERRCNT_MASK                  0x000000FF
#define _C1BDIAG0_NRERRCNT_LENGTH                0x00000008

#define _C1BDIAG0_NTERRCNT_POSITION              0x00000008
#define _C1BDIAG0_NTERRCNT_MASK                  0x0000FF00
#define _C1BDIAG0_NTERRCNT_LENGTH                0x00000008

#define _C1BDIAG0_DRERRCNT_POSITION              0x00000010
#define _C1BDIAG0_DRERRCNT_MASK                  0x00FF0000
#define _C1BDIAG0_DRERRCNT_LENGTH                0x00000008

#define _C1BDIAG0_DTERRCNT_POSITION              0x00000018
#define _C1BDIAG0_DTERRCNT_MASK                  0xFF000000
#define _C1BDIAG0_DTERRCNT_LENGTH                0x00000008

#define _C1BDIAG1_EFMSGCNT_POSITION              0x00000000
#define _C1BDIAG1_EFMSGCNT_MASK                  0x0000FFFF
#define _C1BDIAG1_EFMSGCNT_LENGTH                0x00000010

#define _C1BDIAG1_NBIT0ERR_POSITION              0x00000010
#define _C1BDIAG1_NBIT0ERR_MASK                  0x00010000
#define _C1BDIAG1_NBIT0ERR_LENGTH                0x00000001

#define _C1BDIAG1_NBIT1ERR_POSITION              0x00000011
#define _C1BDIAG1_NBIT1ERR_MASK                  0x00020000
#define _C1BDIAG1_NBIT1ERR_LENGTH                0x00000001

#define _C1BDIAG1_NACKERR_POSITION               0x00000012
#define _C1BDIAG1_NACKERR_MASK                   0x00040000
#define _C1BDIAG1_NACKERR_LENGTH                 0x00000001

#define _C1BDIAG1_NFORMERR_POSITION              0x00000013
#define _C1BDIAG1_NFORMERR_MASK                  0x00080000
#define _C1BDIAG1_NFORMERR_LENGTH                0x00000001

#define _C1BDIAG1_NSTUFERR_POSITION              0x00000014
#define _C1BDIAG1_NSTUFERR_MASK                  0x00100000
#define _C1BDIAG1_NSTUFERR_LENGTH                0x00000001

