CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1BDIAG1_NCRCERR_POSITION               0x00000015
#define _C1BDIAG1_NCRCERR_MASK                   0x00200000
#define _C1BDIAG1_NCRCERR_LENGTH                 0x00000001

#define _C1BDIAG1_DBIT0ERR_POSITION              0x00000018
#define _C1BDIAG1_DBIT0ERR_MASK                  0x01000000
#define _C1BDIAG1_DBIT0ERR_LENGTH                0x00000001

#define _C1BDIAG1_DBIT1ERR_POSITION              0x00000019
#define _C1BDIAG1_DBIT1ERR_MASK                  0x02000000
#define _C1BDIAG1_DBIT1ERR_LENGTH                0x00000001

#define _C1BDIAG1_DFORMERR_POSITION              0x0000001B
#define _C1BDIAG1_DFORMERR_MASK                  0x08000000
#define _C1BDIAG1_DFORMERR_LENGTH                0x00000001

#define _C1BDIAG1_DSTUFERR_POSITION              0x0000001C
#define _C1BDIAG1_DSTUFERR_MASK                  0x10000000
#define _C1BDIAG1_DSTUFERR_LENGTH                0x00000001

#define _C1BDIAG1_DCRCERR_POSITION               0x0000001D
#define _C1BDIAG1_DCRCERR_MASK                   0x20000000
#define _C1BDIAG1_DCRCERR_LENGTH                 0x00000001

#define _C1BDIAG1_ESI_POSITION                   0x0000001E
#define _C1BDIAG1_ESI_MASK                       0x40000000
#define _C1BDIAG1_ESI_LENGTH                     0x00000001

#define _C1BDIAG1_DLCMM_POSITION                 0x0000001F
#define _C1BDIAG1_DLCMM_MASK                     0x80000000
#define _C1BDIAG1_DLCMM_LENGTH                   0x00000001

#define _C1TEFCON_TEFNEIE_POSITION               0x00000000
#define _C1TEFCON_TEFNEIE_MASK                   0x00000001
#define _C1TEFCON_TEFNEIE_LENGTH                 0x00000001

#define _C1TEFCON_TEFHIE_POSITION                0x00000001
#define _C1TEFCON_TEFHIE_MASK                    0x00000002
#define _C1TEFCON_TEFHIE_LENGTH                  0x00000001

#define _C1TEFCON_TEFFIE_POSITION                0x00000002
#define _C1TEFCON_TEFFIE_MASK                    0x00000004
#define _C1TEFCON_TEFFIE_LENGTH                  0x00000001

#define _C1TEFCON_TEFOVIE_POSITION               0x00000003
#define _C1TEFCON_TEFOVIE_MASK                   0x00000008
#define _C1TEFCON_TEFOVIE_LENGTH                 0x00000001

#define _C1TEFCON_TEFTSEN_POSITION               0x00000005
#define _C1TEFCON_TEFTSEN_MASK                   0x00000020
#define _C1TEFCON_TEFTSEN_LENGTH                 0x00000001

#define _C1TEFCON_UINC_POSITION                  0x00000008
#define _C1TEFCON_UINC_MASK                      0x00000100
#define _C1TEFCON_UINC_LENGTH                    0x00000001

#define _C1TEFCON_FRESET_POSITION                0x0000000A
#define _C1TEFCON_FRESET_MASK                    0x00000400
#define _C1TEFCON_FRESET_LENGTH                  0x00000001

#define _C1TEFCON_FSIZE_POSITION                 0x00000018
#define _C1TEFCON_FSIZE_MASK                     0x1F000000
#define _C1TEFCON_FSIZE_LENGTH                   0x00000005

#define _C1TEFSTA_TEFNEIF_POSITION               0x00000000
#define _C1TEFSTA_TEFNEIF_MASK                   0x00000001
#define _C1TEFSTA_TEFNEIF_LENGTH                 0x00000001

#define _C1TEFSTA_TEFHIF_POSITION                0x00000001
#define _C1TEFSTA_TEFHIF_MASK                    0x00000002
#define _C1TEFSTA_TEFHIF_LENGTH                  0x00000001

#define _C1TEFSTA_TEFFIF_POSITION                0x00000002
#define _C1TEFSTA_TEFFIF_MASK                    0x00000004
#define _C1TEFSTA_TEFFIF_LENGTH                  0x00000001

#define _C1TEFSTA_TEFOVIF_POSITION               0x00000003
#define _C1TEFSTA_TEFOVIF_MASK                   0x00000008
#define _C1TEFSTA_TEFOVIF_LENGTH                 0x00000001

#define _C1TEFUA_TEFUA_POSITION                  0x00000000
#define _C1TEFUA_TEFUA_MASK                      0xFFFFFFFF
#define _C1TEFUA_TEFUA_LENGTH                    0x00000020

#define _C1FIFOBA_FIFOBA_POSITION                0x00000000
#define _C1FIFOBA_FIFOBA_MASK                    0xFFFFFFFF
#define _C1FIFOBA_FIFOBA_LENGTH                  0x00000020

#define _C1TXQCON_TXQNIE_POSITION                0x00000000
#define _C1TXQCON_TXQNIE_MASK                    0x00000001
#define _C1TXQCON_TXQNIE_LENGTH                  0x00000001

#define _C1TXQCON_TXQEIE_POSITION                0x00000002
#define _C1TXQCON_TXQEIE_MASK                    0x00000004
#define _C1TXQCON_TXQEIE_LENGTH                  0x00000001

#define _C1TXQCON_TXATIE_POSITION                0x00000004
#define _C1TXQCON_TXATIE_MASK                    0x00000010
#define _C1TXQCON_TXATIE_LENGTH                  0x00000001

#define _C1TXQCON_TXEN_POSITION                  0x00000007
#define _C1TXQCON_TXEN_MASK                      0x00000080
#define _C1TXQCON_TXEN_LENGTH                    0x00000001

#define _C1TXQCON_UINC_POSITION                  0x00000008
#define _C1TXQCON_UINC_MASK                      0x00000100
#define _C1TXQCON_UINC_LENGTH                    0x00000001

#define _C1TXQCON_TXREQ_POSITION                 0x00000009
#define _C1TXQCON_TXREQ_MASK                     0x00000200
#define _C1TXQCON_TXREQ_LENGTH                   0x00000001

#define _C1TXQCON_FRESET_POSITION                0x0000000A
#define _C1TXQCON_FRESET_MASK                    0x00000400
#define _C1TXQCON_FRESET_LENGTH                  0x00000001

#define _C1TXQCON_TXPRI_POSITION                 0x00000010
#define _C1TXQCON_TXPRI_MASK                     0x001F0000
#define _C1TXQCON_TXPRI_LENGTH                   0x00000005

#define _C1TXQCON_TXAT_POSITION                  0x00000015
#define _C1TXQCON_TXAT_MASK                      0x00600000
#define _C1TXQCON_TXAT_LENGTH                    0x00000002

#define _C1TXQCON_FSIZE_POSITION                 0x00000018
#define _C1TXQCON_FSIZE_MASK                     0x1F000000
#define _C1TXQCON_FSIZE_LENGTH                   0x00000005

#define _C1TXQCON_PLSIZE_POSITION                0x0000001D
#define _C1TXQCON_PLSIZE_MASK                    0xE0000000
#define _C1TXQCON_PLSIZE_LENGTH                  0x00000003

#define _C1TXQSTA_TXQNIF_POSITION                0x00000000
#define _C1TXQSTA_TXQNIF_MASK                    0x00000001
#define _C1TXQSTA_TXQNIF_LENGTH                  0x00000001

#define _C1TXQSTA_TXQEIF_POSITION                0x00000002
#define _C1TXQSTA_TXQEIF_MASK                    0x00000004
#define _C1TXQSTA_TXQEIF_LENGTH                  0x00000001

#define _C1TXQSTA_TXATIF_POSITION                0x00000004
#define _C1TXQSTA_TXATIF_MASK                    0x00000010
#define _C1TXQSTA_TXATIF_LENGTH                  0x00000001

#define _C1TXQSTA_TXERR_POSITION                 0x00000005
#define _C1TXQSTA_TXERR_MASK                     0x00000020
#define _C1TXQSTA_TXERR_LENGTH                   0x00000001

#define _C1TXQSTA_TXLARB_POSITION                0x00000006
#define _C1TXQSTA_TXLARB_MASK                    0x00000040
#define _C1TXQSTA_TXLARB_LENGTH                  0x00000001

#define _C1TXQSTA_TXABT_POSITION                 0x00000007
#define _C1TXQSTA_TXABT_MASK                     0x00000080
#define _C1TXQSTA_TXABT_LENGTH                   0x00000001

#define _C1TXQSTA_TXQCI_POSITION                 0x00000008
#define _C1TXQSTA_TXQCI_MASK                     0x00001F00
#define _C1TXQSTA_TXQCI_LENGTH                   0x00000005

