CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOSTA3_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA3_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA3_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA3_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA3_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA3_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA3_TXERR_POSITION               0x00000005
#define _C1FIFOSTA3_TXERR_MASK                   0x00000020
#define _C1FIFOSTA3_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA3_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA3_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA3_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA3_TXABT_POSITION               0x00000007
#define _C1FIFOSTA3_TXABT_MASK                   0x00000080
#define _C1FIFOSTA3_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA3_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA3_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA3_FIFOCI_LENGTH                0x00000005

#define _C1FIFOUA3_FIFOUA_POSITION               0x00000000
#define _C1FIFOUA3_FIFOUA_MASK                   0xFFFFFFFF
#define _C1FIFOUA3_FIFOUA_LENGTH                 0x00000020

#define _C1FIFOCON4_TFNRFNIE_POSITION            0x00000000
#define _C1FIFOCON4_TFNRFNIE_MASK                0x00000001
#define _C1FIFOCON4_TFNRFNIE_LENGTH              0x00000001

#define _C1FIFOCON4_TFHRFHIE_POSITION            0x00000001
#define _C1FIFOCON4_TFHRFHIE_MASK                0x00000002
#define _C1FIFOCON4_TFHRFHIE_LENGTH              0x00000001

#define _C1FIFOCON4_TFERFFIE_POSITION            0x00000002
#define _C1FIFOCON4_TFERFFIE_MASK                0x00000004
#define _C1FIFOCON4_TFERFFIE_LENGTH              0x00000001

#define _C1FIFOCON4_RXOVIE_POSITION              0x00000003
#define _C1FIFOCON4_RXOVIE_MASK                  0x00000008
#define _C1FIFOCON4_RXOVIE_LENGTH                0x00000001

#define _C1FIFOCON4_TXATIE_POSITION              0x00000004
#define _C1FIFOCON4_TXATIE_MASK                  0x00000010
#define _C1FIFOCON4_TXATIE_LENGTH                0x00000001

#define _C1FIFOCON4_RXTSEN_POSITION              0x00000005
#define _C1FIFOCON4_RXTSEN_MASK                  0x00000020
#define _C1FIFOCON4_RXTSEN_LENGTH                0x00000001

#define _C1FIFOCON4_RTREN_POSITION               0x00000006
#define _C1FIFOCON4_RTREN_MASK                   0x00000040
#define _C1FIFOCON4_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON4_TXEN_POSITION                0x00000007
#define _C1FIFOCON4_TXEN_MASK                    0x00000080
#define _C1FIFOCON4_TXEN_LENGTH                  0x00000001

#define _C1FIFOCON4_UINC_POSITION                0x00000008
#define _C1FIFOCON4_UINC_MASK                    0x00000100
#define _C1FIFOCON4_UINC_LENGTH                  0x00000001

#define _C1FIFOCON4_TXREQ_POSITION               0x00000009
#define _C1FIFOCON4_TXREQ_MASK                   0x00000200
#define _C1FIFOCON4_TXREQ_LENGTH                 0x00000001

#define _C1FIFOCON4_FRESET_POSITION              0x0000000A
#define _C1FIFOCON4_FRESET_MASK                  0x00000400
#define _C1FIFOCON4_FRESET_LENGTH                0x00000001

#define _C1FIFOCON4_TXPRI_POSITION               0x00000010
#define _C1FIFOCON4_TXPRI_MASK                   0x001F0000
#define _C1FIFOCON4_TXPRI_LENGTH                 0x00000005

#define _C1FIFOCON4_TXAT_POSITION                0x00000015
#define _C1FIFOCON4_TXAT_MASK                    0x00600000
#define _C1FIFOCON4_TXAT_LENGTH                  0x00000002

#define _C1FIFOCON4_FSIZE_POSITION               0x00000018
#define _C1FIFOCON4_FSIZE_MASK                   0x1F000000
#define _C1FIFOCON4_FSIZE_LENGTH                 0x00000005

#define _C1FIFOCON4_PLSIZE_POSITION              0x0000001D
#define _C1FIFOCON4_PLSIZE_MASK                  0xE0000000
#define _C1FIFOCON4_PLSIZE_LENGTH                0x00000003

#define _C1FIFOSTA4_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA4_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA4_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA4_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA4_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA4_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA4_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA4_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA4_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA4_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA4_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA4_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA4_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA4_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA4_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA4_TXERR_POSITION               0x00000005
#define _C1FIFOSTA4_TXERR_MASK                   0x00000020
#define _C1FIFOSTA4_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA4_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA4_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA4_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA4_TXABT_POSITION               0x00000007
#define _C1FIFOSTA4_TXABT_MASK                   0x00000080
#define _C1FIFOSTA4_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA4_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA4_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA4_FIFOCI_LENGTH                0x00000005

#define _C1FIFOUA4_FIFOUA_POSITION               0x00000000
#define _C1FIFOUA4_FIFOUA_MASK                   0xFFFFFFFF
#define _C1FIFOUA4_FIFOUA_LENGTH                 0x00000020

#define _C1FIFOCON5_TFNRFNIE_POSITION            0x00000000
#define _C1FIFOCON5_TFNRFNIE_MASK                0x00000001
#define _C1FIFOCON5_TFNRFNIE_LENGTH              0x00000001

#define _C1FIFOCON5_TFHRFHIE_POSITION            0x00000001
#define _C1FIFOCON5_TFHRFHIE_MASK                0x00000002
#define _C1FIFOCON5_TFHRFHIE_LENGTH              0x00000001

