CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOCON5_TFERFFIE_POSITION            0x00000002
#define _C1FIFOCON5_TFERFFIE_MASK                0x00000004
#define _C1FIFOCON5_TFERFFIE_LENGTH              0x00000001

#define _C1FIFOCON5_RXOVIE_POSITION              0x00000003
#define _C1FIFOCON5_RXOVIE_MASK                  0x00000008
#define _C1FIFOCON5_RXOVIE_LENGTH                0x00000001

#define _C1FIFOCON5_TXATIE_POSITION              0x00000004
#define _C1FIFOCON5_TXATIE_MASK                  0x00000010
#define _C1FIFOCON5_TXATIE_LENGTH                0x00000001

#define _C1FIFOCON5_RXTSEN_POSITION              0x00000005
#define _C1FIFOCON5_RXTSEN_MASK                  0x00000020
#define _C1FIFOCON5_RXTSEN_LENGTH                0x00000001

#define _C1FIFOCON5_RTREN_POSITION               0x00000006
#define _C1FIFOCON5_RTREN_MASK                   0x00000040
#define _C1FIFOCON5_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON5_TXEN_POSITION                0x00000007
#define _C1FIFOCON5_TXEN_MASK                    0x00000080
#define _C1FIFOCON5_TXEN_LENGTH                  0x00000001

#define _C1FIFOCON5_UINC_POSITION                0x00000008
#define _C1FIFOCON5_UINC_MASK                    0x00000100
#define _C1FIFOCON5_UINC_LENGTH                  0x00000001

#define _C1FIFOCON5_TXREQ_POSITION               0x00000009
#define _C1FIFOCON5_TXREQ_MASK                   0x00000200
#define _C1FIFOCON5_TXREQ_LENGTH                 0x00000001

#define _C1FIFOCON5_FRESET_POSITION              0x0000000A
#define _C1FIFOCON5_FRESET_MASK                  0x00000400
#define _C1FIFOCON5_FRESET_LENGTH                0x00000001

#define _C1FIFOCON5_TXPRI_POSITION               0x00000010
#define _C1FIFOCON5_TXPRI_MASK                   0x001F0000
#define _C1FIFOCON5_TXPRI_LENGTH                 0x00000005

#define _C1FIFOCON5_TXAT_POSITION                0x00000015
#define _C1FIFOCON5_TXAT_MASK                    0x00600000
#define _C1FIFOCON5_TXAT_LENGTH                  0x00000002

#define _C1FIFOCON5_FSIZE_POSITION               0x00000018
#define _C1FIFOCON5_FSIZE_MASK                   0x1F000000
#define _C1FIFOCON5_FSIZE_LENGTH                 0x00000005

#define _C1FIFOCON5_PLSIZE_POSITION              0x0000001D
#define _C1FIFOCON5_PLSIZE_MASK                  0xE0000000
#define _C1FIFOCON5_PLSIZE_LENGTH                0x00000003

#define _C1FIFOSTA5_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA5_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA5_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA5_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA5_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA5_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA5_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA5_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA5_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA5_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA5_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA5_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA5_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA5_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA5_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA5_TXERR_POSITION               0x00000005
#define _C1FIFOSTA5_TXERR_MASK                   0x00000020
#define _C1FIFOSTA5_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA5_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA5_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA5_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA5_TXABT_POSITION               0x00000007
#define _C1FIFOSTA5_TXABT_MASK                   0x00000080
#define _C1FIFOSTA5_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA5_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA5_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA5_FIFOCI_LENGTH                0x00000005

#define _C1FIFOUA5_FIFOUA_POSITION               0x00000000
#define _C1FIFOUA5_FIFOUA_MASK                   0xFFFFFFFF
#define _C1FIFOUA5_FIFOUA_LENGTH                 0x00000020

#define _C1FIFOCON6_TFNRFNIE_POSITION            0x00000000
#define _C1FIFOCON6_TFNRFNIE_MASK                0x00000001
#define _C1FIFOCON6_TFNRFNIE_LENGTH              0x00000001

#define _C1FIFOCON6_TFHRFHIE_POSITION            0x00000001
#define _C1FIFOCON6_TFHRFHIE_MASK                0x00000002
#define _C1FIFOCON6_TFHRFHIE_LENGTH              0x00000001

#define _C1FIFOCON6_TFERFFIE_POSITION            0x00000002
#define _C1FIFOCON6_TFERFFIE_MASK                0x00000004
#define _C1FIFOCON6_TFERFFIE_LENGTH              0x00000001

#define _C1FIFOCON6_RXOVIE_POSITION              0x00000003
#define _C1FIFOCON6_RXOVIE_MASK                  0x00000008
#define _C1FIFOCON6_RXOVIE_LENGTH                0x00000001

#define _C1FIFOCON6_TXATIE_POSITION              0x00000004
#define _C1FIFOCON6_TXATIE_MASK                  0x00000010
#define _C1FIFOCON6_TXATIE_LENGTH                0x00000001

#define _C1FIFOCON6_RXTSEN_POSITION              0x00000005
#define _C1FIFOCON6_RXTSEN_MASK                  0x00000020
#define _C1FIFOCON6_RXTSEN_LENGTH                0x00000001

#define _C1FIFOCON6_RTREN_POSITION               0x00000006
#define _C1FIFOCON6_RTREN_MASK                   0x00000040
#define _C1FIFOCON6_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON6_TXEN_POSITION                0x00000007
#define _C1FIFOCON6_TXEN_MASK                    0x00000080
#define _C1FIFOCON6_TXEN_LENGTH                  0x00000001

#define _C1FIFOCON6_UINC_POSITION                0x00000008
#define _C1FIFOCON6_UINC_MASK                    0x00000100
#define _C1FIFOCON6_UINC_LENGTH                  0x00000001

#define _C1FIFOCON6_TXREQ_POSITION               0x00000009
#define _C1FIFOCON6_TXREQ_MASK                   0x00000200
#define _C1FIFOCON6_TXREQ_LENGTH                 0x00000001

#define _C1FIFOCON6_FRESET_POSITION              0x0000000A
#define _C1FIFOCON6_FRESET_MASK                  0x00000400
#define _C1FIFOCON6_FRESET_LENGTH                0x00000001

