CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOCON6_TXPRI_POSITION               0x00000010
#define _C1FIFOCON6_TXPRI_MASK                   0x001F0000
#define _C1FIFOCON6_TXPRI_LENGTH                 0x00000005

#define _C1FIFOCON6_TXAT_POSITION                0x00000015
#define _C1FIFOCON6_TXAT_MASK                    0x00600000
#define _C1FIFOCON6_TXAT_LENGTH                  0x00000002

#define _C1FIFOCON6_FSIZE_POSITION               0x00000018
#define _C1FIFOCON6_FSIZE_MASK                   0x1F000000
#define _C1FIFOCON6_FSIZE_LENGTH                 0x00000005

#define _C1FIFOCON6_PLSIZE_POSITION              0x0000001D
#define _C1FIFOCON6_PLSIZE_MASK                  0xE0000000
#define _C1FIFOCON6_PLSIZE_LENGTH                0x00000003

#define _C1FIFOSTA6_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA6_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA6_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA6_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA6_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA6_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA6_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA6_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA6_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA6_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA6_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA6_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA6_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA6_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA6_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA6_TXERR_POSITION               0x00000005
#define _C1FIFOSTA6_TXERR_MASK                   0x00000020
#define _C1FIFOSTA6_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA6_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA6_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA6_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA6_TXABT_POSITION               0x00000007
#define _C1FIFOSTA6_TXABT_MASK                   0x00000080
#define _C1FIFOSTA6_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA6_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA6_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA6_FIFOCI_LENGTH                0x00000005

#define _C1FIFOUA6_FIFOUA_POSITION               0x00000000
#define _C1FIFOUA6_FIFOUA_MASK                   0xFFFFFFFF
#define _C1FIFOUA6_FIFOUA_LENGTH                 0x00000020

#define _C1FIFOCON7_TFNRFNIE_POSITION            0x00000000
#define _C1FIFOCON7_TFNRFNIE_MASK                0x00000001
#define _C1FIFOCON7_TFNRFNIE_LENGTH              0x00000001

#define _C1FIFOCON7_TFHRFHIE_POSITION            0x00000001
#define _C1FIFOCON7_TFHRFHIE_MASK                0x00000002
#define _C1FIFOCON7_TFHRFHIE_LENGTH              0x00000001

#define _C1FIFOCON7_TFERFFIE_POSITION            0x00000002
#define _C1FIFOCON7_TFERFFIE_MASK                0x00000004
#define _C1FIFOCON7_TFERFFIE_LENGTH              0x00000001

#define _C1FIFOCON7_RXOVIE_POSITION              0x00000003
#define _C1FIFOCON7_RXOVIE_MASK                  0x00000008
#define _C1FIFOCON7_RXOVIE_LENGTH                0x00000001

#define _C1FIFOCON7_TXATIE_POSITION              0x00000004
#define _C1FIFOCON7_TXATIE_MASK                  0x00000010
#define _C1FIFOCON7_TXATIE_LENGTH                0x00000001

#define _C1FIFOCON7_RXTSEN_POSITION              0x00000005
#define _C1FIFOCON7_RXTSEN_MASK                  0x00000020
#define _C1FIFOCON7_RXTSEN_LENGTH                0x00000001

#define _C1FIFOCON7_RTREN_POSITION               0x00000006
#define _C1FIFOCON7_RTREN_MASK                   0x00000040
#define _C1FIFOCON7_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON7_TXEN_POSITION                0x00000007
#define _C1FIFOCON7_TXEN_MASK                    0x00000080
#define _C1FIFOCON7_TXEN_LENGTH                  0x00000001

#define _C1FIFOCON7_UINC_POSITION                0x00000008
#define _C1FIFOCON7_UINC_MASK                    0x00000100
#define _C1FIFOCON7_UINC_LENGTH                  0x00000001

#define _C1FIFOCON7_TXREQ_POSITION               0x00000009
#define _C1FIFOCON7_TXREQ_MASK                   0x00000200
#define _C1FIFOCON7_TXREQ_LENGTH                 0x00000001

#define _C1FIFOCON7_FRESET_POSITION              0x0000000A
#define _C1FIFOCON7_FRESET_MASK                  0x00000400
#define _C1FIFOCON7_FRESET_LENGTH                0x00000001

#define _C1FIFOCON7_TXPRI_POSITION               0x00000010
#define _C1FIFOCON7_TXPRI_MASK                   0x001F0000
#define _C1FIFOCON7_TXPRI_LENGTH                 0x00000005

#define _C1FIFOCON7_TXAT_POSITION                0x00000015
#define _C1FIFOCON7_TXAT_MASK                    0x00600000
#define _C1FIFOCON7_TXAT_LENGTH                  0x00000002

#define _C1FIFOCON7_FSIZE_POSITION               0x00000018
#define _C1FIFOCON7_FSIZE_MASK                   0x1F000000
#define _C1FIFOCON7_FSIZE_LENGTH                 0x00000005

#define _C1FIFOCON7_PLSIZE_POSITION              0x0000001D
#define _C1FIFOCON7_PLSIZE_MASK                  0xE0000000
#define _C1FIFOCON7_PLSIZE_LENGTH                0x00000003

#define _C1FIFOSTA7_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA7_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA7_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA7_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA7_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA7_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA7_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA7_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA7_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA7_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA7_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA7_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA7_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA7_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA7_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA7_TXERR_POSITION               0x00000005
#define _C1FIFOSTA7_TXERR_MASK                   0x00000020
#define _C1FIFOSTA7_TXERR_LENGTH                 0x00000001

