CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOSTA7_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA7_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA7_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA7_TXABT_POSITION               0x00000007
#define _C1FIFOSTA7_TXABT_MASK                   0x00000080
#define _C1FIFOSTA7_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA7_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA7_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA7_FIFOCI_LENGTH                0x00000005

#define _C1FIFOUA7_FIFOUA_POSITION               0x00000000
#define _C1FIFOUA7_FIFOUA_MASK                   0xFFFFFFFF
#define _C1FIFOUA7_FIFOUA_LENGTH                 0x00000020

#define _C1FIFOCON8_TFNRFNIE_POSITION            0x00000000
#define _C1FIFOCON8_TFNRFNIE_MASK                0x00000001
#define _C1FIFOCON8_TFNRFNIE_LENGTH              0x00000001

#define _C1FIFOCON8_TFHRFHIE_POSITION            0x00000001
#define _C1FIFOCON8_TFHRFHIE_MASK                0x00000002
#define _C1FIFOCON8_TFHRFHIE_LENGTH              0x00000001

#define _C1FIFOCON8_TFERFFIE_POSITION            0x00000002
#define _C1FIFOCON8_TFERFFIE_MASK                0x00000004
#define _C1FIFOCON8_TFERFFIE_LENGTH              0x00000001

#define _C1FIFOCON8_RXOVIE_POSITION              0x00000003
#define _C1FIFOCON8_RXOVIE_MASK                  0x00000008
#define _C1FIFOCON8_RXOVIE_LENGTH                0x00000001

#define _C1FIFOCON8_TXATIE_POSITION              0x00000004
#define _C1FIFOCON8_TXATIE_MASK                  0x00000010
#define _C1FIFOCON8_TXATIE_LENGTH                0x00000001

#define _C1FIFOCON8_RXTSEN_POSITION              0x00000005
#define _C1FIFOCON8_RXTSEN_MASK                  0x00000020
#define _C1FIFOCON8_RXTSEN_LENGTH                0x00000001

#define _C1FIFOCON8_RTREN_POSITION               0x00000006
#define _C1FIFOCON8_RTREN_MASK                   0x00000040
#define _C1FIFOCON8_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON8_TXEN_POSITION                0x00000007
#define _C1FIFOCON8_TXEN_MASK                    0x00000080
#define _C1FIFOCON8_TXEN_LENGTH                  0x00000001

#define _C1FIFOCON8_UINC_POSITION                0x00000008
#define _C1FIFOCON8_UINC_MASK                    0x00000100
#define _C1FIFOCON8_UINC_LENGTH                  0x00000001

#define _C1FIFOCON8_TXREQ_POSITION               0x00000009
#define _C1FIFOCON8_TXREQ_MASK                   0x00000200
#define _C1FIFOCON8_TXREQ_LENGTH                 0x00000001

#define _C1FIFOCON8_FRESET_POSITION              0x0000000A
#define _C1FIFOCON8_FRESET_MASK                  0x00000400
#define _C1FIFOCON8_FRESET_LENGTH                0x00000001

#define _C1FIFOCON8_TXPRI_POSITION               0x00000010
#define _C1FIFOCON8_TXPRI_MASK                   0x001F0000
#define _C1FIFOCON8_TXPRI_LENGTH                 0x00000005

#define _C1FIFOCON8_TXAT_POSITION                0x00000015
#define _C1FIFOCON8_TXAT_MASK                    0x00600000
#define _C1FIFOCON8_TXAT_LENGTH                  0x00000002

#define _C1FIFOCON8_FSIZE_POSITION               0x00000018
#define _C1FIFOCON8_FSIZE_MASK                   0x1F000000
#define _C1FIFOCON8_FSIZE_LENGTH                 0x00000005

#define _C1FIFOCON8_PLSIZE_POSITION              0x0000001D
#define _C1FIFOCON8_PLSIZE_MASK                  0xE0000000
#define _C1FIFOCON8_PLSIZE_LENGTH                0x00000003

#define _C1FIFOSTA8_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA8_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA8_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA8_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA8_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA8_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA8_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA8_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA8_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA8_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA8_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA8_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA8_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA8_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA8_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA8_TXERR_POSITION               0x00000005
#define _C1FIFOSTA8_TXERR_MASK                   0x00000020
#define _C1FIFOSTA8_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA8_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA8_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA8_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA8_TXABT_POSITION               0x00000007
#define _C1FIFOSTA8_TXABT_MASK                   0x00000080
#define _C1FIFOSTA8_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA8_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA8_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA8_FIFOCI_LENGTH                0x00000005

#define _C1FIFOUA8_FIFOUA_POSITION               0x00000000
#define _C1FIFOUA8_FIFOUA_MASK                   0xFFFFFFFF
#define _C1FIFOUA8_FIFOUA_LENGTH                 0x00000020

#define _C1FIFOCON9_TFNRFNIE_POSITION            0x00000000
#define _C1FIFOCON9_TFNRFNIE_MASK                0x00000001
#define _C1FIFOCON9_TFNRFNIE_LENGTH              0x00000001

#define _C1FIFOCON9_TFHRFHIE_POSITION            0x00000001
#define _C1FIFOCON9_TFHRFHIE_MASK                0x00000002
#define _C1FIFOCON9_TFHRFHIE_LENGTH              0x00000001

#define _C1FIFOCON9_TFERFFIE_POSITION            0x00000002
#define _C1FIFOCON9_TFERFFIE_MASK                0x00000004
#define _C1FIFOCON9_TFERFFIE_LENGTH              0x00000001

#define _C1FIFOCON9_RXOVIE_POSITION              0x00000003
#define _C1FIFOCON9_RXOVIE_MASK                  0x00000008
#define _C1FIFOCON9_RXOVIE_LENGTH                0x00000001

#define _C1FIFOCON9_TXATIE_POSITION              0x00000004
#define _C1FIFOCON9_TXATIE_MASK                  0x00000010
#define _C1FIFOCON9_TXATIE_LENGTH                0x00000001

#define _C1FIFOCON9_RXTSEN_POSITION              0x00000005
#define _C1FIFOCON9_RXTSEN_MASK                  0x00000020
#define _C1FIFOCON9_RXTSEN_LENGTH                0x00000001

#define _C1FIFOCON9_RTREN_POSITION               0x00000006
#define _C1FIFOCON9_RTREN_MASK                   0x00000040
#define _C1FIFOCON9_RTREN_LENGTH                 0x00000001

#define _C1FIFOCON9_TXEN_POSITION                0x00000007
#define _C1FIFOCON9_TXEN_MASK                    0x00000080
#define _C1FIFOCON9_TXEN_LENGTH                  0x00000001

#define _C1FIFOCON9_UINC_POSITION                0x00000008
#define _C1FIFOCON9_UINC_MASK                    0x00000100
#define _C1FIFOCON9_UINC_LENGTH                  0x00000001

#define _C1FIFOCON9_TXREQ_POSITION               0x00000009
#define _C1FIFOCON9_TXREQ_MASK                   0x00000200
#define _C1FIFOCON9_TXREQ_LENGTH                 0x00000001

