CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOCON9_FRESET_POSITION              0x0000000A
#define _C1FIFOCON9_FRESET_MASK                  0x00000400
#define _C1FIFOCON9_FRESET_LENGTH                0x00000001

#define _C1FIFOCON9_TXPRI_POSITION               0x00000010
#define _C1FIFOCON9_TXPRI_MASK                   0x001F0000
#define _C1FIFOCON9_TXPRI_LENGTH                 0x00000005

#define _C1FIFOCON9_TXAT_POSITION                0x00000015
#define _C1FIFOCON9_TXAT_MASK                    0x00600000
#define _C1FIFOCON9_TXAT_LENGTH                  0x00000002

#define _C1FIFOCON9_FSIZE_POSITION               0x00000018
#define _C1FIFOCON9_FSIZE_MASK                   0x1F000000
#define _C1FIFOCON9_FSIZE_LENGTH                 0x00000005

#define _C1FIFOCON9_PLSIZE_POSITION              0x0000001D
#define _C1FIFOCON9_PLSIZE_MASK                  0xE0000000
#define _C1FIFOCON9_PLSIZE_LENGTH                0x00000003

#define _C1FIFOSTA9_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA9_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA9_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA9_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA9_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA9_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA9_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA9_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA9_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA9_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA9_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA9_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA9_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA9_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA9_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA9_TXERR_POSITION               0x00000005
#define _C1FIFOSTA9_TXERR_MASK                   0x00000020
#define _C1FIFOSTA9_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA9_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA9_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA9_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA9_TXABT_POSITION               0x00000007
#define _C1FIFOSTA9_TXABT_MASK                   0x00000080
#define _C1FIFOSTA9_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA9_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA9_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA9_FIFOCI_LENGTH                0x00000005

#define _C1FIFOUA9_FIFOUA_POSITION               0x00000000
#define _C1FIFOUA9_FIFOUA_MASK                   0xFFFFFFFF
#define _C1FIFOUA9_FIFOUA_LENGTH                 0x00000020

#define _C1FIFOCON10_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON10_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON10_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON10_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON10_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON10_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON10_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON10_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON10_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON10_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON10_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON10_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON10_TXATIE_POSITION             0x00000004
#define _C1FIFOCON10_TXATIE_MASK                 0x00000010
#define _C1FIFOCON10_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON10_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON10_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON10_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON10_RTREN_POSITION              0x00000006
#define _C1FIFOCON10_RTREN_MASK                  0x00000040
#define _C1FIFOCON10_RTREN_LENGTH                0x00000001

#define _C1FIFOCON10_TXEN_POSITION               0x00000007
#define _C1FIFOCON10_TXEN_MASK                   0x00000080
#define _C1FIFOCON10_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON10_UINC_POSITION               0x00000008
#define _C1FIFOCON10_UINC_MASK                   0x00000100
#define _C1FIFOCON10_UINC_LENGTH                 0x00000001

#define _C1FIFOCON10_TXREQ_POSITION              0x00000009
#define _C1FIFOCON10_TXREQ_MASK                  0x00000200
#define _C1FIFOCON10_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON10_FRESET_POSITION             0x0000000A
#define _C1FIFOCON10_FRESET_MASK                 0x00000400
#define _C1FIFOCON10_FRESET_LENGTH               0x00000001

#define _C1FIFOCON10_TXPRI_POSITION              0x00000010
#define _C1FIFOCON10_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON10_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON10_TXAT_POSITION               0x00000015
#define _C1FIFOCON10_TXAT_MASK                   0x00600000
#define _C1FIFOCON10_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON10_FSIZE_POSITION              0x00000018
#define _C1FIFOCON10_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON10_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON10_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON10_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON10_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA10_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA10_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA10_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA10_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA10_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA10_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA10_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA10_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA10_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA10_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA10_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA10_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA10_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA10_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA10_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA10_TXERR_POSITION              0x00000005
#define _C1FIFOSTA10_TXERR_MASK                  0x00000020
#define _C1FIFOSTA10_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA10_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA10_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA10_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA10_TXABT_POSITION              0x00000007
#define _C1FIFOSTA10_TXABT_MASK                  0x00000080
#define _C1FIFOSTA10_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA10_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA10_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA10_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA10_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA10_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA10_FIFOUA_LENGTH                0x00000020

