CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOCON11_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON11_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON11_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON11_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON11_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON11_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON11_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON11_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON11_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON11_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON11_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON11_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON11_TXATIE_POSITION             0x00000004
#define _C1FIFOCON11_TXATIE_MASK                 0x00000010
#define _C1FIFOCON11_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON11_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON11_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON11_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON11_RTREN_POSITION              0x00000006
#define _C1FIFOCON11_RTREN_MASK                  0x00000040
#define _C1FIFOCON11_RTREN_LENGTH                0x00000001

#define _C1FIFOCON11_TXEN_POSITION               0x00000007
#define _C1FIFOCON11_TXEN_MASK                   0x00000080
#define _C1FIFOCON11_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON11_UINC_POSITION               0x00000008
#define _C1FIFOCON11_UINC_MASK                   0x00000100
#define _C1FIFOCON11_UINC_LENGTH                 0x00000001

#define _C1FIFOCON11_TXREQ_POSITION              0x00000009
#define _C1FIFOCON11_TXREQ_MASK                  0x00000200
#define _C1FIFOCON11_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON11_FRESET_POSITION             0x0000000A
#define _C1FIFOCON11_FRESET_MASK                 0x00000400
#define _C1FIFOCON11_FRESET_LENGTH               0x00000001

#define _C1FIFOCON11_TXPRI_POSITION              0x00000010
#define _C1FIFOCON11_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON11_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON11_TXAT_POSITION               0x00000015
#define _C1FIFOCON11_TXAT_MASK                   0x00600000
#define _C1FIFOCON11_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON11_FSIZE_POSITION              0x00000018
#define _C1FIFOCON11_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON11_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON11_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON11_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON11_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA11_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA11_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA11_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA11_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA11_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA11_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA11_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA11_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA11_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA11_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA11_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA11_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA11_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA11_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA11_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA11_TXERR_POSITION              0x00000005
#define _C1FIFOSTA11_TXERR_MASK                  0x00000020
#define _C1FIFOSTA11_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA11_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA11_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA11_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA11_TXABT_POSITION              0x00000007
#define _C1FIFOSTA11_TXABT_MASK                  0x00000080
#define _C1FIFOSTA11_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA11_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA11_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA11_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA11_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA11_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA11_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON12_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON12_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON12_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON12_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON12_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON12_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON12_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON12_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON12_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON12_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON12_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON12_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON12_TXATIE_POSITION             0x00000004
#define _C1FIFOCON12_TXATIE_MASK                 0x00000010
#define _C1FIFOCON12_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON12_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON12_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON12_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON12_RTREN_POSITION              0x00000006
#define _C1FIFOCON12_RTREN_MASK                  0x00000040
#define _C1FIFOCON12_RTREN_LENGTH                0x00000001

#define _C1FIFOCON12_TXEN_POSITION               0x00000007
#define _C1FIFOCON12_TXEN_MASK                   0x00000080
#define _C1FIFOCON12_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON12_UINC_POSITION               0x00000008
#define _C1FIFOCON12_UINC_MASK                   0x00000100
#define _C1FIFOCON12_UINC_LENGTH                 0x00000001

