CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOCON12_TXREQ_POSITION              0x00000009
#define _C1FIFOCON12_TXREQ_MASK                  0x00000200
#define _C1FIFOCON12_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON12_FRESET_POSITION             0x0000000A
#define _C1FIFOCON12_FRESET_MASK                 0x00000400
#define _C1FIFOCON12_FRESET_LENGTH               0x00000001

#define _C1FIFOCON12_TXPRI_POSITION              0x00000010
#define _C1FIFOCON12_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON12_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON12_TXAT_POSITION               0x00000015
#define _C1FIFOCON12_TXAT_MASK                   0x00600000
#define _C1FIFOCON12_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON12_FSIZE_POSITION              0x00000018
#define _C1FIFOCON12_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON12_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON12_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON12_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON12_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA12_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA12_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA12_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA12_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA12_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA12_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA12_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA12_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA12_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA12_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA12_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA12_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA12_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA12_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA12_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA12_TXERR_POSITION              0x00000005
#define _C1FIFOSTA12_TXERR_MASK                  0x00000020
#define _C1FIFOSTA12_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA12_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA12_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA12_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA12_TXABT_POSITION              0x00000007
#define _C1FIFOSTA12_TXABT_MASK                  0x00000080
#define _C1FIFOSTA12_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA12_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA12_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA12_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA12_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA12_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA12_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON13_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON13_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON13_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON13_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON13_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON13_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON13_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON13_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON13_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON13_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON13_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON13_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON13_TXATIE_POSITION             0x00000004
#define _C1FIFOCON13_TXATIE_MASK                 0x00000010
#define _C1FIFOCON13_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON13_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON13_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON13_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON13_RTREN_POSITION              0x00000006
#define _C1FIFOCON13_RTREN_MASK                  0x00000040
#define _C1FIFOCON13_RTREN_LENGTH                0x00000001

#define _C1FIFOCON13_TXEN_POSITION               0x00000007
#define _C1FIFOCON13_TXEN_MASK                   0x00000080
#define _C1FIFOCON13_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON13_UINC_POSITION               0x00000008
#define _C1FIFOCON13_UINC_MASK                   0x00000100
#define _C1FIFOCON13_UINC_LENGTH                 0x00000001

#define _C1FIFOCON13_TXREQ_POSITION              0x00000009
#define _C1FIFOCON13_TXREQ_MASK                  0x00000200
#define _C1FIFOCON13_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON13_FRESET_POSITION             0x0000000A
#define _C1FIFOCON13_FRESET_MASK                 0x00000400
#define _C1FIFOCON13_FRESET_LENGTH               0x00000001

#define _C1FIFOCON13_TXPRI_POSITION              0x00000010
#define _C1FIFOCON13_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON13_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON13_TXAT_POSITION               0x00000015
#define _C1FIFOCON13_TXAT_MASK                   0x00600000
#define _C1FIFOCON13_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON13_FSIZE_POSITION              0x00000018
#define _C1FIFOCON13_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON13_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON13_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON13_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON13_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA13_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA13_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA13_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA13_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA13_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA13_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA13_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA13_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA13_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA13_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA13_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA13_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA13_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA13_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA13_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA13_TXERR_POSITION              0x00000005
#define _C1FIFOSTA13_TXERR_MASK                  0x00000020
#define _C1FIFOSTA13_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA13_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA13_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA13_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA13_TXABT_POSITION              0x00000007
#define _C1FIFOSTA13_TXABT_MASK                  0x00000080
#define _C1FIFOSTA13_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA13_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA13_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA13_FIFOCI_LENGTH               0x00000005

