CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOUA13_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA13_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA13_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON14_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON14_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON14_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON14_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON14_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON14_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON14_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON14_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON14_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON14_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON14_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON14_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON14_TXATIE_POSITION             0x00000004
#define _C1FIFOCON14_TXATIE_MASK                 0x00000010
#define _C1FIFOCON14_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON14_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON14_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON14_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON14_RTREN_POSITION              0x00000006
#define _C1FIFOCON14_RTREN_MASK                  0x00000040
#define _C1FIFOCON14_RTREN_LENGTH                0x00000001

#define _C1FIFOCON14_TXEN_POSITION               0x00000007
#define _C1FIFOCON14_TXEN_MASK                   0x00000080
#define _C1FIFOCON14_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON14_UINC_POSITION               0x00000008
#define _C1FIFOCON14_UINC_MASK                   0x00000100
#define _C1FIFOCON14_UINC_LENGTH                 0x00000001

#define _C1FIFOCON14_TXREQ_POSITION              0x00000009
#define _C1FIFOCON14_TXREQ_MASK                  0x00000200
#define _C1FIFOCON14_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON14_FRESET_POSITION             0x0000000A
#define _C1FIFOCON14_FRESET_MASK                 0x00000400
#define _C1FIFOCON14_FRESET_LENGTH               0x00000001

#define _C1FIFOCON14_TXPRI_POSITION              0x00000010
#define _C1FIFOCON14_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON14_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON14_TXAT_POSITION               0x00000015
#define _C1FIFOCON14_TXAT_MASK                   0x00600000
#define _C1FIFOCON14_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON14_FSIZE_POSITION              0x00000018
#define _C1FIFOCON14_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON14_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON14_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON14_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON14_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA14_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA14_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA14_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA14_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA14_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA14_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA14_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA14_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA14_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA14_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA14_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA14_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA14_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA14_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA14_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA14_TXERR_POSITION              0x00000005
#define _C1FIFOSTA14_TXERR_MASK                  0x00000020
#define _C1FIFOSTA14_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA14_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA14_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA14_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA14_TXABT_POSITION              0x00000007
#define _C1FIFOSTA14_TXABT_MASK                  0x00000080
#define _C1FIFOSTA14_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA14_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA14_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA14_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA14_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA14_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA14_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON15_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON15_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON15_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON15_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON15_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON15_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON15_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON15_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON15_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON15_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON15_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON15_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON15_TXATIE_POSITION             0x00000004
#define _C1FIFOCON15_TXATIE_MASK                 0x00000010
#define _C1FIFOCON15_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON15_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON15_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON15_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON15_RTREN_POSITION              0x00000006
#define _C1FIFOCON15_RTREN_MASK                  0x00000040
#define _C1FIFOCON15_RTREN_LENGTH                0x00000001

#define _C1FIFOCON15_TXEN_POSITION               0x00000007
#define _C1FIFOCON15_TXEN_MASK                   0x00000080
#define _C1FIFOCON15_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON15_UINC_POSITION               0x00000008
#define _C1FIFOCON15_UINC_MASK                   0x00000100
#define _C1FIFOCON15_UINC_LENGTH                 0x00000001

#define _C1FIFOCON15_TXREQ_POSITION              0x00000009
#define _C1FIFOCON15_TXREQ_MASK                  0x00000200
#define _C1FIFOCON15_TXREQ_LENGTH                0x00000001

