CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOCON17_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON17_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON17_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON17_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON17_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON17_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON17_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON17_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON17_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON17_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON17_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON17_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON17_TXATIE_POSITION             0x00000004
#define _C1FIFOCON17_TXATIE_MASK                 0x00000010
#define _C1FIFOCON17_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON17_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON17_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON17_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON17_RTREN_POSITION              0x00000006
#define _C1FIFOCON17_RTREN_MASK                  0x00000040
#define _C1FIFOCON17_RTREN_LENGTH                0x00000001

#define _C1FIFOCON17_TXEN_POSITION               0x00000007
#define _C1FIFOCON17_TXEN_MASK                   0x00000080
#define _C1FIFOCON17_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON17_UINC_POSITION               0x00000008
#define _C1FIFOCON17_UINC_MASK                   0x00000100
#define _C1FIFOCON17_UINC_LENGTH                 0x00000001

#define _C1FIFOCON17_TXREQ_POSITION              0x00000009
#define _C1FIFOCON17_TXREQ_MASK                  0x00000200
#define _C1FIFOCON17_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON17_FRESET_POSITION             0x0000000A
#define _C1FIFOCON17_FRESET_MASK                 0x00000400
#define _C1FIFOCON17_FRESET_LENGTH               0x00000001

#define _C1FIFOCON17_TXPRI_POSITION              0x00000010
#define _C1FIFOCON17_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON17_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON17_TXAT_POSITION               0x00000015
#define _C1FIFOCON17_TXAT_MASK                   0x00600000
#define _C1FIFOCON17_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON17_FSIZE_POSITION              0x00000018
#define _C1FIFOCON17_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON17_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON17_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON17_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON17_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA17_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA17_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA17_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA17_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA17_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA17_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA17_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA17_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA17_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA17_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA17_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA17_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA17_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA17_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA17_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA17_TXERR_POSITION              0x00000005
#define _C1FIFOSTA17_TXERR_MASK                  0x00000020
#define _C1FIFOSTA17_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA17_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA17_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA17_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA17_TXABT_POSITION              0x00000007
#define _C1FIFOSTA17_TXABT_MASK                  0x00000080
#define _C1FIFOSTA17_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA17_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA17_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA17_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA17_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA17_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA17_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON18_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON18_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON18_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON18_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON18_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON18_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON18_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON18_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON18_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON18_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON18_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON18_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON18_TXATIE_POSITION             0x00000004
#define _C1FIFOCON18_TXATIE_MASK                 0x00000010
#define _C1FIFOCON18_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON18_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON18_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON18_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON18_RTREN_POSITION              0x00000006
#define _C1FIFOCON18_RTREN_MASK                  0x00000040
#define _C1FIFOCON18_RTREN_LENGTH                0x00000001

#define _C1FIFOCON18_TXEN_POSITION               0x00000007
#define _C1FIFOCON18_TXEN_MASK                   0x00000080
#define _C1FIFOCON18_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON18_UINC_POSITION               0x00000008
#define _C1FIFOCON18_UINC_MASK                   0x00000100
#define _C1FIFOCON18_UINC_LENGTH                 0x00000001

