CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOSTA22_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA22_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA22_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA22_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA22_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA22_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON23_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON23_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON23_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON23_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON23_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON23_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON23_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON23_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON23_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON23_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON23_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON23_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON23_TXATIE_POSITION             0x00000004
#define _C1FIFOCON23_TXATIE_MASK                 0x00000010
#define _C1FIFOCON23_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON23_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON23_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON23_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON23_RTREN_POSITION              0x00000006
#define _C1FIFOCON23_RTREN_MASK                  0x00000040
#define _C1FIFOCON23_RTREN_LENGTH                0x00000001

#define _C1FIFOCON23_TXEN_POSITION               0x00000007
#define _C1FIFOCON23_TXEN_MASK                   0x00000080
#define _C1FIFOCON23_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON23_UINC_POSITION               0x00000008
#define _C1FIFOCON23_UINC_MASK                   0x00000100
#define _C1FIFOCON23_UINC_LENGTH                 0x00000001

#define _C1FIFOCON23_TXREQ_POSITION              0x00000009
#define _C1FIFOCON23_TXREQ_MASK                  0x00000200
#define _C1FIFOCON23_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON23_FRESET_POSITION             0x0000000A
#define _C1FIFOCON23_FRESET_MASK                 0x00000400
#define _C1FIFOCON23_FRESET_LENGTH               0x00000001

#define _C1FIFOCON23_TXPRI_POSITION              0x00000010
#define _C1FIFOCON23_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON23_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON23_TXAT_POSITION               0x00000015
#define _C1FIFOCON23_TXAT_MASK                   0x00600000
#define _C1FIFOCON23_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON23_FSIZE_POSITION              0x00000018
#define _C1FIFOCON23_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON23_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON23_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON23_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON23_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA23_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA23_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA23_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA23_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA23_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA23_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA23_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA23_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA23_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA23_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA23_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA23_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA23_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA23_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA23_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA23_TXERR_POSITION              0x00000005
#define _C1FIFOSTA23_TXERR_MASK                  0x00000020
#define _C1FIFOSTA23_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA23_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA23_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA23_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA23_TXABT_POSITION              0x00000007
#define _C1FIFOSTA23_TXABT_MASK                  0x00000080
#define _C1FIFOSTA23_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA23_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA23_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA23_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA23_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA23_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA23_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON24_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON24_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON24_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON24_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON24_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON24_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON24_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON24_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON24_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON24_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON24_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON24_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON24_TXATIE_POSITION             0x00000004
#define _C1FIFOCON24_TXATIE_MASK                 0x00000010
#define _C1FIFOCON24_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON24_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON24_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON24_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON24_RTREN_POSITION              0x00000006
#define _C1FIFOCON24_RTREN_MASK                  0x00000040
#define _C1FIFOCON24_RTREN_LENGTH                0x00000001

#define _C1FIFOCON24_TXEN_POSITION               0x00000007
#define _C1FIFOCON24_TXEN_MASK                   0x00000080
#define _C1FIFOCON24_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON24_UINC_POSITION               0x00000008
#define _C1FIFOCON24_UINC_MASK                   0x00000100
#define _C1FIFOCON24_UINC_LENGTH                 0x00000001

#define _C1FIFOCON24_TXREQ_POSITION              0x00000009
#define _C1FIFOCON24_TXREQ_MASK                  0x00000200
#define _C1FIFOCON24_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON24_FRESET_POSITION             0x0000000A
#define _C1FIFOCON24_FRESET_MASK                 0x00000400
#define _C1FIFOCON24_FRESET_LENGTH               0x00000001

#define _C1FIFOCON24_TXPRI_POSITION              0x00000010
#define _C1FIFOCON24_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON24_TXPRI_LENGTH                0x00000005

