CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOSTA25_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA25_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA25_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA25_TXABT_POSITION              0x00000007
#define _C1FIFOSTA25_TXABT_MASK                  0x00000080
#define _C1FIFOSTA25_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA25_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA25_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA25_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA25_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA25_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA25_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON26_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON26_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON26_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON26_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON26_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON26_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON26_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON26_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON26_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON26_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON26_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON26_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON26_TXATIE_POSITION             0x00000004
#define _C1FIFOCON26_TXATIE_MASK                 0x00000010
#define _C1FIFOCON26_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON26_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON26_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON26_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON26_RTREN_POSITION              0x00000006
#define _C1FIFOCON26_RTREN_MASK                  0x00000040
#define _C1FIFOCON26_RTREN_LENGTH                0x00000001

#define _C1FIFOCON26_TXEN_POSITION               0x00000007
#define _C1FIFOCON26_TXEN_MASK                   0x00000080
#define _C1FIFOCON26_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON26_UINC_POSITION               0x00000008
#define _C1FIFOCON26_UINC_MASK                   0x00000100
#define _C1FIFOCON26_UINC_LENGTH                 0x00000001

#define _C1FIFOCON26_TXREQ_POSITION              0x00000009
#define _C1FIFOCON26_TXREQ_MASK                  0x00000200
#define _C1FIFOCON26_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON26_FRESET_POSITION             0x0000000A
#define _C1FIFOCON26_FRESET_MASK                 0x00000400
#define _C1FIFOCON26_FRESET_LENGTH               0x00000001

#define _C1FIFOCON26_TXPRI_POSITION              0x00000010
#define _C1FIFOCON26_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON26_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON26_TXAT_POSITION               0x00000015
#define _C1FIFOCON26_TXAT_MASK                   0x00600000
#define _C1FIFOCON26_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON26_FSIZE_POSITION              0x00000018
#define _C1FIFOCON26_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON26_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON26_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON26_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON26_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA26_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA26_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA26_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA26_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA26_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA26_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA26_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA26_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA26_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA26_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA26_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA26_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA26_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA26_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA26_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA26_TXERR_POSITION              0x00000005
#define _C1FIFOSTA26_TXERR_MASK                  0x00000020
#define _C1FIFOSTA26_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA26_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA26_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA26_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA26_TXABT_POSITION              0x00000007
#define _C1FIFOSTA26_TXABT_MASK                  0x00000080
#define _C1FIFOSTA26_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA26_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA26_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA26_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA26_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA26_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA26_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON27_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON27_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON27_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON27_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON27_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON27_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON27_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON27_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON27_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON27_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON27_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON27_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON27_TXATIE_POSITION             0x00000004
#define _C1FIFOCON27_TXATIE_MASK                 0x00000010
#define _C1FIFOCON27_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON27_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON27_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON27_RXTSEN_LENGTH               0x00000001

