CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOCON27_RTREN_POSITION              0x00000006
#define _C1FIFOCON27_RTREN_MASK                  0x00000040
#define _C1FIFOCON27_RTREN_LENGTH                0x00000001

#define _C1FIFOCON27_TXEN_POSITION               0x00000007
#define _C1FIFOCON27_TXEN_MASK                   0x00000080
#define _C1FIFOCON27_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON27_UINC_POSITION               0x00000008
#define _C1FIFOCON27_UINC_MASK                   0x00000100
#define _C1FIFOCON27_UINC_LENGTH                 0x00000001

#define _C1FIFOCON27_TXREQ_POSITION              0x00000009
#define _C1FIFOCON27_TXREQ_MASK                  0x00000200
#define _C1FIFOCON27_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON27_FRESET_POSITION             0x0000000A
#define _C1FIFOCON27_FRESET_MASK                 0x00000400
#define _C1FIFOCON27_FRESET_LENGTH               0x00000001

#define _C1FIFOCON27_TXPRI_POSITION              0x00000010
#define _C1FIFOCON27_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON27_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON27_TXAT_POSITION               0x00000015
#define _C1FIFOCON27_TXAT_MASK                   0x00600000
#define _C1FIFOCON27_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON27_FSIZE_POSITION              0x00000018
#define _C1FIFOCON27_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON27_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON27_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON27_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON27_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA27_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA27_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA27_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA27_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA27_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA27_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA27_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA27_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA27_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA27_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA27_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA27_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA27_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA27_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA27_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA27_TXERR_POSITION              0x00000005
#define _C1FIFOSTA27_TXERR_MASK                  0x00000020
#define _C1FIFOSTA27_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA27_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA27_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA27_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA27_TXABT_POSITION              0x00000007
#define _C1FIFOSTA27_TXABT_MASK                  0x00000080
#define _C1FIFOSTA27_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA27_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA27_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA27_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA27_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA27_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA27_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON28_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON28_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON28_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON28_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON28_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON28_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON28_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON28_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON28_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON28_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON28_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON28_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON28_TXATIE_POSITION             0x00000004
#define _C1FIFOCON28_TXATIE_MASK                 0x00000010
#define _C1FIFOCON28_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON28_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON28_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON28_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON28_RTREN_POSITION              0x00000006
#define _C1FIFOCON28_RTREN_MASK                  0x00000040
#define _C1FIFOCON28_RTREN_LENGTH                0x00000001

#define _C1FIFOCON28_TXEN_POSITION               0x00000007
#define _C1FIFOCON28_TXEN_MASK                   0x00000080
#define _C1FIFOCON28_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON28_UINC_POSITION               0x00000008
#define _C1FIFOCON28_UINC_MASK                   0x00000100
#define _C1FIFOCON28_UINC_LENGTH                 0x00000001

#define _C1FIFOCON28_TXREQ_POSITION              0x00000009
#define _C1FIFOCON28_TXREQ_MASK                  0x00000200
#define _C1FIFOCON28_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON28_FRESET_POSITION             0x0000000A
#define _C1FIFOCON28_FRESET_MASK                 0x00000400
#define _C1FIFOCON28_FRESET_LENGTH               0x00000001

#define _C1FIFOCON28_TXPRI_POSITION              0x00000010
#define _C1FIFOCON28_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON28_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON28_TXAT_POSITION               0x00000015
#define _C1FIFOCON28_TXAT_MASK                   0x00600000
#define _C1FIFOCON28_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON28_FSIZE_POSITION              0x00000018
#define _C1FIFOCON28_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON28_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON28_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON28_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON28_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA28_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA28_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA28_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA28_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA28_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA28_TFHRFHIF_LENGTH             0x00000001

