CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FIFOCON30_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON30_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON30_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON30_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON30_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON30_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON30_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON30_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON30_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON30_TXATIE_POSITION             0x00000004
#define _C1FIFOCON30_TXATIE_MASK                 0x00000010
#define _C1FIFOCON30_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON30_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON30_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON30_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON30_RTREN_POSITION              0x00000006
#define _C1FIFOCON30_RTREN_MASK                  0x00000040
#define _C1FIFOCON30_RTREN_LENGTH                0x00000001

#define _C1FIFOCON30_TXEN_POSITION               0x00000007
#define _C1FIFOCON30_TXEN_MASK                   0x00000080
#define _C1FIFOCON30_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON30_UINC_POSITION               0x00000008
#define _C1FIFOCON30_UINC_MASK                   0x00000100
#define _C1FIFOCON30_UINC_LENGTH                 0x00000001

#define _C1FIFOCON30_TXREQ_POSITION              0x00000009
#define _C1FIFOCON30_TXREQ_MASK                  0x00000200
#define _C1FIFOCON30_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON30_FRESET_POSITION             0x0000000A
#define _C1FIFOCON30_FRESET_MASK                 0x00000400
#define _C1FIFOCON30_FRESET_LENGTH               0x00000001

#define _C1FIFOCON30_TXPRI_POSITION              0x00000010
#define _C1FIFOCON30_TXPRI_MASK                  0x001F0000
#define _C1FIFOCON30_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON30_TXAT_POSITION               0x00000015
#define _C1FIFOCON30_TXAT_MASK                   0x00600000
#define _C1FIFOCON30_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON30_FSIZE_POSITION              0x00000018
#define _C1FIFOCON30_FSIZE_MASK                  0x1F000000
#define _C1FIFOCON30_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON30_PLSIZE_POSITION             0x0000001D
#define _C1FIFOCON30_PLSIZE_MASK                 0xE0000000
#define _C1FIFOCON30_PLSIZE_LENGTH               0x00000003

#define _C1FIFOSTA30_TFNRFNIF_POSITION           0x00000000
#define _C1FIFOSTA30_TFNRFNIF_MASK               0x00000001
#define _C1FIFOSTA30_TFNRFNIF_LENGTH             0x00000001

#define _C1FIFOSTA30_TFHRFHIF_POSITION           0x00000001
#define _C1FIFOSTA30_TFHRFHIF_MASK               0x00000002
#define _C1FIFOSTA30_TFHRFHIF_LENGTH             0x00000001

#define _C1FIFOSTA30_TFERFFIF_POSITION           0x00000002
#define _C1FIFOSTA30_TFERFFIF_MASK               0x00000004
#define _C1FIFOSTA30_TFERFFIF_LENGTH             0x00000001

#define _C1FIFOSTA30_RXOVIF_POSITION             0x00000003
#define _C1FIFOSTA30_RXOVIF_MASK                 0x00000008
#define _C1FIFOSTA30_RXOVIF_LENGTH               0x00000001

#define _C1FIFOSTA30_TXATIF_POSITION             0x00000004
#define _C1FIFOSTA30_TXATIF_MASK                 0x00000010
#define _C1FIFOSTA30_TXATIF_LENGTH               0x00000001

#define _C1FIFOSTA30_TXERR_POSITION              0x00000005
#define _C1FIFOSTA30_TXERR_MASK                  0x00000020
#define _C1FIFOSTA30_TXERR_LENGTH                0x00000001

#define _C1FIFOSTA30_TXLARB_POSITION             0x00000006
#define _C1FIFOSTA30_TXLARB_MASK                 0x00000040
#define _C1FIFOSTA30_TXLARB_LENGTH               0x00000001

#define _C1FIFOSTA30_TXABT_POSITION              0x00000007
#define _C1FIFOSTA30_TXABT_MASK                  0x00000080
#define _C1FIFOSTA30_TXABT_LENGTH                0x00000001

#define _C1FIFOSTA30_FIFOCI_POSITION             0x00000008
#define _C1FIFOSTA30_FIFOCI_MASK                 0x00001F00
#define _C1FIFOSTA30_FIFOCI_LENGTH               0x00000005

#define _C1FIFOUA30_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA30_FIFOUA_MASK                  0xFFFFFFFF
#define _C1FIFOUA30_FIFOUA_LENGTH                0x00000020

#define _C1FIFOCON31_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON31_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON31_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON31_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON31_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON31_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON31_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON31_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON31_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON31_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON31_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON31_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON31_TXATIE_POSITION             0x00000004
#define _C1FIFOCON31_TXATIE_MASK                 0x00000010
#define _C1FIFOCON31_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON31_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON31_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON31_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON31_RTREN_POSITION              0x00000006
#define _C1FIFOCON31_RTREN_MASK                  0x00000040
#define _C1FIFOCON31_RTREN_LENGTH                0x00000001

#define _C1FIFOCON31_TXEN_POSITION               0x00000007
#define _C1FIFOCON31_TXEN_MASK                   0x00000080
#define _C1FIFOCON31_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON31_UINC_POSITION               0x00000008
#define _C1FIFOCON31_UINC_MASK                   0x00000100
#define _C1FIFOCON31_UINC_LENGTH                 0x00000001

#define _C1FIFOCON31_TXREQ_POSITION              0x00000009
#define _C1FIFOCON31_TXREQ_MASK                  0x00000200
#define _C1FIFOCON31_TXREQ_LENGTH                0x00000001

