CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FLTCON6_F27BP_POSITION                0x00000018
#define _C1FLTCON6_F27BP_MASK                    0x1F000000
#define _C1FLTCON6_F27BP_LENGTH                  0x00000005

#define _C1FLTCON6_FLTEN27_POSITION              0x0000001F
#define _C1FLTCON6_FLTEN27_MASK                  0x80000000
#define _C1FLTCON6_FLTEN27_LENGTH                0x00000001

#define _C1FLTCON7_F28BP_POSITION                0x00000000
#define _C1FLTCON7_F28BP_MASK                    0x0000001F
#define _C1FLTCON7_F28BP_LENGTH                  0x00000005

#define _C1FLTCON7_FLTEN28_POSITION              0x00000007
#define _C1FLTCON7_FLTEN28_MASK                  0x00000080
#define _C1FLTCON7_FLTEN28_LENGTH                0x00000001

#define _C1FLTCON7_F29BP_POSITION                0x00000008
#define _C1FLTCON7_F29BP_MASK                    0x00001F00
#define _C1FLTCON7_F29BP_LENGTH                  0x00000005

#define _C1FLTCON7_FLTEN29_POSITION              0x0000000F
#define _C1FLTCON7_FLTEN29_MASK                  0x00008000
#define _C1FLTCON7_FLTEN29_LENGTH                0x00000001

#define _C1FLTCON7_F30BP_POSITION                0x00000010
#define _C1FLTCON7_F30BP_MASK                    0x001F0000
#define _C1FLTCON7_F30BP_LENGTH                  0x00000005

#define _C1FLTCON7_FLTEN30_POSITION              0x00000017
#define _C1FLTCON7_FLTEN30_MASK                  0x00800000
#define _C1FLTCON7_FLTEN30_LENGTH                0x00000001

#define _C1FLTCON7_F31BP_POSITION                0x00000018
#define _C1FLTCON7_F31BP_MASK                    0x1F000000
#define _C1FLTCON7_F31BP_LENGTH                  0x00000005

#define _C1FLTCON7_FLTEN31_POSITION              0x0000001F
#define _C1FLTCON7_FLTEN31_MASK                  0x80000000
#define _C1FLTCON7_FLTEN31_LENGTH                0x00000001

#define _C1FLTOBJ0_SID_POSITION                  0x00000000
#define _C1FLTOBJ0_SID_MASK                      0x000007FF
#define _C1FLTOBJ0_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ0_EID_POSITION                  0x0000000B
#define _C1FLTOBJ0_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ0_EID_LENGTH                    0x00000012

#define _C1FLTOBJ0_SID11_POSITION                0x0000001D
#define _C1FLTOBJ0_SID11_MASK                    0x20000000
#define _C1FLTOBJ0_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ0_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ0_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ0_EXIDE_LENGTH                  0x00000001

#define _C1MASK0_MSID_POSITION                   0x00000000
#define _C1MASK0_MSID_MASK                       0x000007FF
#define _C1MASK0_MSID_LENGTH                     0x0000000B

#define _C1MASK0_MEID_POSITION                   0x0000000B
#define _C1MASK0_MEID_MASK                       0x1FFFF800
#define _C1MASK0_MEID_LENGTH                     0x00000012

#define _C1MASK0_MSID11_POSITION                 0x0000001D
#define _C1MASK0_MSID11_MASK                     0x20000000
#define _C1MASK0_MSID11_LENGTH                   0x00000001

#define _C1MASK0_MIDE_POSITION                   0x0000001E
#define _C1MASK0_MIDE_MASK                       0x40000000
#define _C1MASK0_MIDE_LENGTH                     0x00000001

#define _C1FLTOBJ1_SID_POSITION                  0x00000000
#define _C1FLTOBJ1_SID_MASK                      0x000007FF
#define _C1FLTOBJ1_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ1_EID_POSITION                  0x0000000B
#define _C1FLTOBJ1_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ1_EID_LENGTH                    0x00000012

#define _C1FLTOBJ1_SID11_POSITION                0x0000001D
#define _C1FLTOBJ1_SID11_MASK                    0x20000000
#define _C1FLTOBJ1_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ1_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ1_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ1_EXIDE_LENGTH                  0x00000001

#define _C1MASK1_MSID_POSITION                   0x00000000
#define _C1MASK1_MSID_MASK                       0x000007FF
#define _C1MASK1_MSID_LENGTH                     0x0000000B

#define _C1MASK1_MEID_POSITION                   0x0000000B
#define _C1MASK1_MEID_MASK                       0x1FFFF800
#define _C1MASK1_MEID_LENGTH                     0x00000012

#define _C1MASK1_MSID11_POSITION                 0x0000001D
#define _C1MASK1_MSID11_MASK                     0x20000000
#define _C1MASK1_MSID11_LENGTH                   0x00000001

#define _C1MASK1_MIDE_POSITION                   0x0000001E
#define _C1MASK1_MIDE_MASK                       0x40000000
#define _C1MASK1_MIDE_LENGTH                     0x00000001

#define _C1FLTOBJ2_SID_POSITION                  0x00000000
#define _C1FLTOBJ2_SID_MASK                      0x000007FF
#define _C1FLTOBJ2_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ2_EID_POSITION                  0x0000000B
#define _C1FLTOBJ2_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ2_EID_LENGTH                    0x00000012

#define _C1FLTOBJ2_SID11_POSITION                0x0000001D
#define _C1FLTOBJ2_SID11_MASK                    0x20000000
#define _C1FLTOBJ2_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ2_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ2_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ2_EXIDE_LENGTH                  0x00000001

#define _C1MASK2_MSID_POSITION                   0x00000000
#define _C1MASK2_MSID_MASK                       0x000007FF
#define _C1MASK2_MSID_LENGTH                     0x0000000B

#define _C1MASK2_MEID_POSITION                   0x0000000B
#define _C1MASK2_MEID_MASK                       0x1FFFF800
#define _C1MASK2_MEID_LENGTH                     0x00000012

#define _C1MASK2_MSID11_POSITION                 0x0000001D
#define _C1MASK2_MSID11_MASK                     0x20000000
#define _C1MASK2_MSID11_LENGTH                   0x00000001

#define _C1MASK2_MIDE_POSITION                   0x0000001E
#define _C1MASK2_MIDE_MASK                       0x40000000
#define _C1MASK2_MIDE_LENGTH                     0x00000001

