CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FLTOBJ3_SID_POSITION                  0x00000000
#define _C1FLTOBJ3_SID_MASK                      0x000007FF
#define _C1FLTOBJ3_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ3_EID_POSITION                  0x0000000B
#define _C1FLTOBJ3_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ3_EID_LENGTH                    0x00000012

#define _C1FLTOBJ3_SID11_POSITION                0x0000001D
#define _C1FLTOBJ3_SID11_MASK                    0x20000000
#define _C1FLTOBJ3_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ3_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ3_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ3_EXIDE_LENGTH                  0x00000001

#define _C1MASK3_MSID_POSITION                   0x00000000
#define _C1MASK3_MSID_MASK                       0x000007FF
#define _C1MASK3_MSID_LENGTH                     0x0000000B

#define _C1MASK3_MEID_POSITION                   0x0000000B
#define _C1MASK3_MEID_MASK                       0x1FFFF800
#define _C1MASK3_MEID_LENGTH                     0x00000012

#define _C1MASK3_MSID11_POSITION                 0x0000001D
#define _C1MASK3_MSID11_MASK                     0x20000000
#define _C1MASK3_MSID11_LENGTH                   0x00000001

#define _C1MASK3_MIDE_POSITION                   0x0000001E
#define _C1MASK3_MIDE_MASK                       0x40000000
#define _C1MASK3_MIDE_LENGTH                     0x00000001

#define _C1FLTOBJ4_SID_POSITION                  0x00000000
#define _C1FLTOBJ4_SID_MASK                      0x000007FF
#define _C1FLTOBJ4_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ4_EID_POSITION                  0x0000000B
#define _C1FLTOBJ4_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ4_EID_LENGTH                    0x00000012

#define _C1FLTOBJ4_SID11_POSITION                0x0000001D
#define _C1FLTOBJ4_SID11_MASK                    0x20000000
#define _C1FLTOBJ4_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ4_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ4_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ4_EXIDE_LENGTH                  0x00000001

#define _C1MASK4_MSID_POSITION                   0x00000000
#define _C1MASK4_MSID_MASK                       0x000007FF
#define _C1MASK4_MSID_LENGTH                     0x0000000B

#define _C1MASK4_MEID_POSITION                   0x0000000B
#define _C1MASK4_MEID_MASK                       0x1FFFF800
#define _C1MASK4_MEID_LENGTH                     0x00000012

#define _C1MASK4_MSID11_POSITION                 0x0000001D
#define _C1MASK4_MSID11_MASK                     0x20000000
#define _C1MASK4_MSID11_LENGTH                   0x00000001

#define _C1MASK4_MIDE_POSITION                   0x0000001E
#define _C1MASK4_MIDE_MASK                       0x40000000
#define _C1MASK4_MIDE_LENGTH                     0x00000001

#define _C1FLTOBJ5_SID_POSITION                  0x00000000
#define _C1FLTOBJ5_SID_MASK                      0x000007FF
#define _C1FLTOBJ5_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ5_EID_POSITION                  0x0000000B
#define _C1FLTOBJ5_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ5_EID_LENGTH                    0x00000012

#define _C1FLTOBJ5_SID11_POSITION                0x0000001D
#define _C1FLTOBJ5_SID11_MASK                    0x20000000
#define _C1FLTOBJ5_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ5_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ5_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ5_EXIDE_LENGTH                  0x00000001

#define _C1MASK5_MSID_POSITION                   0x00000000
#define _C1MASK5_MSID_MASK                       0x000007FF
#define _C1MASK5_MSID_LENGTH                     0x0000000B

#define _C1MASK5_MEID_POSITION                   0x0000000B
#define _C1MASK5_MEID_MASK                       0x1FFFF800
#define _C1MASK5_MEID_LENGTH                     0x00000012

#define _C1MASK5_MSID11_POSITION                 0x0000001D
#define _C1MASK5_MSID11_MASK                     0x20000000
#define _C1MASK5_MSID11_LENGTH                   0x00000001

#define _C1MASK5_MIDE_POSITION                   0x0000001E
#define _C1MASK5_MIDE_MASK                       0x40000000
#define _C1MASK5_MIDE_LENGTH                     0x00000001

#define _C1FLTOBJ6_SID_POSITION                  0x00000000
#define _C1FLTOBJ6_SID_MASK                      0x000007FF
#define _C1FLTOBJ6_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ6_EID_POSITION                  0x0000000B
#define _C1FLTOBJ6_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ6_EID_LENGTH                    0x00000012

#define _C1FLTOBJ6_SID11_POSITION                0x0000001D
#define _C1FLTOBJ6_SID11_MASK                    0x20000000
#define _C1FLTOBJ6_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ6_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ6_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ6_EXIDE_LENGTH                  0x00000001

#define _C1MASK6_MSID_POSITION                   0x00000000
#define _C1MASK6_MSID_MASK                       0x000007FF
#define _C1MASK6_MSID_LENGTH                     0x0000000B

#define _C1MASK6_MEID_POSITION                   0x0000000B
#define _C1MASK6_MEID_MASK                       0x1FFFF800
#define _C1MASK6_MEID_LENGTH                     0x00000012

#define _C1MASK6_MSID11_POSITION                 0x0000001D
#define _C1MASK6_MSID11_MASK                     0x20000000
#define _C1MASK6_MSID11_LENGTH                   0x00000001

#define _C1MASK6_MIDE_POSITION                   0x0000001E
#define _C1MASK6_MIDE_MASK                       0x40000000
#define _C1MASK6_MIDE_LENGTH                     0x00000001

#define _C1FLTOBJ7_SID_POSITION                  0x00000000
#define _C1FLTOBJ7_SID_MASK                      0x000007FF
#define _C1FLTOBJ7_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ7_EID_POSITION                  0x0000000B
#define _C1FLTOBJ7_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ7_EID_LENGTH                    0x00000012

#define _C1FLTOBJ7_SID11_POSITION                0x0000001D
#define _C1FLTOBJ7_SID11_MASK                    0x20000000
#define _C1FLTOBJ7_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ7_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ7_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ7_EXIDE_LENGTH                  0x00000001

