CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1MASK7_MSID_POSITION                   0x00000000
#define _C1MASK7_MSID_MASK                       0x000007FF
#define _C1MASK7_MSID_LENGTH                     0x0000000B

#define _C1MASK7_MEID_POSITION                   0x0000000B
#define _C1MASK7_MEID_MASK                       0x1FFFF800
#define _C1MASK7_MEID_LENGTH                     0x00000012

#define _C1MASK7_MSID11_POSITION                 0x0000001D
#define _C1MASK7_MSID11_MASK                     0x20000000
#define _C1MASK7_MSID11_LENGTH                   0x00000001

#define _C1MASK7_MIDE_POSITION                   0x0000001E
#define _C1MASK7_MIDE_MASK                       0x40000000
#define _C1MASK7_MIDE_LENGTH                     0x00000001

#define _C1FLTOBJ8_SID_POSITION                  0x00000000
#define _C1FLTOBJ8_SID_MASK                      0x000007FF
#define _C1FLTOBJ8_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ8_EID_POSITION                  0x0000000B
#define _C1FLTOBJ8_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ8_EID_LENGTH                    0x00000012

#define _C1FLTOBJ8_SID11_POSITION                0x0000001D
#define _C1FLTOBJ8_SID11_MASK                    0x20000000
#define _C1FLTOBJ8_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ8_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ8_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ8_EXIDE_LENGTH                  0x00000001

#define _C1MASK8_MSID_POSITION                   0x00000000
#define _C1MASK8_MSID_MASK                       0x000007FF
#define _C1MASK8_MSID_LENGTH                     0x0000000B

#define _C1MASK8_MEID_POSITION                   0x0000000B
#define _C1MASK8_MEID_MASK                       0x1FFFF800
#define _C1MASK8_MEID_LENGTH                     0x00000012

#define _C1MASK8_MSID11_POSITION                 0x0000001D
#define _C1MASK8_MSID11_MASK                     0x20000000
#define _C1MASK8_MSID11_LENGTH                   0x00000001

#define _C1MASK8_MIDE_POSITION                   0x0000001E
#define _C1MASK8_MIDE_MASK                       0x40000000
#define _C1MASK8_MIDE_LENGTH                     0x00000001

#define _C1FLTOBJ9_SID_POSITION                  0x00000000
#define _C1FLTOBJ9_SID_MASK                      0x000007FF
#define _C1FLTOBJ9_SID_LENGTH                    0x0000000B

#define _C1FLTOBJ9_EID_POSITION                  0x0000000B
#define _C1FLTOBJ9_EID_MASK                      0x1FFFF800
#define _C1FLTOBJ9_EID_LENGTH                    0x00000012

#define _C1FLTOBJ9_SID11_POSITION                0x0000001D
#define _C1FLTOBJ9_SID11_MASK                    0x20000000
#define _C1FLTOBJ9_SID11_LENGTH                  0x00000001

#define _C1FLTOBJ9_EXIDE_POSITION                0x0000001E
#define _C1FLTOBJ9_EXIDE_MASK                    0x40000000
#define _C1FLTOBJ9_EXIDE_LENGTH                  0x00000001

#define _C1MASK9_MSID_POSITION                   0x00000000
#define _C1MASK9_MSID_MASK                       0x000007FF
#define _C1MASK9_MSID_LENGTH                     0x0000000B

#define _C1MASK9_MEID_POSITION                   0x0000000B
#define _C1MASK9_MEID_MASK                       0x1FFFF800
#define _C1MASK9_MEID_LENGTH                     0x00000012

#define _C1MASK9_MSID11_POSITION                 0x0000001D
#define _C1MASK9_MSID11_MASK                     0x20000000
#define _C1MASK9_MSID11_LENGTH                   0x00000001

#define _C1MASK9_MIDE_POSITION                   0x0000001E
#define _C1MASK9_MIDE_MASK                       0x40000000
#define _C1MASK9_MIDE_LENGTH                     0x00000001

#define _C1FLTOBJ10_SID_POSITION                 0x00000000
#define _C1FLTOBJ10_SID_MASK                     0x000007FF
#define _C1FLTOBJ10_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ10_EID_POSITION                 0x0000000B
#define _C1FLTOBJ10_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ10_EID_LENGTH                   0x00000012

#define _C1FLTOBJ10_SID11_POSITION               0x0000001D
#define _C1FLTOBJ10_SID11_MASK                   0x20000000
#define _C1FLTOBJ10_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ10_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ10_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ10_EXIDE_LENGTH                 0x00000001

#define _C1MASK10_MSID_POSITION                  0x00000000
#define _C1MASK10_MSID_MASK                      0x000007FF
#define _C1MASK10_MSID_LENGTH                    0x0000000B

#define _C1MASK10_MEID_POSITION                  0x0000000B
#define _C1MASK10_MEID_MASK                      0x1FFFF800
#define _C1MASK10_MEID_LENGTH                    0x00000012

#define _C1MASK10_MSID11_POSITION                0x0000001D
#define _C1MASK10_MSID11_MASK                    0x20000000
#define _C1MASK10_MSID11_LENGTH                  0x00000001

#define _C1MASK10_MIDE_POSITION                  0x0000001E
#define _C1MASK10_MIDE_MASK                      0x40000000
#define _C1MASK10_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ11_SID_POSITION                 0x00000000
#define _C1FLTOBJ11_SID_MASK                     0x000007FF
#define _C1FLTOBJ11_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ11_EID_POSITION                 0x0000000B
#define _C1FLTOBJ11_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ11_EID_LENGTH                   0x00000012

#define _C1FLTOBJ11_SID11_POSITION               0x0000001D
#define _C1FLTOBJ11_SID11_MASK                   0x20000000
#define _C1FLTOBJ11_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ11_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ11_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ11_EXIDE_LENGTH                 0x00000001

#define _C1MASK11_MSID_POSITION                  0x00000000
#define _C1MASK11_MSID_MASK                      0x000007FF
#define _C1MASK11_MSID_LENGTH                    0x0000000B

#define _C1MASK11_MEID_POSITION                  0x0000000B
#define _C1MASK11_MEID_MASK                      0x1FFFF800
#define _C1MASK11_MEID_LENGTH                    0x00000012

#define _C1MASK11_MSID11_POSITION                0x0000001D
#define _C1MASK11_MSID11_MASK                    0x20000000
#define _C1MASK11_MSID11_LENGTH                  0x00000001

