CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1MASK11_MIDE_POSITION                  0x0000001E
#define _C1MASK11_MIDE_MASK                      0x40000000
#define _C1MASK11_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ12_SID_POSITION                 0x00000000
#define _C1FLTOBJ12_SID_MASK                     0x000007FF
#define _C1FLTOBJ12_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ12_EID_POSITION                 0x0000000B
#define _C1FLTOBJ12_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ12_EID_LENGTH                   0x00000012

#define _C1FLTOBJ12_SID11_POSITION               0x0000001D
#define _C1FLTOBJ12_SID11_MASK                   0x20000000
#define _C1FLTOBJ12_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ12_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ12_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ12_EXIDE_LENGTH                 0x00000001

#define _C1MASK12_MSID_POSITION                  0x00000000
#define _C1MASK12_MSID_MASK                      0x000007FF
#define _C1MASK12_MSID_LENGTH                    0x0000000B

#define _C1MASK12_MEID_POSITION                  0x0000000B
#define _C1MASK12_MEID_MASK                      0x1FFFF800
#define _C1MASK12_MEID_LENGTH                    0x00000012

#define _C1MASK12_MSID11_POSITION                0x0000001D
#define _C1MASK12_MSID11_MASK                    0x20000000
#define _C1MASK12_MSID11_LENGTH                  0x00000001

#define _C1MASK12_MIDE_POSITION                  0x0000001E
#define _C1MASK12_MIDE_MASK                      0x40000000
#define _C1MASK12_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ13_SID_POSITION                 0x00000000
#define _C1FLTOBJ13_SID_MASK                     0x000007FF
#define _C1FLTOBJ13_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ13_EID_POSITION                 0x0000000B
#define _C1FLTOBJ13_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ13_EID_LENGTH                   0x00000012

#define _C1FLTOBJ13_SID11_POSITION               0x0000001D
#define _C1FLTOBJ13_SID11_MASK                   0x20000000
#define _C1FLTOBJ13_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ13_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ13_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ13_EXIDE_LENGTH                 0x00000001

#define _C1MASK13_MSID_POSITION                  0x00000000
#define _C1MASK13_MSID_MASK                      0x000007FF
#define _C1MASK13_MSID_LENGTH                    0x0000000B

#define _C1MASK13_MEID_POSITION                  0x0000000B
#define _C1MASK13_MEID_MASK                      0x1FFFF800
#define _C1MASK13_MEID_LENGTH                    0x00000012

#define _C1MASK13_MSID11_POSITION                0x0000001D
#define _C1MASK13_MSID11_MASK                    0x20000000
#define _C1MASK13_MSID11_LENGTH                  0x00000001

#define _C1MASK13_MIDE_POSITION                  0x0000001E
#define _C1MASK13_MIDE_MASK                      0x40000000
#define _C1MASK13_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ14_SID_POSITION                 0x00000000
#define _C1FLTOBJ14_SID_MASK                     0x000007FF
#define _C1FLTOBJ14_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ14_EID_POSITION                 0x0000000B
#define _C1FLTOBJ14_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ14_EID_LENGTH                   0x00000012

#define _C1FLTOBJ14_SID11_POSITION               0x0000001D
#define _C1FLTOBJ14_SID11_MASK                   0x20000000
#define _C1FLTOBJ14_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ14_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ14_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ14_EXIDE_LENGTH                 0x00000001

#define _C1MASK14_MSID_POSITION                  0x00000000
#define _C1MASK14_MSID_MASK                      0x000007FF
#define _C1MASK14_MSID_LENGTH                    0x0000000B

#define _C1MASK14_MEID_POSITION                  0x0000000B
#define _C1MASK14_MEID_MASK                      0x1FFFF800
#define _C1MASK14_MEID_LENGTH                    0x00000012

#define _C1MASK14_MSID11_POSITION                0x0000001D
#define _C1MASK14_MSID11_MASK                    0x20000000
#define _C1MASK14_MSID11_LENGTH                  0x00000001

#define _C1MASK14_MIDE_POSITION                  0x0000001E
#define _C1MASK14_MIDE_MASK                      0x40000000
#define _C1MASK14_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ15_SID_POSITION                 0x00000000
#define _C1FLTOBJ15_SID_MASK                     0x000007FF
#define _C1FLTOBJ15_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ15_EID_POSITION                 0x0000000B
#define _C1FLTOBJ15_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ15_EID_LENGTH                   0x00000012

#define _C1FLTOBJ15_SID11_POSITION               0x0000001D
#define _C1FLTOBJ15_SID11_MASK                   0x20000000
#define _C1FLTOBJ15_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ15_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ15_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ15_EXIDE_LENGTH                 0x00000001

#define _C1MASK15_MSID_POSITION                  0x00000000
#define _C1MASK15_MSID_MASK                      0x000007FF
#define _C1MASK15_MSID_LENGTH                    0x0000000B

#define _C1MASK15_MEID_POSITION                  0x0000000B
#define _C1MASK15_MEID_MASK                      0x1FFFF800
#define _C1MASK15_MEID_LENGTH                    0x00000012

#define _C1MASK15_MSID11_POSITION                0x0000001D
#define _C1MASK15_MSID11_MASK                    0x20000000
#define _C1MASK15_MSID11_LENGTH                  0x00000001

#define _C1MASK15_MIDE_POSITION                  0x0000001E
#define _C1MASK15_MIDE_MASK                      0x40000000
#define _C1MASK15_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ16_SID_POSITION                 0x00000000
#define _C1FLTOBJ16_SID_MASK                     0x000007FF
#define _C1FLTOBJ16_SID_LENGTH                   0x0000000B

