CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1FLTOBJ16_EID_POSITION                 0x0000000B
#define _C1FLTOBJ16_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ16_EID_LENGTH                   0x00000012

#define _C1FLTOBJ16_SID11_POSITION               0x0000001D
#define _C1FLTOBJ16_SID11_MASK                   0x20000000
#define _C1FLTOBJ16_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ16_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ16_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ16_EXIDE_LENGTH                 0x00000001

#define _C1MASK16_MSID_POSITION                  0x00000000
#define _C1MASK16_MSID_MASK                      0x000007FF
#define _C1MASK16_MSID_LENGTH                    0x0000000B

#define _C1MASK16_MEID_POSITION                  0x0000000B
#define _C1MASK16_MEID_MASK                      0x1FFFF800
#define _C1MASK16_MEID_LENGTH                    0x00000012

#define _C1MASK16_MSID11_POSITION                0x0000001D
#define _C1MASK16_MSID11_MASK                    0x20000000
#define _C1MASK16_MSID11_LENGTH                  0x00000001

#define _C1MASK16_MIDE_POSITION                  0x0000001E
#define _C1MASK16_MIDE_MASK                      0x40000000
#define _C1MASK16_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ17_SID_POSITION                 0x00000000
#define _C1FLTOBJ17_SID_MASK                     0x000007FF
#define _C1FLTOBJ17_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ17_EID_POSITION                 0x0000000B
#define _C1FLTOBJ17_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ17_EID_LENGTH                   0x00000012

#define _C1FLTOBJ17_SID11_POSITION               0x0000001D
#define _C1FLTOBJ17_SID11_MASK                   0x20000000
#define _C1FLTOBJ17_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ17_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ17_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ17_EXIDE_LENGTH                 0x00000001

#define _C1MASK17_MSID_POSITION                  0x00000000
#define _C1MASK17_MSID_MASK                      0x000007FF
#define _C1MASK17_MSID_LENGTH                    0x0000000B

#define _C1MASK17_MEID_POSITION                  0x0000000B
#define _C1MASK17_MEID_MASK                      0x1FFFF800
#define _C1MASK17_MEID_LENGTH                    0x00000012

#define _C1MASK17_MSID11_POSITION                0x0000001D
#define _C1MASK17_MSID11_MASK                    0x20000000
#define _C1MASK17_MSID11_LENGTH                  0x00000001

#define _C1MASK17_MIDE_POSITION                  0x0000001E
#define _C1MASK17_MIDE_MASK                      0x40000000
#define _C1MASK17_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ18_SID_POSITION                 0x00000000
#define _C1FLTOBJ18_SID_MASK                     0x000007FF
#define _C1FLTOBJ18_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ18_EID_POSITION                 0x0000000B
#define _C1FLTOBJ18_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ18_EID_LENGTH                   0x00000012

#define _C1FLTOBJ18_SID11_POSITION               0x0000001D
#define _C1FLTOBJ18_SID11_MASK                   0x20000000
#define _C1FLTOBJ18_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ18_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ18_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ18_EXIDE_LENGTH                 0x00000001

#define _C1MASK18_MSID_POSITION                  0x00000000
#define _C1MASK18_MSID_MASK                      0x000007FF
#define _C1MASK18_MSID_LENGTH                    0x0000000B

#define _C1MASK18_MEID_POSITION                  0x0000000B
#define _C1MASK18_MEID_MASK                      0x1FFFF800
#define _C1MASK18_MEID_LENGTH                    0x00000012

#define _C1MASK18_MSID11_POSITION                0x0000001D
#define _C1MASK18_MSID11_MASK                    0x20000000
#define _C1MASK18_MSID11_LENGTH                  0x00000001

#define _C1MASK18_MIDE_POSITION                  0x0000001E
#define _C1MASK18_MIDE_MASK                      0x40000000
#define _C1MASK18_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ19_SID_POSITION                 0x00000000
#define _C1FLTOBJ19_SID_MASK                     0x000007FF
#define _C1FLTOBJ19_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ19_EID_POSITION                 0x0000000B
#define _C1FLTOBJ19_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ19_EID_LENGTH                   0x00000012

#define _C1FLTOBJ19_SID11_POSITION               0x0000001D
#define _C1FLTOBJ19_SID11_MASK                   0x20000000
#define _C1FLTOBJ19_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ19_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ19_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ19_EXIDE_LENGTH                 0x00000001

#define _C1MASK19_MSID_POSITION                  0x00000000
#define _C1MASK19_MSID_MASK                      0x000007FF
#define _C1MASK19_MSID_LENGTH                    0x0000000B

#define _C1MASK19_MEID_POSITION                  0x0000000B
#define _C1MASK19_MEID_MASK                      0x1FFFF800
#define _C1MASK19_MEID_LENGTH                    0x00000012

#define _C1MASK19_MSID11_POSITION                0x0000001D
#define _C1MASK19_MSID11_MASK                    0x20000000
#define _C1MASK19_MSID11_LENGTH                  0x00000001

#define _C1MASK19_MIDE_POSITION                  0x0000001E
#define _C1MASK19_MIDE_MASK                      0x40000000
#define _C1MASK19_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ20_SID_POSITION                 0x00000000
#define _C1FLTOBJ20_SID_MASK                     0x000007FF
#define _C1FLTOBJ20_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ20_EID_POSITION                 0x0000000B
#define _C1FLTOBJ20_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ20_EID_LENGTH                   0x00000012

#define _C1FLTOBJ20_SID11_POSITION               0x0000001D
#define _C1FLTOBJ20_SID11_MASK                   0x20000000
#define _C1FLTOBJ20_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ20_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ20_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ20_EXIDE_LENGTH                 0x00000001

