CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1MASK24_MIDE_POSITION                  0x0000001E
#define _C1MASK24_MIDE_MASK                      0x40000000
#define _C1MASK24_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ25_SID_POSITION                 0x00000000
#define _C1FLTOBJ25_SID_MASK                     0x000007FF
#define _C1FLTOBJ25_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ25_EID_POSITION                 0x0000000B
#define _C1FLTOBJ25_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ25_EID_LENGTH                   0x00000012

#define _C1FLTOBJ25_SID11_POSITION               0x0000001D
#define _C1FLTOBJ25_SID11_MASK                   0x20000000
#define _C1FLTOBJ25_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ25_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ25_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ25_EXIDE_LENGTH                 0x00000001

#define _C1MASK25_MSID_POSITION                  0x00000000
#define _C1MASK25_MSID_MASK                      0x000007FF
#define _C1MASK25_MSID_LENGTH                    0x0000000B

#define _C1MASK25_MEID_POSITION                  0x0000000B
#define _C1MASK25_MEID_MASK                      0x1FFFF800
#define _C1MASK25_MEID_LENGTH                    0x00000012

#define _C1MASK25_MSID11_POSITION                0x0000001D
#define _C1MASK25_MSID11_MASK                    0x20000000
#define _C1MASK25_MSID11_LENGTH                  0x00000001

#define _C1MASK25_MIDE_POSITION                  0x0000001E
#define _C1MASK25_MIDE_MASK                      0x40000000
#define _C1MASK25_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ26_SID_POSITION                 0x00000000
#define _C1FLTOBJ26_SID_MASK                     0x000007FF
#define _C1FLTOBJ26_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ26_EID_POSITION                 0x0000000B
#define _C1FLTOBJ26_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ26_EID_LENGTH                   0x00000012

#define _C1FLTOBJ26_SID11_POSITION               0x0000001D
#define _C1FLTOBJ26_SID11_MASK                   0x20000000
#define _C1FLTOBJ26_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ26_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ26_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ26_EXIDE_LENGTH                 0x00000001

#define _C1MASK26_MSID_POSITION                  0x00000000
#define _C1MASK26_MSID_MASK                      0x000007FF
#define _C1MASK26_MSID_LENGTH                    0x0000000B

#define _C1MASK26_MEID_POSITION                  0x0000000B
#define _C1MASK26_MEID_MASK                      0x1FFFF800
#define _C1MASK26_MEID_LENGTH                    0x00000012

#define _C1MASK26_MSID11_POSITION                0x0000001D
#define _C1MASK26_MSID11_MASK                    0x20000000
#define _C1MASK26_MSID11_LENGTH                  0x00000001

#define _C1MASK26_MIDE_POSITION                  0x0000001E
#define _C1MASK26_MIDE_MASK                      0x40000000
#define _C1MASK26_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ27_SID_POSITION                 0x00000000
#define _C1FLTOBJ27_SID_MASK                     0x000007FF
#define _C1FLTOBJ27_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ27_EID_POSITION                 0x0000000B
#define _C1FLTOBJ27_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ27_EID_LENGTH                   0x00000012

#define _C1FLTOBJ27_SID11_POSITION               0x0000001D
#define _C1FLTOBJ27_SID11_MASK                   0x20000000
#define _C1FLTOBJ27_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ27_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ27_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ27_EXIDE_LENGTH                 0x00000001

#define _C1MASK27_MSID_POSITION                  0x00000000
#define _C1MASK27_MSID_MASK                      0x000007FF
#define _C1MASK27_MSID_LENGTH                    0x0000000B

#define _C1MASK27_MEID_POSITION                  0x0000000B
#define _C1MASK27_MEID_MASK                      0x1FFFF800
#define _C1MASK27_MEID_LENGTH                    0x00000012

#define _C1MASK27_MSID11_POSITION                0x0000001D
#define _C1MASK27_MSID11_MASK                    0x20000000
#define _C1MASK27_MSID11_LENGTH                  0x00000001

#define _C1MASK27_MIDE_POSITION                  0x0000001E
#define _C1MASK27_MIDE_MASK                      0x40000000
#define _C1MASK27_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ28_SID_POSITION                 0x00000000
#define _C1FLTOBJ28_SID_MASK                     0x000007FF
#define _C1FLTOBJ28_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ28_EID_POSITION                 0x0000000B
#define _C1FLTOBJ28_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ28_EID_LENGTH                   0x00000012

#define _C1FLTOBJ28_SID11_POSITION               0x0000001D
#define _C1FLTOBJ28_SID11_MASK                   0x20000000
#define _C1FLTOBJ28_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ28_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ28_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ28_EXIDE_LENGTH                 0x00000001

#define _C1MASK28_MSID_POSITION                  0x00000000
#define _C1MASK28_MSID_MASK                      0x000007FF
#define _C1MASK28_MSID_LENGTH                    0x0000000B

#define _C1MASK28_MEID_POSITION                  0x0000000B
#define _C1MASK28_MEID_MASK                      0x1FFFF800
#define _C1MASK28_MEID_LENGTH                    0x00000012

#define _C1MASK28_MSID11_POSITION                0x0000001D
#define _C1MASK28_MSID11_MASK                    0x20000000
#define _C1MASK28_MSID11_LENGTH                  0x00000001

#define _C1MASK28_MIDE_POSITION                  0x0000001E
#define _C1MASK28_MIDE_MASK                      0x40000000
#define _C1MASK28_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ29_SID_POSITION                 0x00000000
#define _C1FLTOBJ29_SID_MASK                     0x000007FF
#define _C1FLTOBJ29_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ29_EID_POSITION                 0x0000000B
#define _C1FLTOBJ29_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ29_EID_LENGTH                   0x00000012

#define _C1FLTOBJ29_SID11_POSITION               0x0000001D
#define _C1FLTOBJ29_SID11_MASK                   0x20000000
#define _C1FLTOBJ29_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ29_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ29_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ29_EXIDE_LENGTH                 0x00000001

