CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _C1MASK29_MSID_POSITION                  0x00000000
#define _C1MASK29_MSID_MASK                      0x000007FF
#define _C1MASK29_MSID_LENGTH                    0x0000000B

#define _C1MASK29_MEID_POSITION                  0x0000000B
#define _C1MASK29_MEID_MASK                      0x1FFFF800
#define _C1MASK29_MEID_LENGTH                    0x00000012

#define _C1MASK29_MSID11_POSITION                0x0000001D
#define _C1MASK29_MSID11_MASK                    0x20000000
#define _C1MASK29_MSID11_LENGTH                  0x00000001

#define _C1MASK29_MIDE_POSITION                  0x0000001E
#define _C1MASK29_MIDE_MASK                      0x40000000
#define _C1MASK29_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ30_SID_POSITION                 0x00000000
#define _C1FLTOBJ30_SID_MASK                     0x000007FF
#define _C1FLTOBJ30_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ30_EID_POSITION                 0x0000000B
#define _C1FLTOBJ30_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ30_EID_LENGTH                   0x00000012

#define _C1FLTOBJ30_SID11_POSITION               0x0000001D
#define _C1FLTOBJ30_SID11_MASK                   0x20000000
#define _C1FLTOBJ30_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ30_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ30_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ30_EXIDE_LENGTH                 0x00000001

#define _C1MASK30_MSID_POSITION                  0x00000000
#define _C1MASK30_MSID_MASK                      0x000007FF
#define _C1MASK30_MSID_LENGTH                    0x0000000B

#define _C1MASK30_MEID_POSITION                  0x0000000B
#define _C1MASK30_MEID_MASK                      0x1FFFF800
#define _C1MASK30_MEID_LENGTH                    0x00000012

#define _C1MASK30_MSID11_POSITION                0x0000001D
#define _C1MASK30_MSID11_MASK                    0x20000000
#define _C1MASK30_MSID11_LENGTH                  0x00000001

#define _C1MASK30_MIDE_POSITION                  0x0000001E
#define _C1MASK30_MIDE_MASK                      0x40000000
#define _C1MASK30_MIDE_LENGTH                    0x00000001

#define _C1FLTOBJ31_SID_POSITION                 0x00000000
#define _C1FLTOBJ31_SID_MASK                     0x000007FF
#define _C1FLTOBJ31_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ31_EID_POSITION                 0x0000000B
#define _C1FLTOBJ31_EID_MASK                     0x1FFFF800
#define _C1FLTOBJ31_EID_LENGTH                   0x00000012

#define _C1FLTOBJ31_SID11_POSITION               0x0000001D
#define _C1FLTOBJ31_SID11_MASK                   0x20000000
#define _C1FLTOBJ31_SID11_LENGTH                 0x00000001

#define _C1FLTOBJ31_EXIDE_POSITION               0x0000001E
#define _C1FLTOBJ31_EXIDE_MASK                   0x40000000
#define _C1FLTOBJ31_EXIDE_LENGTH                 0x00000001

#define _C1MASK31_MSID_POSITION                  0x00000000
#define _C1MASK31_MSID_MASK                      0x000007FF
#define _C1MASK31_MSID_LENGTH                    0x0000000B

#define _C1MASK31_MEID_POSITION                  0x0000000B
#define _C1MASK31_MEID_MASK                      0x1FFFF800
#define _C1MASK31_MEID_LENGTH                    0x00000012

#define _C1MASK31_MSID11_POSITION                0x0000001D
#define _C1MASK31_MSID11_MASK                    0x20000000
#define _C1MASK31_MSID11_LENGTH                  0x00000001

#define _C1MASK31_MIDE_POSITION                  0x0000001E
#define _C1MASK31_MIDE_MASK                      0x40000000
#define _C1MASK31_MIDE_LENGTH                    0x00000001

#define _ADCCON1_DMABL_POSITION                  0x00000000
#define _ADCCON1_DMABL_MASK                      0x00000007
#define _ADCCON1_DMABL_LENGTH                    0x00000003

#define _ADCCON1_STRGLVL_POSITION                0x00000003
#define _ADCCON1_STRGLVL_MASK                    0x00000008
#define _ADCCON1_STRGLVL_LENGTH                  0x00000001

#define _ADCCON1_IRQVS_POSITION                  0x00000004
#define _ADCCON1_IRQVS_MASK                      0x00000070
#define _ADCCON1_IRQVS_LENGTH                    0x00000003

#define _ADCCON1_FSPBCLKEN_POSITION              0x00000009
#define _ADCCON1_FSPBCLKEN_MASK                  0x00000200
#define _ADCCON1_FSPBCLKEN_LENGTH                0x00000001

#define _ADCCON1_FSSCLKEN_POSITION               0x0000000A
#define _ADCCON1_FSSCLKEN_MASK                   0x00000400
#define _ADCCON1_FSSCLKEN_LENGTH                 0x00000001

#define _ADCCON1_CVDEN_POSITION                  0x0000000B
#define _ADCCON1_CVDEN_MASK                      0x00000800
#define _ADCCON1_CVDEN_LENGTH                    0x00000001

#define _ADCCON1_AICPMPEN_POSITION               0x0000000C
#define _ADCCON1_AICPMPEN_MASK                   0x00001000
#define _ADCCON1_AICPMPEN_LENGTH                 0x00000001

#define _ADCCON1_SIDL_POSITION                   0x0000000D
#define _ADCCON1_SIDL_MASK                       0x00002000
#define _ADCCON1_SIDL_LENGTH                     0x00000001

#define _ADCCON1_ON_POSITION                     0x0000000F
#define _ADCCON1_ON_MASK                         0x00008000
#define _ADCCON1_ON_LENGTH                       0x00000001

#define _ADCCON1_STRGSRC_POSITION                0x00000010
#define _ADCCON1_STRGSRC_MASK                    0x001F0000
#define _ADCCON1_STRGSRC_LENGTH                  0x00000005

#define _ADCCON1_SELRES_POSITION                 0x00000015
#define _ADCCON1_SELRES_MASK                     0x00600000
#define _ADCCON1_SELRES_LENGTH                   0x00000002

#define _ADCCON1_FRACT_POSITION                  0x00000017
#define _ADCCON1_FRACT_MASK                      0x00800000
#define _ADCCON1_FRACT_LENGTH                    0x00000001

#define _ADCCON1_TRBSLV_POSITION                 0x00000018
#define _ADCCON1_TRBSLV_MASK                     0x07000000
#define _ADCCON1_TRBSLV_LENGTH                   0x00000003

#define _ADCCON1_TRBMST_POSITION                 0x0000001B
#define _ADCCON1_TRBMST_MASK                     0x38000000
#define _ADCCON1_TRBMST_LENGTH                   0x00000003

#define _ADCCON1_TRBERR_POSITION                 0x0000001E
#define _ADCCON1_TRBERR_MASK                     0x40000000
#define _ADCCON1_TRBERR_LENGTH                   0x00000001

#define _ADCCON1_TRBEN_POSITION                  0x0000001F
#define _ADCCON1_TRBEN_MASK                      0x80000000
#define _ADCCON1_TRBEN_LENGTH                    0x00000001

#define _ADCCON2_ADCDIV_POSITION                 0x00000000
#define _ADCCON2_ADCDIV_MASK                     0x0000007F
#define _ADCCON2_ADCDIV_LENGTH                   0x00000007

#define _ADCCON2_ADCEIS_POSITION                 0x00000008
#define _ADCCON2_ADCEIS_MASK                     0x00000700
#define _ADCCON2_ADCEIS_LENGTH                   0x00000003

#define _ADCCON2_ADCEIOVR_POSITION               0x0000000C
#define _ADCCON2_ADCEIOVR_MASK                   0x00001000
#define _ADCCON2_ADCEIOVR_LENGTH                 0x00000001

#define _ADCCON2_EOSIEN_POSITION                 0x0000000D
#define _ADCCON2_EOSIEN_MASK                     0x00002000
#define _ADCCON2_EOSIEN_LENGTH                   0x00000001

#define _ADCCON2_REFFLTIEN_POSITION              0x0000000E
#define _ADCCON2_REFFLTIEN_MASK                  0x00004000
#define _ADCCON2_REFFLTIEN_LENGTH                0x00000001

