CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _ADCEISTAT1_EIRDY14_POSITION             0x0000000E
#define _ADCEISTAT1_EIRDY14_MASK                 0x00004000
#define _ADCEISTAT1_EIRDY14_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY15_POSITION             0x0000000F
#define _ADCEISTAT1_EIRDY15_MASK                 0x00008000
#define _ADCEISTAT1_EIRDY15_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY16_POSITION             0x00000010
#define _ADCEISTAT1_EIRDY16_MASK                 0x00010000
#define _ADCEISTAT1_EIRDY16_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY17_POSITION             0x00000011
#define _ADCEISTAT1_EIRDY17_MASK                 0x00020000
#define _ADCEISTAT1_EIRDY17_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY18_POSITION             0x00000012
#define _ADCEISTAT1_EIRDY18_MASK                 0x00040000
#define _ADCEISTAT1_EIRDY18_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY19_POSITION             0x00000013
#define _ADCEISTAT1_EIRDY19_MASK                 0x00080000
#define _ADCEISTAT1_EIRDY19_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY24_POSITION             0x00000018
#define _ADCEISTAT1_EIRDY24_MASK                 0x01000000
#define _ADCEISTAT1_EIRDY24_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY25_POSITION             0x00000019
#define _ADCEISTAT1_EIRDY25_MASK                 0x02000000
#define _ADCEISTAT1_EIRDY25_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY26_POSITION             0x0000001A
#define _ADCEISTAT1_EIRDY26_MASK                 0x04000000
#define _ADCEISTAT1_EIRDY26_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY27_POSITION             0x0000001B
#define _ADCEISTAT1_EIRDY27_MASK                 0x08000000
#define _ADCEISTAT1_EIRDY27_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY40_POSITION             0x00000008
#define _ADCEISTAT2_EIRDY40_MASK                 0x00000100
#define _ADCEISTAT2_EIRDY40_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY41_POSITION             0x00000009
#define _ADCEISTAT2_EIRDY41_MASK                 0x00000200
#define _ADCEISTAT2_EIRDY41_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY46_POSITION             0x0000000E
#define _ADCEISTAT2_EIRDY46_MASK                 0x00004000
#define _ADCEISTAT2_EIRDY46_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY47_POSITION             0x0000000F
#define _ADCEISTAT2_EIRDY47_MASK                 0x00008000
#define _ADCEISTAT2_EIRDY47_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY48_POSITION             0x00000010
#define _ADCEISTAT2_EIRDY48_MASK                 0x00010000
#define _ADCEISTAT2_EIRDY48_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY49_POSITION             0x00000011
#define _ADCEISTAT2_EIRDY49_MASK                 0x00020000
#define _ADCEISTAT2_EIRDY49_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY50_POSITION             0x00000012
#define _ADCEISTAT2_EIRDY50_MASK                 0x00040000
#define _ADCEISTAT2_EIRDY50_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY51_POSITION             0x00000013
#define _ADCEISTAT2_EIRDY51_MASK                 0x00080000
#define _ADCEISTAT2_EIRDY51_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY52_POSITION             0x00000014
#define _ADCEISTAT2_EIRDY52_MASK                 0x00100000
#define _ADCEISTAT2_EIRDY52_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY53_POSITION             0x00000015
#define _ADCEISTAT2_EIRDY53_MASK                 0x00200000
#define _ADCEISTAT2_EIRDY53_LENGTH               0x00000001

#define _ADCANCON_ANEN0_POSITION                 0x00000000
#define _ADCANCON_ANEN0_MASK                     0x00000001
#define _ADCANCON_ANEN0_LENGTH                   0x00000001

#define _ADCANCON_ANEN1_POSITION                 0x00000001
#define _ADCANCON_ANEN1_MASK                     0x00000002
#define _ADCANCON_ANEN1_LENGTH                   0x00000001

#define _ADCANCON_ANEN2_POSITION                 0x00000002
#define _ADCANCON_ANEN2_MASK                     0x00000004
#define _ADCANCON_ANEN2_LENGTH                   0x00000001

#define _ADCANCON_ANEN3_POSITION                 0x00000003
#define _ADCANCON_ANEN3_MASK                     0x00000008
#define _ADCANCON_ANEN3_LENGTH                   0x00000001

#define _ADCANCON_ANEN4_POSITION                 0x00000004
#define _ADCANCON_ANEN4_MASK                     0x00000010
#define _ADCANCON_ANEN4_LENGTH                   0x00000001

#define _ADCANCON_ANEN7_POSITION                 0x00000007
#define _ADCANCON_ANEN7_MASK                     0x00000080
#define _ADCANCON_ANEN7_LENGTH                   0x00000001

#define _ADCANCON_WKRDY0_POSITION                0x00000008
#define _ADCANCON_WKRDY0_MASK                    0x00000100
#define _ADCANCON_WKRDY0_LENGTH                  0x00000001

#define _ADCANCON_WKRDY1_POSITION                0x00000009
#define _ADCANCON_WKRDY1_MASK                    0x00000200
#define _ADCANCON_WKRDY1_LENGTH                  0x00000001

#define _ADCANCON_WKRDY2_POSITION                0x0000000A
#define _ADCANCON_WKRDY2_MASK                    0x00000400
#define _ADCANCON_WKRDY2_LENGTH                  0x00000001

#define _ADCANCON_WKRDY3_POSITION                0x0000000B
#define _ADCANCON_WKRDY3_MASK                    0x00000800
#define _ADCANCON_WKRDY3_LENGTH                  0x00000001

#define _ADCANCON_WKRDY4_POSITION                0x0000000C
#define _ADCANCON_WKRDY4_MASK                    0x00001000
#define _ADCANCON_WKRDY4_LENGTH                  0x00000001

#define _ADCANCON_WKRDY7_POSITION                0x0000000F
#define _ADCANCON_WKRDY7_MASK                    0x00008000
#define _ADCANCON_WKRDY7_LENGTH                  0x00000001

#define _ADCANCON_WKIEN0_POSITION                0x00000010
#define _ADCANCON_WKIEN0_MASK                    0x00010000
#define _ADCANCON_WKIEN0_LENGTH                  0x00000001

#define _ADCANCON_WKIEN1_POSITION                0x00000011
#define _ADCANCON_WKIEN1_MASK                    0x00020000
#define _ADCANCON_WKIEN1_LENGTH                  0x00000001

#define _ADCANCON_WKIEN2_POSITION                0x00000012
#define _ADCANCON_WKIEN2_MASK                    0x00040000
#define _ADCANCON_WKIEN2_LENGTH                  0x00000001

