CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _ADCANCON_WKIEN3_POSITION                0x00000013
#define _ADCANCON_WKIEN3_MASK                    0x00080000
#define _ADCANCON_WKIEN3_LENGTH                  0x00000001

#define _ADCANCON_WKIEN4_POSITION                0x00000014
#define _ADCANCON_WKIEN4_MASK                    0x00100000
#define _ADCANCON_WKIEN4_LENGTH                  0x00000001

#define _ADCANCON_WKIEN7_POSITION                0x00000017
#define _ADCANCON_WKIEN7_MASK                    0x00800000
#define _ADCANCON_WKIEN7_LENGTH                  0x00000001

#define _ADCANCON_WKUPCLKCNT_POSITION            0x00000018
#define _ADCANCON_WKUPCLKCNT_MASK                0x0F000000
#define _ADCANCON_WKUPCLKCNT_LENGTH              0x00000004

#define _ADCDATA0_DATA_POSITION                  0x00000000
#define _ADCDATA0_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA0_DATA_LENGTH                    0x00000020

#define _ADCDATA1_DATA_POSITION                  0x00000000
#define _ADCDATA1_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA1_DATA_LENGTH                    0x00000020

#define _ADCDATA2_DATA_POSITION                  0x00000000
#define _ADCDATA2_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA2_DATA_LENGTH                    0x00000020

#define _ADCDATA3_DATA_POSITION                  0x00000000
#define _ADCDATA3_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA3_DATA_LENGTH                    0x00000020

#define _ADCDATA4_DATA_POSITION                  0x00000000
#define _ADCDATA4_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA4_DATA_LENGTH                    0x00000020

#define _ADCDATA5_DATA_POSITION                  0x00000000
#define _ADCDATA5_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA5_DATA_LENGTH                    0x00000020

#define _ADCDATA6_DATA_POSITION                  0x00000000
#define _ADCDATA6_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA6_DATA_LENGTH                    0x00000020

#define _ADCDATA7_DATA_POSITION                  0x00000000
#define _ADCDATA7_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA7_DATA_LENGTH                    0x00000020

#define _ADCDATA8_DATA_POSITION                  0x00000000
#define _ADCDATA8_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA8_DATA_LENGTH                    0x00000020

#define _ADCDATA9_DATA_POSITION                  0x00000000
#define _ADCDATA9_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA9_DATA_LENGTH                    0x00000020

#define _ADCDATA10_DATA_POSITION                 0x00000000
#define _ADCDATA10_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA10_DATA_LENGTH                   0x00000020

#define _ADCDATA11_DATA_POSITION                 0x00000000
#define _ADCDATA11_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA11_DATA_LENGTH                   0x00000020

#define _ADCDATA12_DATA_POSITION                 0x00000000
#define _ADCDATA12_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA12_DATA_LENGTH                   0x00000020

#define _ADCDATA13_DATA_POSITION                 0x00000000
#define _ADCDATA13_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA13_DATA_LENGTH                   0x00000020

#define _ADCDATA14_DATA_POSITION                 0x00000000
#define _ADCDATA14_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA14_DATA_LENGTH                   0x00000020

#define _ADCDATA15_DATA_POSITION                 0x00000000
#define _ADCDATA15_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA15_DATA_LENGTH                   0x00000020

#define _ADCDATA16_DATA_POSITION                 0x00000000
#define _ADCDATA16_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA16_DATA_LENGTH                   0x00000020

#define _ADCDATA17_DATA_POSITION                 0x00000000
#define _ADCDATA17_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA17_DATA_LENGTH                   0x00000020

#define _ADCDATA18_DATA_POSITION                 0x00000000
#define _ADCDATA18_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA18_DATA_LENGTH                   0x00000020

#define _ADCDATA19_DATA_POSITION                 0x00000000
#define _ADCDATA19_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA19_DATA_LENGTH                   0x00000020

#define _ADCDATA24_DATA_POSITION                 0x00000000
#define _ADCDATA24_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA24_DATA_LENGTH                   0x00000020

#define _ADCDATA25_DATA_POSITION                 0x00000000
#define _ADCDATA25_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA25_DATA_LENGTH                   0x00000020

#define _ADCDATA26_DATA_POSITION                 0x00000000
#define _ADCDATA26_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA26_DATA_LENGTH                   0x00000020

#define _ADCDATA27_DATA_POSITION                 0x00000000
#define _ADCDATA27_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA27_DATA_LENGTH                   0x00000020

#define _ADCDATA40_DATA_POSITION                 0x00000000
#define _ADCDATA40_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA40_DATA_LENGTH                   0x00000020

#define _ADCDATA41_DATA_POSITION                 0x00000000
#define _ADCDATA41_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA41_DATA_LENGTH                   0x00000020

#define _ADCDATA46_DATA_POSITION                 0x00000000
#define _ADCDATA46_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA46_DATA_LENGTH                   0x00000020

#define _ADCDATA47_DATA_POSITION                 0x00000000
#define _ADCDATA47_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA47_DATA_LENGTH                   0x00000020

#define _ADCDATA48_DATA_POSITION                 0x00000000
#define _ADCDATA48_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA48_DATA_LENGTH                   0x00000020

#define _ADCDATA49_DATA_POSITION                 0x00000000
#define _ADCDATA49_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA49_DATA_LENGTH                   0x00000020

#define _ADCDATA50_DATA_POSITION                 0x00000000
#define _ADCDATA50_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA50_DATA_LENGTH                   0x00000020

#define _ADCDATA51_DATA_POSITION                 0x00000000
#define _ADCDATA51_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA51_DATA_LENGTH                   0x00000020

#define _ADCDATA52_DATA_POSITION                 0x00000000
#define _ADCDATA52_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA52_DATA_LENGTH                   0x00000020

