CyberCastle/PIC32-MCU-Compiler/pic32-part-support/include/proc/p32mk0512mch064.h
#define _SEQ_CSEQ_POSITION                       0x00000010
#define _SEQ_CSEQ_MASK                           0xFFFF0000
#define _SEQ_CSEQ_LENGTH                         0x00000010

#define _SEQ_w_POSITION                          0x00000000
#define _SEQ_w_MASK                              0xFFFFFFFF
#define _SEQ_w_LENGTH                            0x00000020

#define _DEVADC0_ADCCALDATA_POSITION             0x00000000
#define _DEVADC0_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC0_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC0_w_POSITION                      0x00000000
#define _DEVADC0_w_MASK                          0xFFFFFFFF
#define _DEVADC0_w_LENGTH                        0x00000020

#define _DEVADC1_ADCCALDATA_POSITION             0x00000000
#define _DEVADC1_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC1_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC1_w_POSITION                      0x00000000
#define _DEVADC1_w_MASK                          0xFFFFFFFF
#define _DEVADC1_w_LENGTH                        0x00000020

#define _DEVADC2_ADCCALDATA_POSITION             0x00000000
#define _DEVADC2_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC2_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC2_w_POSITION                      0x00000000
#define _DEVADC2_w_MASK                          0xFFFFFFFF
#define _DEVADC2_w_LENGTH                        0x00000020

#define _DEVADC3_ADCCALDATA_POSITION             0x00000000
#define _DEVADC3_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC3_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC3_w_POSITION                      0x00000000
#define _DEVADC3_w_MASK                          0xFFFFFFFF
#define _DEVADC3_w_LENGTH                        0x00000020

#define _DEVADC4_ADCCALDATA_POSITION             0x00000000
#define _DEVADC4_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC4_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC4_w_POSITION                      0x00000000
#define _DEVADC4_w_MASK                          0xFFFFFFFF
#define _DEVADC4_w_LENGTH                        0x00000020

#define _DEVADC7_ADCCALDATA_POSITION             0x00000000
#define _DEVADC7_ADCCALDATA_MASK                 0xFFFFFFFF
#define _DEVADC7_ADCCALDATA_LENGTH               0x00000020

#define _DEVADC7_w_POSITION                      0x00000000
#define _DEVADC7_w_MASK                          0xFFFFFFFF
#define _DEVADC7_w_LENGTH                        0x00000020

#define _DEVSN0_SN_POSITION                      0x00000000
#define _DEVSN0_SN_MASK                          0xFFFFFFFF
#define _DEVSN0_SN_LENGTH                        0x00000020

#define _DEVSN0_w_POSITION                       0x00000000
#define _DEVSN0_w_MASK                           0xFFFFFFFF
#define _DEVSN0_w_LENGTH                         0x00000020

#define _DEVSN1_SN_POSITION                      0x00000000
#define _DEVSN1_SN_MASK                          0xFFFFFFFF
#define _DEVSN1_SN_LENGTH                        0x00000020

#define _DEVSN1_w_POSITION                       0x00000000
#define _DEVSN1_w_MASK                           0xFFFFFFFF
#define _DEVSN1_w_LENGTH                         0x00000020

#define _DEVSN2_SN_POSITION                      0x00000000
#define _DEVSN2_SN_MASK                          0xFFFFFFFF
#define _DEVSN2_SN_LENGTH                        0x00000020

#define _DEVSN2_w_POSITION                       0x00000000
#define _DEVSN2_w_MASK                           0xFFFFFFFF
#define _DEVSN2_w_LENGTH                         0x00000020

#define _DEVSN3_SN_POSITION                      0x00000000
#define _DEVSN3_SN_MASK                          0xFFFFFFFF
#define _DEVSN3_SN_LENGTH                        0x00000020

#define _DEVSN3_w_POSITION                       0x00000000
#define _DEVSN3_w_MASK                           0xFFFFFFFF
#define _DEVSN3_w_LENGTH                         0x00000020

#define _UBADEVCFG3_USERID_POSITION              0x00000000
#define _UBADEVCFG3_USERID_MASK                  0x0000FFFF
#define _UBADEVCFG3_USERID_LENGTH                0x00000010

#define _UBADEVCFG3_PGL1WAY_POSITION             0x0000001B
#define _UBADEVCFG3_PGL1WAY_MASK                 0x08000000
#define _UBADEVCFG3_PGL1WAY_LENGTH               0x00000001

#define _UBADEVCFG3_PMDL1WAY_POSITION            0x0000001C
#define _UBADEVCFG3_PMDL1WAY_MASK                0x10000000
#define _UBADEVCFG3_PMDL1WAY_LENGTH              0x00000001

#define _UBADEVCFG3_IOL1WAY_POSITION             0x0000001D
#define _UBADEVCFG3_IOL1WAY_MASK                 0x20000000
#define _UBADEVCFG3_IOL1WAY_LENGTH               0x00000001

#define _UBADEVCFG3_w_POSITION                   0x00000000
#define _UBADEVCFG3_w_MASK                       0xFFFFFFFF
#define _UBADEVCFG3_w_LENGTH                     0x00000020

#define _UBADEVCFG2_FPLLIDIV_POSITION            0x00000000
#define _UBADEVCFG2_FPLLIDIV_MASK                0x00000007
#define _UBADEVCFG2_FPLLIDIV_LENGTH              0x00000003

#define _UBADEVCFG2_FPLLRNG_POSITION             0x00000004
#define _UBADEVCFG2_FPLLRNG_MASK                 0x00000070
#define _UBADEVCFG2_FPLLRNG_LENGTH               0x00000003

#define _UBADEVCFG2_FPLLICLK_POSITION            0x00000007
#define _UBADEVCFG2_FPLLICLK_MASK                0x00000080
#define _UBADEVCFG2_FPLLICLK_LENGTH              0x00000001

#define _UBADEVCFG2_FPLLMULT_POSITION            0x00000008
#define _UBADEVCFG2_FPLLMULT_MASK                0x00007F00
#define _UBADEVCFG2_FPLLMULT_LENGTH              0x00000007

#define _UBADEVCFG2_FPLLODIV_POSITION            0x00000010
#define _UBADEVCFG2_FPLLODIV_MASK                0x00070000
#define _UBADEVCFG2_FPLLODIV_LENGTH              0x00000003

#define _UBADEVCFG2_VBATBOREN_POSITION           0x00000013
#define _UBADEVCFG2_VBATBOREN_MASK               0x00080000
#define _UBADEVCFG2_VBATBOREN_LENGTH             0x00000001

#define _UBADEVCFG2_DSBOREN_POSITION             0x00000014
#define _UBADEVCFG2_DSBOREN_MASK                 0x00100000
#define _UBADEVCFG2_DSBOREN_LENGTH               0x00000001

#define _UBADEVCFG2_DSWDTPS_POSITION             0x00000015
#define _UBADEVCFG2_DSWDTPS_MASK                 0x03E00000
#define _UBADEVCFG2_DSWDTPS_LENGTH               0x00000005

#define _UBADEVCFG2_DSWDTOSC_POSITION            0x0000001A
#define _UBADEVCFG2_DSWDTOSC_MASK                0x04000000
#define _UBADEVCFG2_DSWDTOSC_LENGTH              0x00000001

